{"records":[{"state":2,"id":"id_s0","surname":"Ambrož","text":"Po maturitě na SGO v roce 1900 studoval klasickou filologii na karlo-Ferdinandově univerzitě v Praze. Působil v Uherském Hradišti, v Moravské Ostravě, v Boskovicích a v Hranicích. Od roku 1917 zakotvil natrvalo na Slovanském gymnáziu v Olomouci, kde učil češtinu, latinu a řečtinu až do svého penzionování v roce 1935. Od svých studií byl literárně aktivní. Hojně publikoval v Časopisu VSMO, ve Vlasteneckém sborníku střední a severní Moravy a v denních listech. Publikoval články o dějinách svého rodiště, pověsti z vyprávění rodáků a Vzpomínky stařenky Vavrdové. V letech 1919 - 1925 byl kronikářem Moravičan. V roce 1928 publikoval ve Vlastivědném sborníku střední a severní Moravy samostatnou přílohu s názvem Pověsti našeho kraje.","name":"Vlastimil","title":"středoškolský profesor a publicista","birth":"18. dubna 1880 Moravičany","died":"30. ledna 1940 Olomouc"},{"state":0,"id":"id_s1","surname":"Babíček","text":"I když Zdeněk Babíček svým založením a zájmy dokazoval, že „nejen studiem živ je student“, na Slovanském gymnáziu měl vždy vyznamenání. Od dětství byl nadšeným skautem a své mimořádné fyzické dispozice uplatňoval ve všech možných sportech (mj. byl bratrancem naší zlaté olympioničky Dany Zátopkové). Jeho největší láskou však byla letadla Hanáckého aeroklubu. Na Slovanském gymnáziu maturoval v politicky napjaté atmosféře roku 1938. Přímo od maturity se při květnové mobilizaci přihlásil do armády. Na naléhání rodičů upustil od úmyslu stát se důstojníkem z povolání a zapsal se na Lékařskou fakultu Univerzity Karlovy. Rozšiřoval ilegální tiskoviny, spolupracoval s vojenskou podzemní organizací Obrana národa. Zúčastnil se studentských nepokojů 28. října 1939 a pohřbu svého kolegy MUC. Jana Opletala, šlo po něm gestapo. Ilegálně přešel hranice 3. ledna 1940 a po čtyřměsíční strastiplné cestě přes Maďarsko, Jugoslávii, Řecko, Turecko, Libanon a Egypt se přepravil do Marseille. Jako dobrovolník byl ihned zařazen do obranných bojů u 6. baterie dělostřeleckého pluku u Sigeanu. Po kapitulaci Francie se přihlásil k letecké jednotce formované pro boj v Anglii. Projel napříč Francií a z Port Vendres byl přepraven anglickou válečnou lodí do Liverpoolu. Nejdříve pracoval jako mechanik, po zalétání na letišti u Damfries ve Skotsku byl převelen v hodnosti seržanta R.A.F. k 311. bombardovací peruti v Homingtonu. S ní byl nasazen přímo do bojů v letecké bitvě o Británii. Zúčastnil se 22 bojových letů. 16. června 1941 byl vyznamenán medailí za chrabrost, 10. srpna 1941 obdržel Čsl. válečný kříž za statečnost (druhým Válečným křížem a Zlatým křížem Junáka byl vyznamenán in memoriam). Dne 15. září 1941 se Zdeňkova posádka přihlásila k riskantnímu úkolu - zničit pýchu nacistického zbrojního průmyslu Waffenwerke Hamburg. Při vstupu do německého vzdušného prostoru byl Zdeňkův stroj napaden letkou stíhačů Bf 110. Za bezoblačné oblohy, a při plném zatížení bombami nešlo uplatnit letecké mistrovství získané sportovním létáním nad olomouckými střechami. Přesto první dva útoky odrazili… Od tohoto dne žil Zdeněk jen ve vzpomínkách svých kamarádů a v srdcích svých nejbližších. Až téměř po padesáti letech záměrného mlčení byl Zdeněk Babíček dne 29. května 1991 rozkazem prezidenta republiky Václava Havla povýšen do hodnosti podplukovníka letectva - in memoriam. ","name":"Zdeněk","title":"hrdina letecké bitvy o Velkou Británii","birth":"7. listopadu 1919 Brno","died":"15. září 1941 Lingen"},{"state":0,"id":"id_s2","surname":"Babička","text":"Na Slovanském gymnáziu maturoval v roce 1876. Společně se svým bratrem Antonínem (1857 - 1879) organizoval český studentský kulturní a vlastenecký život. Byl nadšeným žákem ředitele Jana Evangelisty Kosiny a spiritus agens jeho vlasteneckého kroužku. Po maturitě odešel do Prahy studovat práva, ale brzy se začal věnovat žurnalistice. Publikoval zejména v moravském katolickém listu Našinec a od roku 1877 i v časopise Koleda. Zemřel v mladém věku na tuberkulózu při pobytu u svého bratra ve Zlíně. Jeho literární a hudební kritiky uspořádal a vydal o 30 let později knižně Miloslav Hýsek pod názvem O české literatuře (1910).","name":"Hynek","title":"literární kritik a novinář ","birth":"26. října 1855 Blatec","died":"22. března 1880 Zlín "},{"state":2,"id":"id_s3","surname":"Bartocha","text":"Po studiích filologie na Univerzitě Karlově v Praze působil v letech 1882 - 1889 na gymnáziu v Přerově, aby se vrátil na Slovanské gymnázium v Olomouci, které mu dalo středoškolské vzdělání (maturoval v roce 1878) a učil na něm v letech 1890 - 1908 českému jazyku, latině a řečtině. Následně byl ředitelem gymnázia v Uherském Hradišti, kde svoji pedagogickou dráhu završil. Byl činný v českých vlasteneckých spolcích, zejména v Jednotě divadelních ochotníků besedních. Je autorem historických a literárně vědných prací.","name":"Josef","title":"historik, spisovatel, pedagog ","birth":"21. března 1859 Lověšice u Přerova","died":"4. listopadu 1927 Olomouc"},{"state":1,"id":"id_s4","surname":"Bartocha","text":"Je legendou Slovanského gymnázia; společně se svým otcem Josefem Bartochou zde pedagogicky působili 57 let. Sám na SGO učil 35 let francouzštinu, latinu a němčinu. Zabýval se dějinami olomouckého školství a Vlastivědné společnosti muzejní. Publikoval rovněž mnoho bibliografických a literárně kritických a dějepisných studií. Velmi příznivě ovlivňoval kulturní a hudební život školy. Byl členem výboru pro oslavy jubileí SGO v letech 1947, 1957 a 1967, měl zásadní podíl na vydání jubilejních almanachů, které jsou dobovým zdrojem informací z historie olomouckého školství.","name":"Rostislav","title":"pedagog, filolog, historik a překladatel","birth":"9. dubna 1896 Olomouc","died":"10. ledna 1978 Olomouc"},{"state":0,"id":"id_s5","surname":"Bernatský","text":"Na SGO maturoval v roce 1923. Poté studoval na Filosofické fakultě Masarykovy univerzity v Brně. Psát začal již za studií. Kromě poezie se zabýval i překlady a historií francouzské literatury. V Brně byl členem literárního sdružení Moravské kolo spisovatelů. Řadu let působil jako redaktor a učitel u firmy Baťa ve Zlíně. Později pracoval v brněnských tiskárnách Novina. Hodně publikoval na stránkách Selských listů. V letech 1949 - 1950 byl starostou města Olomouce. Knižně vydal dvě sbírky básní: Mimo rodnou zem (1939) a Věčná květenství (1941). Jeho literární pozůstalost tvoří rukopisné poznámky, korespondence s literáty Moravského kola spisovatelů, překlady a teze dějin francouzské literatury.","name":"Ladislav","title":"básník a redaktor","birth":"31. května 1904 Moravská Loděnice","died":"8. ledna 1982 Olomouc"},{"state":0,"id":"id_s6","surname":"Bezloja","text":"Po maturitě Na SGO v roce 1902 a vysokoškolských studiích matematiky a fyziky vyučoval těmto předmětům na gymnáziu Jakuba Škody v Přerově. Ve válečných letech 1915 - 1918 byl prozatímním správcem přerovského Učitelského ústavu. V roce 1920 přešel na učitelský ústav v Teplicích v Čechách a v roce 1925 do Slezské Ostravy. Od roku 1932 byl ředitelem Učitelského ústavu v Brně. Během své učitelské praxe hojně publikoval v odborných pedagogických časopisech.","name":"Alois","title":"ředitel učitelského ústavu v Brně ","birth":"19. listopadu 1881 Grygov","died":"3. února 1948 Brno"},{"state":0,"id":"id_s7","surname":"Blaha","text":"Pocházel z rodiny stavebního mistra. Na SGO maturoval v roce 1919. Poté pracoval na velkostatku Spolku moravských cukrovarů ve svém rodišti a po založení Vysoké školy zemědělské v Brně ji úspěšně absolvoval. Nadchl se pro šlechtění odrůd vinné révy. Od roku 1925 byl výzkumným pracovníkem Vinařsko-ovocnické sekce Zemského ústavu v Brně, odkud v roce 1950 přešel na Státní výzkumnou stanici vinařskou v Mutěnicích, kde až do odchodu do důchodu vedl biologické oddělení. Dlouhá léta byl jednatelem Zemského vinařského svazu pro Moravu, sekretářem Ústředního svazu čs. vinařů a redaktorem časopisu Vinařský obzor. Svou úspěšnou vědeckou prací a bohatou publikační činností získal mezinárodní věhlas. Jeho mimořádné zásluhy o rozvoj vinohradnictví ocenil mj. i předseda vlády Francouzské republiky udělením Řádu čestné legie","name":"Josef","title":"vysokoškolský pedagog, vědec, vinař, rytíř Řádu čestné legie","birth":"13. února 1900 Velká Bystřice","died":"30. srpna 1994 Brno"},{"state":0,"id":"id_s8","surname":"Blažejová","text":"Absolventka SGO v roce 1946. Studovala Pedagogickou fakultu UP Olomouc a poté působila čtyři roky na školách v pohraničí na severní Moravě (Písařov, Úsov, Mohelnice), pak v okrese Olomouc (Náměšť na Hané, Těšetice, Olomouc-Holice) a od roku 1961 přímo v Olomouci na ZŠ Zeyerova a ul. 8. května. Až do roku 1983 byla fakultní učitelkou a zastávala funkci okresní metodičky pro literární výchovu na základních školách. Věnovala se problematice školních knihoven, recitačním a literárním soutěžím. Velké znalosti o literárním místopisu uplatňovala při literárních exkurzích. Byla členkou VSMO a členkou výboru její Literární sekce od jejího založení. Aktivně pracovala i v Literárním klubu Olomouc. Publikovala v denním, odborném a vlastivědném tisku (šifra -ebl-). Je autorkou metodického textu pro školy Literární Olomouc aneb deset procházek po literárněhistorických místech Olomouce.","name":"Eliška","title":"regionální publicistka, učitelka","birth":"narozena 14. října 1927 Holíč","died":"7. února 2017 Olomouc"},{"state":0,"id":"id_s9","surname":"Borovanský","text":"Maturoval na Slovanském gymnáziu Olomouc v roce 1942. Působil na Masarykově univerzitě v Brně. Kromě desítek vědeckých publikací z oblasti léčiv s účinkem na vegetativní nervový systém je autorem stěžejních studijních publikací z oboru fyziologie, patofyziologie a imunologie člověka.","name":"Alois ","title":"vysokoškolský pedagog, farmakolog","birth":"30. dubna 1922 Bratislava","died":""},{"state":0,"id":"id_s10","surname":"Brůnová-Lachmann","text":"Absolventka SGO v roce 1961, vystudovala Přírodovědnou fakultu UP, obor matematika a chemie. Po desetiletém působení v Karviné se vrátila do Olomouce, kde vyučovala na SOU farmaceutickém a na gymnáziu Na Vlčinci. Přes 30 let aktivně působila v Jednotě českých matematiků a fyziků (i na centrální republikové úrovni). Publikovala v odborných časopisech i ve společenských periodikách, např. Betty, Xantipa aj. V oblasti umění se veřejnosti poprvé představila v roce 1993. Svá díla vystavovala nejen v České republice, ale i v Německu, Francii, Švédsku, Austrálii ave Spojených státech amerických. Pro NASA vytvořila speciální cyklus obrazů. Píše poezii, jež dosud vyšla ve třech samostatných sbírkách. ","name":"Jitka","title":"středoškolská profesorka, básnířka a výtvarnice","birth":"27. července 1944 Prostějov","died":""},{"state":0,"id":"id_s11","surname":"Böhm","text":"Při studiích na Slovanském gymnáziu (maturoval 1919) ho významně ovlivnil kustod olomouckého Vlasteneckého muzea, vášnivý archeolog Jaroslav Palliardi. Na FF UK v Praze studoval archeologii u profesora L. Niederleho (doktorát 1924). Už od roku 1923 pracoval ve Státním archeologickém ústavu, který od roku 1939 řídil a kde setrval až do smrti. Předmětem jeho stěžejního zájmu bylo období halštatské a laténské (tedy starší a mladší doba železná) v Čechách a na Moravě. Vedl, či zúčastnil se řady velkých archeologických výzkumů, např. v Kuštanovicích (na Podkarpatské Rusi), v Nitře a v Domici na Slovensku, na moravském Starém Hradisku, a v Čechách v Libušině a v Kobylech. Dr. Böhm propagoval plošné terénní výzkumy vedené moderními metodami a provázené patřičným zázemím a technickou dokumentací. Po 2. světové válce se mu podařilo, vzhledem k příznivým podmínkám vyplývajícím ze zvýšeného zájmu o českou a slovanskou minulost, prosadit řadu rozsáhlých terénních výzkumů a po vzniku ČSAV (byl spoluzakladatelem ČSAV a jedním z prvních akademiků) zřídit expozitury archeologického ústavu v Mostě, v Plzni a v Opavě. Získaný bohatý výzkumný materiál systematicky zpracovával vědecky i popularizačně. K jeho nejvýznamnějším dílům patří Základy hallstattské periody v Čechách (1938), Staré Hradisko I, II, III (1936 a 1937), Kronika objeveného věku (1941), Naše nejstarší města (1946). Po válce přednášel i na obnovené olomoucké univerzitě. V roce 1958 mu byl udělen Řád práce; jeho díla z 50. let jsou bohužel silně poplatná své době.","name":"Jaroslav","title":"ředitel Archeologického ústavu Praha, akademik ČSAV","birth":"8. března 1901 Holešov","died":"6. prosince 1962 Praha"},{"state":0,"id":"id_s12","surname":"Budík","text":"Pocházel z velmi skromných poměrů. Dětství prožil v Hranicích na Moravě. Gymnazijní primu a sekundu studoval na Gymnáziu Jana Opletala v Litovli a pokračoval na Papežské koleji Tovaryšstva Ježíšova na Velehradě. Zažil násilné ukončení této klášterní školy komunistickými bojůvkami STB v noci z 13. na 14. května 1950. Základní školní docházku pak dokončil na Svatém Kopečku, kde bydlela jejich rodina. Své kvalitní hudební vzdělání zúročil státní zkouškou z houslové hry na konzervatoři v Brně. Po absolutoriu vyučoval v letech 1956 - 1959 hře na housle v Dvorcích na Moravě a v hudební škole v Litovli. Následně působil 15 let jako violista v operním orchestru olomouckého divadla. Současně studoval dálkově Slovanské gymnázium a po maturitě v roce 1963 studoval učitelství biologie a zeměpisu na PřF UP. V období 1974 - 1977 byl laborantem v Ústavu sér a očkovacích látek a v letech 1977 - 1980 pracoval na katedře anatomie LF UP. V roce 1979 obhájil doktorát přírodních věd. Vrátil se k práci hudebního pedagoga v Uničově (1980 - 1984). Následně byl do roku 1988 vedoucím laboratoře osteologie na Teoretických ústavech LF UP a až do svého odchodu do důchodu v roce 1995 pracoval v chemickém průmyslu v závodech MILO Olomouc.Nákladem vlastním vydal básnické sbírky intrapsychické lyriky Pasáže arpeggia (1993) a V paprscích stříbra(1994). Napsal i pozoruhodnou historickou studii Spisovatel Jaroslav Durych a Olomouc (1996), kterou věnoval „svému“ Slovanskému gymnáziu. Velkou péči věnoval i badatelské práci při studiu života a díla jednoho z nejvýznamnějších absolventů Slovanského gymnázia, profesora právní antropologie na Yale University (New Haven, Connectucat, USA), Dr. Leopolda Pospíšila. Byl zakládajícím členem olomoucké pobočky nevládní organizace Společnost přátel Afriky, která od roku 2000 uctívá jeho památku udílením Ceny Dr. Budíka těm, kteří se zasloužili o poznávání afrického kontinentu a mají vztah k Olomouci, příp. za dlouholetou činnost při rozvíjení přátelství s africkými národy. ","name":"Miloslav","title":"přírodovědec, básník, publicista a hudební pedagog","birth":"21. května 1935 Hranice na Moravě","died":"23. dubna 1999 Olomouc"},{"state":0,"id":"id_s13","surname":"Bulín","text":"Po maturitě na SGO v roce 1940 se věnoval divadlu. Celoživotně působil v Olomouci. Předmětem jeho zájmu byla i teorie literatury. Ve svém díle se zabýval zejména tvorbou Karla Čapka, o níž hojně přednášel i publikoval.","name":"Ladislav","title":"divadelník, bohemista a literární historik","birth":"22. října 1921 Olomouc","died":"4. prosince 1958 Olomouc"},{"state":0,"id":"id_s14","surname":"Burešová","text":"Po maturitě na SGO v roce 1978 studovala odbornou historii na Filosofické fakultě UP, kde doposud vyučuje. Předmětem jejího odborného zájmu jsou dějiny 20. století, zejména postavení žen ve společnosti. ","name":"Jana","title":"historička, vysokoškolská profesorka","birth":"1. března 1959 Šternberk","died":""},{"state":0,"id":"id_s15","surname":"Buriánek","text":"Po maturitě na SGO v roce 1903 vystudoval medicínu a ve své lékařské praxi se věnoval zejména chirurgii. Ve dvacátých letech byl primářem Slezské nemocnice v Opavě, odkud přešel do Olomouce, kde se stal ředitelem Zemských ústavů, které sdružovaly v Olomouci na svou dobu špičková lékařská pracoviště. Často publikoval v odborných lékařských periodikách na téma tuberkulózních zánětů pobřišnice, rektální výživy v chirurgii a dal. ","name":"Bohumil","title":"chirurg","birth":"28. ledna 1884 Blatec","died":"29. září 1939 Olomouc"},{"state":0,"id":"id_s16","surname":"Bystřina","text":"Studoval Slovanské gymnázium v letech 1871 - 1878. Přestože byl příkladným žákem, který měl za své vzory pana ředitele J. E. Kosinu a pana profesora Jana Havelku, byl pro výtržnost z mladické nerozvážnosti ze studia vyloučen a maturoval o rok později v Chrudimi, odkud odešel studovat práva do Prahy. Na studia si přivydělával jako písař, korektor v tiskárně, sekretář spisovatele J.V. Friče nebo pomocník na železnici. Částečným zdrojem příjmů mu byly i honoráře za básně publikované v různých časopisech. Po studiích vykonával praxi u pražského Zemského soudu a jako koncipient postupně působil v advokátních kancelářích v Plumlově, v Prostějově, ve Vyškově a v Brně. Od roku 1893 byl advokátem v Novém Jičíně a v letech 1921-1926 měl vlastní advokátní praxi v Brně. V roce 1920 koupil společně s Petrem Bezručem chalupu na Ostravici v Beskydech. Byl přední osobností moravské spisovatelské obce (od roku 1912 jejím místopředsedou, v letech 1921 - 1923 předsedou). Debutoval prózou Rok na vsi (1889). Pravé uplatnění svého literárního talentu však našel v humoristických povídkách psaných dialektem, se svéráznými postavičkami z Hané, Slovácka a Valašska. K jeho čtenářsky nejoblíbenějším knihám patří Hanácké figurky (1890), Jak se naši škádlívají (1924), Hanácká legenda (1904), Súchovská republika (1926) a výbory z díla: Humor O. Bystřiny (1927) a Úsměvná Morava (1979).","original_name":"Ferdinand Dostál","name":"Otakar","title":"právník, spisovatel","birth":"23. května 1861 Věrovany","died":"18. července 1931 Ostravice"},{"state":0,"id":"id_s17","surname":"Cekl","text":"Po maturitě na SGO v roce 1913 studoval práva. Posléze se věnoval novinářské praxi. Od roku 1922 byl v Olomouci šéfredaktorem Moravského deníku a od roku 1947 šéfredaktorem Volného slova. Je autorem řady básní, několika dramat a románů, mj. ve své době velmi úspěšné knihy Kudy táhla válka. Do paměti absolventů Slovanského gymnázia se vepsal svými aktivitami při oslavách 80. a 90. výročí založení SGO a jako redaktor almanachů Símě hořčičné (1947) a Za hlasem Komenského (1957).","name":"Jan","title":"novinář a spisovatel","birth":"16. května 1894 Uherský Ostroh","died":"15. února 1962 Olomouc"},{"state":2,"id":"id_s18","surname":"Coufal","text":"Po absolvování SGO v roce 1873 studoval na FF UKF v Praze. V letech 1876-1885 byl profesorem na gymnáziu v Přerově, poté do roku 1889 v Kroměříži a následujících 25 let byl profesorem českého jazyka na Slovanském gymnáziu Olomouc.","name":"František","title":"gymnaziální profesor","birth":"29. března 1853 Víska u Litovle","died":"17. dubna 1927 Olomouc "},{"state":1,"id":"id_s19","surname":"Col","text":"Po maturitě na Arcibiskupském gymnáziu v Kroměříži v roce 1924 studoval bohosloví v Olomouci, ordinován v roce 1927. Byl katechetou v Ostravě, od roku 1936 vyučoval na České reálce v Olomouci a v letech 1938-1945 byl profesorem římskokatolického náboženství na Slovanském gymnáziu. V roce 1945 byl jmenován mimořádným profesorem Cyrilometodějské fakulty v Olomouci. Napsal několik odborných prací, jeho hlavním dílem je vlastní překlad Nového zákona z řečtiny, který poprvé vyšel roku 1947a pak znovu 1961 a 1969.","name":"Rudolf","title":"kněz, středoškolský a univerzitní profesor, filolog a překladatel ","birth":"29. října 1902 na Vsetín","died":"21. srpna 1964 Olomouc"},{"state":0,"id":"id_s20","surname":"Čapek","text":"Po maturitě na SGO v roce 1945 vystudoval v Praze Komenského evangelickou bohosloveckou fakultu. V letech 1950 - 1955 byl na této vysoké škole asistentem a následně až do roku 1986 tajemníkem fakulty. Souběžně byl od roku 1953 redaktorem Kostnických listů a později šéfredaktorem evangelického týdeníku Kostnické jiskry.","name":"Dušan","title":"teolog a redaktor","birth":"24. ledna 1926 Olomouc","died":"9. února 2005 Praha"},{"state":1,"id":"id_s21","surname":"Čermák","text":"Po maturitě na gymnáziu ve svém rodišti studoval v letech 1873 - 1877 klasickou filologii na FF KFU v Praze. Svou pedagogickou praxi začínal jako suplent Českého gymnázia v Českých Budějovicích a následně v Hradci Králové. V letech 1880 - 1911 byl řádným profesorem latiny a řečtiny Slovanského gymnázia Olomouc. Svou kariéru završil coby školní rada. V roce 1911 byl penzionován, v roce 1917 přesídlil do Prahy a v roce 1937 do Lázní Bělohrad. Publikoval v časopisu Krok, ve výročních zprávách SGO a ve filatelistických časopisech. Je pohřben v Praze na Olšanských hřbitovech.","name":"Jan","title":"středoškolský profesor, filatelista","birth":"23. května 1854 Havlíčkův Brod","died":"29. března 1940 Lázně Bělohrad"},{"state":0,"id":"id_s22","surname":"Černoch","text":"Po maturitě na SGO v roce 1926 absolvoval vysokoškolská studia lékařství a po promoci v roce 1931 nastoupil na interní oddělení Baťovy nemocnice ve Zlíně. Po dvou letech odešel do Brna, kde od roku 1935 studoval Filozofickou fakultu Masarykovy univerzity, obor filozofie a sociologie. Po roce 1945 působil v Brně jako zemský referent pro kulturu a školství. V roce 1948 byl jmenován ředitelem Zemské porodnice v Brně a v roce 1960 přesídlil do Prahy, kde působil jako vedoucí katedry gynekologické kliniky Institutu lékařství. ","name":"Antonín","title":"lékař, filozof a sociolog","birth":"1. června 1907 Velká Bystřice","died":"28. prosince 1988 Praze"},{"state":0,"id":"id_s23","surname":"Černušák","text":"Po studiích na SGO (1893 - 1899), na nichž ho významně ovlivnil sbormistr prof. Viktor Navrátil, absolvoval septimu a oktávu na gymnáziu v Kroměříži, kde v roce 1901 maturoval. Svoji pedagogickou dráhu zahájil na Obchodní akademii v Hradci Králové. Od roku 1918 byl profesorem dějin hudby na brněnské konzervatoři a na JAMU. Mistrně ovládal hru na housle, klavír a varhany. Ve všech místech svého působení vedl pěvecký sbor a hojně publikoval. Je pochován v Čestné aleji na Centrálním brněnském hřbitově.","name":"Gracián","title":"hudební pedagog a publicista","birth":"19. prosince 1882 Ptení u Prostějova","died":"13. října 1961 Brno"},{"state":1,"id":"id_s24","surname":"Čičatka","text":"Po absolutoriu německé reálky ve svém rodišti vystudoval slavistiku, němčinu a hudební výchovu na vídeňské univerzitě. Před I. světovou válkou učil na středních školách v Prostějově a v Novém Jičíně. Po celou dobu války bojoval na italské frontě. V letech 1923 - 1924 a 1945-1951 vyučoval na Slovanském gymnáziu a zároveň na české reálce (1923-1951). V letech 1953 - 1970 vybudoval rozsáhlé hudební oddělení olomoucké okresní knihovny. Z řady jeho publikací, jsou vysoce ceněny zejména jeho Dějiny olomouckého divadla.","name":"Jaroslav","title":"filolog, pedagog, dirigent, režisér, hudební vědec, knihovník","birth":"9. ledna 1891 v Prostějov","died":"12. září 1979 Olomouc"},{"state":1,"id":"id_s25","surname":"Damborský","text":"Po maturitě na SGO v roce 1946 studoval polonistiku a slavistiku na FF UP. V letech 1950-1952 byl lektorem českého jazyka Poznaňské univerzity, 1960-1966 lektor češtiny na univerzitě ve Waršavě, do 1973 docent FF UP Olomouc, od 1989 řádný profesor WSP Opole, 1990 profesor FF UP, od 1991 vedoucí Katedry polonistiky a folkloristiky na FF OU Ostrava. V 70. letech byl politicky perzekvován. ","name":"Jiří","title":"vysokoškolský pedagog, polonista, slavista","birth":"22. května 1927 Litovel","died":"23. července 2013 Ostrava"},{"state":0,"id":"id_s26","surname":"Dohnal","text":"Po maturitě na SGO v roce 1951 se s velkými obtížemi dostal na Vysokou školu zemědělskou do Nitry, odkud přestoupil na Filozofickou fakultu do Brna, na níž studoval archeologii a etnografii. Zprvu působil ve Zlíně v Oblastním muzeu jihovýchodní Moravy, kde založil časopis Pravěk východní Moravy. V roce 1969 se vrátil do Olomouce, dokončil a obhájil kandidátskou disertační práci. V letech 1969-1996 působil ve Vlastivědném muzeu Olomouc, kde vedl průzkum Dómského návrší. Převážně se zabýval slovanským a raně středověkým osídlením Olomoucka a problematikou počátků olomouckého hradu. ","name":"Vít","title":"archeolog","birth":"25. března 1932 Krnov","died":""},{"state":2,"id":"id_s27","surname":"Doležil","text":"Slovanské gymnázium vystudoval v letech 1887 - 1895 a následně absolvoval FF Karlo-Ferdinandovy univerzity v Praze. V letech 1902 - 1908 působil na Slovanském gymnáziu jako pedagog. Za svého olomouckého působení byl sbormistrem pěveckého sdružení Žerotín a vedl kulturní rubriku deníku Pozor. Byl uznávaným hudebním kritikem a autorem četných studií o české hudbě. Je autorem dokumentárně cenné knihy Politické a kulturní dějiny města Olomouce.","name":"Hubert","title":"hudební historik, sbormistr, pedagog","birth":"25. října 1876 Kunčice pod Ondřejníkem","died":"10. června 1946 Praha"},{"state":0,"id":"id_s28","surname":"Doležil","text":"Během studií na Slovanském gymnáziu 0lomouc (1896 - 1900) se hudebně rozvíjel pod vedením Josefa Nešvery. Přestoupil na Učitelský ústav v Kroměříži, kde byl žákem Ferdinanda Vacha (zakladatel Pěveckého sdružení moravských učitelů) a S. Šuly. Učil ve Skrbeni (s přestávkou jednoroční vojenské služby vykonávané u olomoucké posádkové hudby). Byl sbormistrem pěveckého spolku Žerotín. Zkomponoval scénickou hudbu k divadelním hrám pro děti V. B. Plumlovské. Od roku 1909 působil v Praze. Dosáhl hodnosti vysokoškolského profesora Akademie múzických umění, byl jejím prvním děkanem (1946 - 1948) a v letech 1952 - 1958 prorektorem.","name":"Metod","title":"hudební pedagog, sbormistr, dirigent, profesor AMU","birth":"15. října 1885 v Kunčice pod Ondřejníkem","died":" 10. října 1971 Praha"},{"state":0,"id":"id_s29","surname":"Dorazil","text":"Po maturitě na SGO v roce 1872 odešel studovat filozofii do Prahy. Záhy přešel na studia práv, která uzavřel v roce 1881 promocí na Jagellonské univerzitě v Krakově. V roce 1884 si otevřel advokátní kancelář ve Strážnici, kterou v roce 1893 rozšířil převzetím advokátní kanceláře svého tchána v Hodoníně. V letech 1893 - 1900 působil i v Kroměříži, kde se mimořádně angažoval ve společenském životě. Založil Muzejní a knihovní jednotu, byl činovníkem Sokola a pěveckého sdružení Moravan, byl spolupořadatelem hanáckého oddělení na Národopisné výstavě v Praze v roce 1895.","name":"Stanislav","title":"advokát, kulturní a národopisný pracovník","birth":"5. května 1850 Loučka u N. Jičína","died":" 18. května 1924 Valašské Meziříčí "},{"state":0,"id":"id_s30","surname":"Dosoudil","text":"Po maturitě na SGO studoval od roku 1893 teologii. Vysvěcen byl v roce 1897. Následně studoval filosofii na univerzitě v Innsbrucku. Byl prefektem arcibiskupského semináře a od roku 1897 a pedagogicky působil na kroměřížském arcibiskupském gymnáziu. Vzhledem k mimořádným hudebním dispozicím byl od roku 1904 ředitelem kůru v chrámu u sv. Mořice v Kroměříži. Zúčastnil se i spolkového života jako člen výboru Cyrilské jednoty v Praze a výboru kroměřížského Moravana. Komponoval chrámové skladby.","name":"Josef","title":"kněz, sbormistr","birth":"26. listopadu 1874 Velká Bystřice","died":"17. února 1920 Kroměříž"},{"state":1,"id":"id_s31","surname":"Dostál","text":"Vyučoval na Slovanském gymnáziu v letech 1948 - 1961 dějepis a zeměpis, studenti mu přezdívali „Joe“. Sepsal dějiny své rodné obce Křenovice u Kojetína (1940). ","name":"František","title":"profesor Slovanského gymnázia","birth":"30. října 1902 v Křenovice","died":"15. září 1982 Křenovice"},{"state":0,"id":"id_s32","surname":"Doubravský","text":"Maturoval na Slovanském gymnáziu v roce 1935. Válka a uzavření vysokých škol přerušily jeho brněnská studia medicíny těsně před dokončením. Po promoci v září 1945 pracoval v olomoucké nemocnici, od roku 1947 přednášel na LF UP. V roce 1958 byl jmenován přednostou radiologického ústavu FN. Publikoval mnoho vědeckých prací z oboru gastroenterologie, radiodiagnostiky karcinomu jícnu a dozimetrie. Byl i členem poradní komise Ministerstva zdravotnictví pro radiologii. Podílel se na práci Sekce lékařství VSMO.","name":"Jaroslav","title":"radiolog, univerzitní profesor","birth":"3. listopadu 1916 v Kokory","died":"8. ledna 1987 Olomouc"},{"state":1,"id":"id_s33","surname":"Doucha","text":"Po studiích dějepisu a zeměpisu na UK v Praze působil jako středoškolský profesor v Kyjově, ve Strážnici a v letech 1912 - 1935 na Slovanském gymnáziu v Olomouci. Zde byl od roku 1919 členem výboru Vlastivědné společnosti muzejní, spoluredaktorem jejího časopisu, a od roku 1926 správcem oddělení historického a uměleckoprůmyslového muzea. V letech 1935-1939 byl ředitelem Masarykova gymnázia ve Vsetíně.","name":"František","title":"středoškolský pedagog, vlastivědný pracovník, autor pověstí","birth":"17. září 1881 Topol u Chrudimi","died":"14. února 1965 Olomouc"},{"state":0,"id":"id_s34","surname":"Doupalová","text":"Po absolvování SGO (1953) a FF UP (1958) učila předmětům své aprobace (Čj-D) na pedagogickém gymnáziu v Jihlavě a později na základních školách v Olomouci. Zaměřila se zejména na diferencovanou výukou českého jazyka a literatury. Pedagogickou zkušenost ze základních a středních škol zúročila v říjnu 1969 přechodem na katedru českého jazyka a literatury Pedagogické fakulty UP v Olomouci. Později působila jako docentka i na PdF Ostravské univerzity. Ve svém vědeckém bádání věnovala pozornost především lidové slovesnosti, speciálně gnozeologickým aspektům pohádky a pověsti. Paralelně sledovala tvorbu pro děti a mládež, především na úseku poezie. Na požádání pedagogických středisek i okresních knihoven přednášela učitelům a knihovníkům o novinkách v tvorbě pro děti a mládež. Spolupracovala s oddělením pro děti a mládež Knihovny města Olomouce a v jejím zpravodaji Naše knihovna pravidelně několik roků hodnotila knižní novinky z oblasti literatury pro mládež.","maiden":"Procházková","name":"Eva","title":"literární historička, vysokoškolská pedagožka","birth":"13. srpna 1936 Olomouc","died":""},{"state":0,"id":"id_s35","surname":"Drábek","text":"Po maturitě na SGO studoval v letech 1921-1925 Filozofickou fakultu Univerzity Karlovy v Praze, obor historie, jazyk český a zeměpis. Poté učil na slovenských a českých středních školách. Po rigorózních zkouškách promoval v roce 1927 na doktora filozofie. Původní aprobaci si rozšířil o hospodářský zeměpis pro výuku na obchodních akademiích. Jako státní profesor působil od roku 1935 na Veřejné obchodní škole ústavu hraběte Pöttinga v Olomouci a v letech 1947-1958 na Obchodní akademii v Olomouci. Byl členem Vlastivědné společnosti musejní v Olomouci, Společnosti přátel starožitností aj. V prázdninových měsících organizoval učitelské vzdělávací ve Frýdlantu nad Ostravicí (1929), v Českém Krumlově (1931) a na Svatém Kopečku (1932). Souběžně se svým pedagogickým působením vykonával (po prof. Václavu Nešporovi) od 1. prosince 1947 funkci archiváře hl. města Olomouce do roku 1956. Publikoval v olomouckém Našinci, Vychovatelských listech, Zprávách Vlastivědného ústavu v Olomouci, almanaších SGO (1947, 1957, 1967). Ze setkání s Boženou Mrštíkovou vydal v roce 1943 jako soukromý tisk Hovory s B. Mrštíkovou (vyšly knižně v roce 1945). O rok později vyšla v Lošticích jeho historická publikace Moravský generální seminář. Další jeho prací byla Olomouc v revolučním roce 1848, vydaná v roce 1948. V roce 1957 vyšla tiskem kniha Olomoucký orloj. Značnou dokumentární hodnotu mají vzpomínky Masarykova přítele a prvního předsedy Senátu ČSR dr. Mořice Hrubana (absolvent SGO v roce 1885), místopředsedy Čs. strany lidové, které Dr. Drábek zaznamenával koncem 2. světové války. Vzpomínky nazvané Z časů nedlouho zašlých, vyšly v roce 1967 v Římě a ilegálně byly dováženy do Československa. Poslední léta své aktivní pedagogické služby byl jan Drábek politicky perzekvován, musel opustit své profesorské místo na Obchodní akademii Olomouc a v letech 1958-1966 dojížděl na Střední průmyslovou školu a obchodní akademii v Uničově.","name":"Jan","title":"středoškolský profesor, spisovatel, archivář města Olomouce","birth":"15. září 1902 Klášterní Hradisko u Olomouce","died":"17. března 1972 Olomouc"},{"state":0,"id":"id_s36","surname":"Dvořák","text":"Na SGO maturoval v roce 1950. Celý svůj profesní život zasvětil filozofické fakultě Univerzity Palackého v Olomouci (od roku 1968 jako docent a od roku 1982 jako profesor nové české literatury). Výrazně se uplatňoval i v olomouckém literárním životě, např. jako redaktor 13 ročníků Sborníku Vlastivědné společnosti muzejní. Podílel se na realizaci edičních projektů, např. výboru z díla V.K. Klicpery, překladů díla Josefa Jungmanna, edice Sládkových překladů W. Shakespeara i řady edic bezručovských. Ve spolupráci s prof. Robertem Smetanou a J. Š. Kvapilem se stal editorem, komentátorem a interpretem díla Bedřicha Václavka. Byl vůdčí osobností při budování univerzitního Kabinetu Bedřicha Václavka, při pořádání 20 ročníků vědeckých konferencí Václavkova Olomouc i při vydávání Václavkova díla. Řadu let byl školitelem vědeckých aspirantů. Externě vedl kabinet při ÚČSL ČSAV. Své studie o Palackém a lyrice národního obrození, ale o vůdčích zjevech české literární kritiky shrnul do publikace Tradice a současnost (1980); výsledky svého bádání o básníkovi svého srdce prezentoval v knize Bezručovské studie (1982). Na rozdíl od jiných neuhýbal před problémy a dokonce ze svých mimořádně skromných prostředků vydal počátkem 90. let studie, připomínající velké demokratické tradice světové i české společnosti a kultury (např. J.L.Fischer a F.X. Šalda; Edvard Beneš 1945 - 1948 o české literatuře a kultuře; Z dějin literatury a kultury na Moravě). V oblasti světové hudby napsal studii Občan Ludwig van Beethoven a jeho Missasolemnis; svůj celoživotní zájem o regionální kulturu završil monografií Prof. PhDr. Jan Springer, demokrat a vlastenec. Koncem devadesátých let spolupracoval se Sdružením Vladislava Vančury, pořádajícím v Háji ve Slezsku festival Rozmarné léto. Z této spolupráce vzešly pozoruhodné studie Jaromíra Dvořáka: Ke stému výročí příchodu P. Bezruče na Hanou (1996); F.X. Šalda, obránce demokracie a sociální spravedlnosti (1997) a František Palacký - kritik (1998). ","name":"Jaromír","title":"vysokoškolský pedagog, literární historik a editor","birth":"4. července 1931 Olomouc","died":"4. října 2004 Olomouc"},{"state":0,"id":"id_s37","surname":"Dvořák","text":"Po maturitě na SGO v roce 1932 odešel studovat na UK v Praze slavistiku, germanistiku a srovnávací dějiny literatury. V letech 1936 - 1939 učil na olomoucké České reálce, odkud odešel v roce 1940 do Prahy. Externě spolupracoval s nakladatelstvím L. Mincíř. Zbytek válečných let prožil v totálním nasazení a po válce absolvoval dodatečnou vojenskou prezenční službu. Od roku 1949 působil na PdF UK, v roce 1968 byl jmenován profesorem pro obor folkloristika na FF UK. Absolvoval kratší přednáškové pobyty na univerzitách v Opoli, Postupimi, Bukurešti a Sofii. V roce 1960 učil jeden semestr na Humboldtově univerzitě v Berlíně. V letech 1962 - 1967 byl předsedou Národopisné společnosti československé. Psal hesla pro Ottův slovník naučný nové doby, překládal básně, prózy a filozofické úvahy z němčiny, latiny a z dalších jazyků a publikoval je v katolickém tisku, v Listech pro umění a kritiku, Českém lidu, ve Věstníku národopisné společnosti československé při ČSAV, ale i v zahraničních časopisech. Vlastní básně publikoval v časopisech Jitro, Lumír, Rozhledy aj. Editoval dílo K. V. Raise, bří Mrštíků, K. H. Máchy, F. X. Šaldy. Hlavním tématem jeho vědeckého zájmu byly vztahy mezi literaturou a folklorem. S Felixem Vodičkou spolupracoval na příručce Základy teorie literatury. V knize Nejstarší české pohádky (1976) zpracoval čtenářsky přitažlivý výběr 117 pohádek. Stať Olomoucký výtvarný život v minulé sezóně publikoval v Moravském večerníku (1937); na stránkách Vyšehradu vyšel v roce 1945 jeho Divadelní dopis z Olomouce. Dvořákovy pedagogické stati věnované literatuře pro děti a mládež vycházely v časopisech Předškolní výchova, Zlatý máj. Byl spoluautorem čítanek pro střední školy a učebnice teorie literatury.","name":"Karel","title":"vysokoškolský pedagog, literární historik, editor, folklorista","birth":"28. května 1913 Olomouc","died":"9. června 1989 Praha"},{"state":1,"id":"id_s38","surname":"Eliáš","text":"Byl prvním doktorem filozofie na obnovené olomoucké univerzitě. Převážnou část své aktivní pedagogické dráhy působil na gymnáziu Jiřího Wolkera v Prostějově (1956-1959 a od roku 1962 do roku 1980). Na Slovanském gymnáziu učil v letech 1953 - 1956 a ve školním roce 1994-1995. Měl rozsáhlé jazykové znalosti (6 cizích jazyků) a mimořádný kulturní přehled. Hojně publikoval v regionálních časopisech. Je autorem německo - českého slovníku pro oděvní výrobu. Zajímavými články přispěl i do jubilejních almanachů Slovanského gymnázia. V minulém režimu byl persekvován, po roce 1989 byl vyznamenán stříbrnou medailí UP.","name":"Žáček Bohuslav","title":"pedagog, historik, překladatel a prozaik","birth":"6. ledna 1920 Brno","died":"1. května 2005 Prostějov"},{"state":0,"id":"id_s39","surname":"Fargaš","text":"Po maturitě na SGO v roce 1939 studoval Lékařskou fakultu v Brně, kde promoval v roce 1949. Po dvouletém působení v nemocnici v Opavě se natrvalo usadil v Olomouci. Pracoval na První chirurgické klinice FNO pod vedením věhlasného chirurga prof. Rapanta. Působil jako expert v Lipsku (1964) a v letech 1972 - 1976 na klinice v alžírském městě Oranu. Patřil k významným průkopníkům dětské chirurgie u nás.","name":"Eduard","title":"lékař","birth":"26. ledna 1920 Olomouc","died":"28. ledna 2001 Olomouc"},{"state":0,"id":"id_s40","surname":"Fiala","text":"Syn choralisty Jana F. Fialy (1850 - 1910). Od roku 1884 žil v Olomouci, kde roku 1897 maturoval na Slovanském gymnáziu. Hudbu studoval u Josefa Nešvery a Antonína Petzolda, zpěv studoval u prof. Pivody v Praze. Po krátkém studiu sólového zpěvu ve Vídni působil v letech 1907-1908 ve Vinohradském divadle v Praze, 1908 - 1910 v Zemském divadle v Lublani a 1910 - 1915 v Národním divadle v Brně. Sezónu 1919 - 1920 působil v Jihočeském divadle v Českých Budějovicích. Vynikal zejména v operách českých klasiků. Ve 20. letech zanechal ze zdravotních důvodů pěvecké dráhy a od roku 1927 byl vrchním účetním radou v Brně.","name":"Alois","title":"pěvec a ekonom","birth":"2. června 1879 Hradec Králové","died":"29. března 1940 Brno"},{"state":0,"id":"id_s41","surname":"Fialka","text":"Po maturitě na SGO v roce 1873 studoval klasickou filologii FF Karlo-Ferdinandovy univerzity v Praze. Od roku 1882 byl středoškolským profesorem kroměřížského gymnázia, které v letech 1908 - 1924 řídil. Byl velmi aktivní jako zpěvák, sbormistr a jednatel pěveckého spolku Moravan.","name":"Jindřich","title":"gymnaziální profesor, zpěvák a sbormistr","birth":"10. 5. 1854 Frenštát p. Radhoštěm","died":"26. 12. 1929 Kroměříž"},{"state":0,"id":"id_s42","surname":"Fierlinger","text":"Syn váženého profesora olomouckého německého reálného gymnasia Eugena Fierlingera. Studoval na Slovanském gymnáziu, které ale nedokončil (o důvodech jeho vyloučení ze studia se traduje několik úsměvných verzí) a maturoval na Obchodní akademii v Přerově. Pamětníkům se bohužel vryl trvale do paměti v důsledku své neblahé politické role při komunistickém puči v únoru 1948. Za 1. světové války byl důstojníkem Čs. legií na Rusi a ve Francii. Od roku 1919 působil v diplomatických službách jako velvyslanec (v Nizozemsku, následně v Rumunsku, USA, ve Švýcarsku /současně zástupce ČSR u Společnosti národů/, v Rakousku a během 2. světové války v SSSR). Byl blízkým spolupracovníkem presidenta Beneše. Při působení v Moskvě navázal těsnou spolupráci se sovětskými orgány a čs. komunistickou emigrací, v jejichž intencích utvářel svou další diplomatickou a politickou aktivitu. Byl mj. předsedou první poválečné vlády (1945 - 1946), po únorovém puči se významně podílel na likvidaci Čs. sociální demokracie a na jejím sloučení s KSČ. Od roku 1948 byl 18 let členem předsednictva ÚV KSČ, 1953 - 1964 byl předsedou NS, v letech 1969 - 1971 byl poslancem FS. Je autorem dvoudílných pamětí Ve službách ČSR a několika dalších publikací.","name":"Zdeněk","title":"politik, diplomat","birth":"11. července 1891 Olomouc","died":"2. května 1976 Praha"},{"state":0,"id":"id_s43","surname":"Fischer","text":"Po maturitě na SGO v roce 1891 studoval v Praze práva a v roce 1896 zahájil advokátní praxi v Olomouci. Vzápětí vstoupil do společenského a politického života. S nevšedním elánem pracoval v olomouckých českých vlasteneckých spolcích, napsal stovky článků, proslovů, bezpočet přednášek. Postupně se vypracoval v renomovaného znalce a úspěšného praktika v otázkách finančních, národohospodářských i školských. Neustále byl činný žurnalisticky a napsal i přes 40 samostatných publikací. Byl duchovním otcem projektu „Velká Olomouc - město hospodářsky silné, kulturně vynikající a sociálně vyspělé“. O své město se staral mimořádně svědomitě. Životem a problémy Olomouce doslova dýchal. Denně navštěvoval stavby financované z městských prostředků, hovořil na chodníku s občany o jejich problémech, neohlášen přicházel do dílen, obchodů i domácností. V Olomouci byl pan starosta Fischer prvním mezi rovnými. Za jeho řízení byly položeny základy demokratické správě města, s minimálním úřednickým aparátem byly zajištěny všechny jeho funkce. Z prostředků městského magistrátu se vystavělo 8 škol a další veřejné budovy, velkoryse byla řešena dopravní situace ve městě. ","name":"Richard","title":"advokát, politik, publicista, olomoucký starosta v letech 1923 - 1939","birth":"27. března 1872 Loštice","died":"4. února 1954 Olomouc. "},{"state":0,"id":"id_s44","surname":"Fišara","text":" Po maturitě na SGO v roce 1886 odešel do Prahy, kde na filosofické fakultě absolvoval studijní obory zeměpis a dějepis a současně na právnické fakultě obor národní hospodářství a historii práv. Pedagogickou dráhu nastoupil v roce 1893 na reálném gymnáziu v Praze, o rok později byl suplentem na obchodní akademii v Chrudimi a začátkem září 1895 byl jmenován ředitelem Obchodní akademie v Brně. Záhy se zapojil do veřejné kulturní činnosti, stal se spoluzakladatelem Spolku přátel umění, pracoval v brněnském Družstvu Národního divadla, ale i v Českém čtenářském spolku. Významně se však podílel na činnosti Národní jednoty pro jihozápadní Moravu, kde byl v roce 1905 zvolen předsedou VII. odboru brněnského a setrval v této funkci do jara 1911, kdy dne 8. dubna převzal předsednictví brněnské Matice školské, v níž působil ještě v roce 1937. V roce 1900 byl zvolen čestným předsedou Spolku absolventů české Obchodní akademie v Brně a po převratu v roce 1918 byl v Brně zvolen za člena prvního českého obecního zastupitelstva. Byl také členem a později předsedou Hanácké obce v Brně, kde podporoval šíření znalostí o Hané, krojích a zvycích. Dbal též na čistou hanáčtinu, kterou po celý život mluvil. Hodně publikoval zejména články z oboru školství, zeměpisu a historie a přispíval též do Ottova slovníku naučného. Od roku 1899 byl zkušebním komisařem zeměpisu, od roku 1919 honorovaným docentem obchodního a hospodářského zeměpisu na Vysoké škole zemědělské a o čtyři roky později docentem zahraniční služby a obchodního zeměpisu při ČVUT v Brně. Obchodní akademii v Brně vedl do konce června 1927, kdy byl jmenován odborným inspektorem obchodních akademií a tuto funkci vykonával do konce školního roku 1930/1931. Do svého rodiště zajížděl často a rád a pobýval ve svém rodném žudru čp.26. V roce 1946 byla na budově školy Obchodní akademie v Brně na Kotlářské ulici odhalena pamětní deska Karla Fišary. Pozdější praktiky totalitního režimu zničily nejen obchodní školství, ale i jeho pamětní desku.","name":"Karel","title":"učitel, národní a kulturní pracovník","birth":"25. října 1867 Příkazy","died":"14. ledna 1952 Brno"},{"state":1,"id":"id_s45","surname":"Fuka","text":"Učil na Slovanském gymnáziu v letech 1934-1949. Zakládající vedoucí katedry fyziky na Přírodovědecké fakultě Univerzity Palackého a posléze v několika funkčních obdobích její děkan. Svými odbornými aktivitami celorepublikově mimořádně povznesl úroveň vyučování fyzice na všech typech škol. Autor více jak 200 odborných a metodických prací, celé řady středoškolských i vysokoškolských učebnic fyziky.  Po celou dobu existence byl vedoucím redaktorem didaktického periodika Matematika a fyzika ve škole (1962-1989).","name":"Josef","title":"středoškolský a vysokoškolský pedagog, didaktik fyziky, matematik","birth":"10. prosince 1907 Rataje u Bechyně","died":"19. listopadu 1992 Olomouc"},{"state":0,"id":"id_s46","surname":"Geisler","text":"Po maturitě na SGO v roce 1881vystudoval práva v Praze. Po promoci byl v Olomouci koncipientem v advokátní kanceláři JUDr. Novotného a v roce 1895 si v Olomouci otevřel vlastní advokátní kancelář. Byl mimořádně aktivní v českých vlasteneckých spolcích. Od roku 1893 byl členem výboru „Žerotína“ (v jeho čele stanul v letech 1906 - 1908), v letech 1901- 1909 byl starostou olomouckého Sokola. Řadu let byl i náměstkem starosty ústředního výboru Národní jednoty. ","name":"Antonín","title":"advokát, osobnost českých vlasteneckých spolků v Olomouci","birth":"27. července 1862 Kokory","died":"3. března 1909 Olomouc"},{"state":0,"id":"id_s47","surname":"Geisler","text":"Po maturitě na SGO v roce 1884 vystudoval medicínu v Praze. V roce 1894 se trvale usadil v Olomouci jako praktický lékař. Od následujícího roku byl i vězeňským lékařem a znalcem krajského soudu. Byl členem profesorského sboru Pöttingea, kde přednášel zdravovědu a působil rovněž jako ústavní lékař. Byl členem výboru českého vlasteneckého pěveckého sdružení Žerotín, hrával na violoncello a byl rovněž místopředsedou českých divadelních ochotníků v Olomouci. V roce 1918 byl vyznamenán zlatým křížem a korunou za veřejnou lékařskou službu. V závěti svůj majetek odkázal českým národním a dobročinným spolkům. ","name":"Josef","title":"lékař, soudní znalec, hudebník, divadelní ochotník","birth":"11. března 1866 Kokory","died":"9. května 1936 Olomouc"},{"state":0,"id":"id_s48","surname":"Glos","text":"Po maturitě na SGO v roce 1926 studoval matematiku a deskriptivní geometrii na UK v Praze. Po absolutoriu v roce 1931 byl na stáži na univerzitě v Hamburku, kde studoval psychologii. Po návratu do vlasti se věnoval psychologii, filozofii a sociologii na filozofické fakultě v Praze. V roce 1934 byl promován doktorem filozofie. V době hospodářské krize působil jako výpomocný učitel na měšťanské chlapecké škole v Praze a poté přešel do Nymburku, kde učil na gymnáziu. V roce 1935 učil na škole na Kladně a v následujícím školním roce byl jmenován profesorem matematiky a deskriptivní geometrie na gymnáziu v Kolíně. V roce 1957 se vrátil na stavební fakultu ČVUT s určením pro Vysokou školu železniční. V roce 1960, po jejím přeložení do Žiliny, působil na elektrotechnické fakultě ČVUT, až do svého penzionování v roce 1972. Nadále však jako externista vedl konzultace z lineární algebry v dálkovém studiu. Hojně publikoval v odborném tisku, a to jak z oblasti matematiky, tak i psychologie.","name":"Otakar","title":"matematik, filozof a vysokoškolský pedagog","birth":"4. srpna 1907 Náměšť nad Oslavou","died":"12. října 1985 Praha"},{"state":0,"id":"id_s49","surname":"Goš","text":"Po maturitě na SGO v roce 1959 vystudoval v Brně obor prehistorie. Působil v muzeu v Mohelnici a v Šumperku (od 1996), od roku 2000 na Ústavu historie a muzeologie Slezské univerzity v Opavě. ","name":"Vladimír","title":"historik, archeolog","birth":"8. září 1942 Olomouc","died":""},{"state":0,"id":"id_s50","surname":"Gottwald","text":"Po maturitě na SGO v roce 1898 studoval v Praze práva a filosofii. Své vynikající jazykové znalosti uplatňoval jako překladatel z francouzštiny, z němčiny a z ruštiny. Jeho nadějnou kariéru redaktora olomouckých Selských listů přerušilo odvelení na frontu 1. světové války a těžké zranění, na jehož následky zemřel v roce 1920 jako válečný invalida v olomoucké nemocnici na Klášterním Hradisku.","name":"Adolf","title":"lingvista, překladatel, redaktor","birth":"16. ledna 1878 Horka nad Moravou","died":"3. dubna 1920 Olomouc"},{"state":1,"id":"id_s51","surname":"Haderka","text":"Po maturitě ve svém rodišti v roce 1904 studoval FF Karlo-Ferdinandovy univerzity v Praze. První světovou válku absolvoval na frontě a po návratu v roce 1919 - 1920 učil na dívčím gymnáziu v Olomouci, 1920 - 1921 na učitelském ústavu, následně do roku 1926 na České reálce, odkud odešel na post ředitele České reálky v Šumperku. K 1. září 1934 byl jmenován ředitelem Slovanského gymnázia Olomouc, kde setrval do začátku okupace, kdy byl internován. Byl autorem řady dobových pedagogickým spisů a také zpravodajem Lidových novin. Od roku 1920 byl jednatelem Matice školské, aktivně pracoval ve VSMO a od roku 1922 v Družstvu českého divadla. V Šumperku byl předsedou místního odboru Národní jednoty, od září 1935 jednatelem jejího ústředního výboru a následně členem Národní rady v Praze a její odbočky v Brně. ","name":"František","title":"ředitel Slovanského gymnázia, publicista, regionální politik","birth":"3. července 1886 Kroměříž","died":"21. srpna 1945 Olomouc"},{"state":0,"id":"id_s52","surname":"Hirsch","text":"Maturoval na SGO v roce 1938, byl totálně nasazen a po válce vystudoval medicínu. Věnoval se chirurgii, byl průkopníkem moderní anesteziologie. Od roku 1960 byl primářem anesteziologického a resuscitačního oddělení Fakultní nemocnice Olomouc. Tento obor rovněž přednášel medikům na lékařské fakultě Univerzity Palackého a byl spoluautorem učebních textů.","name":"Alfréd","title":"chirurg, anesteziolog","birth":"8. srpna 1919 Prostějov","died":"1. prosince 2006 Olomouci "},{"state":0,"id":"id_s53","surname":"Hajn","text":"Po maturitě na SGO v roce 1959 vystudoval na PřF UP obor učitelství biologie a chemie. Učil na gymnáziu v Šumperku a posléze na gymnáziu v Olomouci - Hejčíně. Od roku 1988 byl odborným asistentem katedry zoologie a antropologie PřF UP. Na všech svých působištích se věnoval dermatoglyfice (etnické, defektům a chorobám, dědičností). Publikoval desítky vědeckých prací. Na svoji odbornou erudici upozornil už svou diplomovou prací, věnovanou dermatoglyfickému výzkumu jednovaječných dvojčat, kterou zaujal i na Mezinárodním antropologickém kongresu v Římě.","name":"Václav","title":"antropolog, vysokoškolský pedagog","birth":"14. listopadu 1941 Olomouc","died":"26. února 2006 Olomouc"},{"state":0,"id":"id_s54","surname":"Halouzka","text":"Již za studií na SGO (absolvent 1876) psal básně, které publikoval ve studentském časopisu Háj pod pseudonymem Jan Těšetický. Rovněž přispíval do Havelkova časopisu Koleda. Krátce studoval v Praze práva. Jako jednoroční dobrovolník se zúčastnil bojů v Bosně a po návratu studoval v Olomouci teologii. Na kněze byl vysvěcen v roce 1884. Za svou literární tvorbu byl velmi uznáván a dokonce i několikrát vyznamenán (např. Řádem Božího hrobu v Jeruzalémě). Stál u zrodu a byl velmi aktivní v Družině literární a umělecké. V roce 1878 vydal nákladem vlastním Paměti farnosti Těšetické. Psal humorné črty v hanáckém nářečí, redigoval lidové kalendáře a přispíval do řady dobových časopisů. Jeho nejcennějším dílem jsou trojdílné Pohledy do života církevního a vlasteneckého na Moravě (1909, 1913, 1917). Je rovněž autorem řady hesel v Ottově slovníku naučném.","name":"Jan","title":"kronikář moravského národního obrození","birth":"13. července 1856 Těšetice","died":"31. července 1918 Mistřín u Kyjova"},{"state":1,"id":"id_s55","surname":"Havelka","text":"Působil na Slovanském gymnáziu od roku 1870 a podle slov zakládajícího ředitele Slovanského gymnázia Jana Evangelisty Kosiny byl „perlou jeho profesorského sboru“. Narodil se v rodině nadaného malíře, autora i restaurátora cenných kostelních obrazů, uznávaného malíře portrétů, historických obrazů a krajin. Po malířském povolání toužil i mladý Jan. Vystudoval dva roky olomoucké německé reálky, což byla tehdy průprava na malířskou akademii. V roce 1854 dostal od vrchnosti z blízkého zámku v Žádlovicích příslib ročního stipendia 100 zlatých ročně pro studium na olomouckém německém gymnáziu. Zde se nadaný student stal kreslířským pomocníkem profesora Blažeje Kozenna, který byl autorem atlasů pro střední školy. Po maturitě Havelka pokračoval studiem na vídeňské univerzitě a vypracoval se na „skriptora vídeňského dvorního archivu“ s vysokým platem a definitivou. Jeho první literární pokusy jsou psány v němčině. V Havelkovi však klíčila láska k českému jazyku, vzbuzená vlasteneckým profesorem češtiny na olomouckém německém gymnáziu Vaňkem. Vaňkovým působením si rovněž Havelka uvědomil velké poslání učitele, jenž by měl být “knězem svého národa“. Za vídeňských studií byl Havelka významnou osobností v krajanských studentských spolcích. Jeho prvním působištěm bylo piaristické gymnázium v Příboře a dalším německé reálné gymnázium v Uherském Hradišti, kde mu byla svěřena i péče o botanickou zahradu. V roce 1870 vystřídal na Slovanském gymnáziu profesora Jakuba Škodu, který odešel na místo ředitele přerovského gymnázia. Ředitel Kosina ho uvedl do společnosti olomouckých českých vlastenců. Havelka bohatě splnil naděje do něho Kosinou vkládané. Byl předsedou Spolku moravských učitelů a dosáhl jeho uznání jako stavovského orgánu moravského učitelstva. V roce 1873 založil časopis Komenský, v němž sám publikoval a redigoval příspěvky pedagogické, přírodovědné, jazykovědné, historické a zeměpisné. Pro česky mluvící moravský lid a jeho národní uvědomění vydával beletristický časopis Koleda, v němž se svými spolupracovníky šířil českou osvětu, lásku k rodné zemi a lásku k rodné řeči, k bohaté a slavné národní minulosti.Společně se svým tchánem MUDr. Jindřichem Wankelem, který byl badatelskou osobností evropského významu, s prof. Vincencem Praskem a poslancem zemského sněmu P. Ignátem Wurmem založili v roce 1883 Muzejní spolek olomoucký a z darů nadšených sběratelů i první české muzeum na Moravě - Vlastenecké muzeum v Olomouci. Od roku 1886 založil a redigoval i Časopis vlasteneckého spolku muzejního, přispíval do něj průkopnickými studiemi národopisnými a přispěl k poznání pokladů lidového umění na Moravě. Se svou manželkou připravil i výstavu moravských výšivek, která byla opakována v Náprstkově muzeu v Praze. Exponáty okouzlily i uměnímilovnou císařovnu Sisi, jejímž přičiněním byla výstava instalována i v Průmyslovém muzeu ve Vídni. Profesor Havelka byl i oblíbeným publicistou spisovatelem V roce 1887 vyšly jeho Vybrané spisy vychovatelské a vyučovatelské; napsal knihy pro mládež, např. Kratičké dějiny Moravy pro mládež a lid a populární Cesty po Moravě. Své kartografické zkušenosti zhodnotil vytvořením Nástěnné mapy Moravy, psal i statě z estetiky, přírodopisu a literární kritiky. Ilustroval Moravu pravěkou svého tchána dr. Wankla. Psal i beletristické povídky pro časopis Koleda a Beseda olomoucká. Jeho Sebrané básně vydal posmrtně v roce 1888 V. Houdek. Prof. Havelka je rovněž autorem textu písně Moravě, která se stala „moravskou hymnou“ a jako taková je součástí slavnostního repertoáru našich předních pěveckých sborů .","name":"Jan","title":"gymnaziální profesor, historik, archeolog, etnograf, spisovatel, muzejník","birth":"22. listopadu 1839 Loštice","died":"20. října 1886 Olomouc"},{"state":1,"id":"id_s56","surname":"Hikl","text":"Pocházel z Drahanské vysočiny a studentská léta prožil v Prostějově, kde na tamním gymnáziu maturoval v roce 1909. Následně studoval obory dějepis a zeměpis na Filosofické fakultě pražské university a od roku 1915 učil na gymnáziu v Táboře. Po vzniku samostatné Československé republiky odešel spolu s mnoha příslušníky české inteligence na Slovensko, s cílem vybudovat dosud neexistující slovenské národní školství. Učil 17 let ve Skalici na moravsko-slovenském pomezí a v roce 1935 byl jmenován ředitelem gymnázia v Banské Štiavnici. Na obou působištích se osvědčil nejen jako vynikající pedagog, ale i jako buditel národního kulturního života v mnoha jeho podobách. Nová politická moc Slovenského štátu však prof. Hikla (i tisíce jemu podobných) vyřadila ze státní služby a přikázala jim vystěhování do tzv. Protektorátu. V létě roku 1939 mu Ministerstvo školství a národní osvěty nabídlo uvolněné místo ředitele na Českém dívčím reformním reálném gymnáziu v Olomouci. Čekal ho zde nesmírně těžký, náročný a nezáviděníhodný úkol. Nepřízeň nacistické zvůle přinutila ústav se čtyřikrát stěhovat a krutě redukovat počet žákyň i profesorů. Odpor byl nepřípustný. Nevděčná role těchto záměrů připadla pochopitelně řediteli školy. Prof. Hikl byl navíc k 1. říjnu 1942 pověřen Ministerstvem školství i vedením reálného gymnázia v Kosinově ulici (Slovanského gymnázia) a v následující školním roce DRRG zlikvidovat. Prof. Hikl se nikdy nezkompromitoval kolaborací s okupační mocí a nikoho nezradil. Byl to tichý, slušný a chápající člověk. Nebyl „bojovníkem barikád“. Po válce čelil útokům mnohých, kteří mu „radili“, jak to měl, či neměl dělat. Dne 12. května 1945 tedy prof. Hikl svoji olomouckou misi ukončil a odešel do tzv. „pohraničí“. Stal se ředitelem obnoveného českého reálného gymnázia v Moravské Třebové. Mj. sepsal dějiny města Moravské Třebové a okolí, zasloužil se o obnovení moravskotřebovského muzea v českém duchu, získával pro region české učitele a kulturní pracovníky. Přesto ze školských služeb musel nedobrovolně odejít po únoru 1948. Vrátil se do Olomouce, kde své síly a rozsáhlé znalosti dal do služeb nově budovaného Studijního a lidovýchovného ústavu kraje Olomouckého. Publikoval přehledy regionální literatury v jeho sbornících a později i ve Zprávách Vlastivědného ústavu v Olomouci, kde mnohokrát osvědčil svou profesionalitu v historii. ","name":"Rudolf","title":"středoškolský pedagog, ředitel olomouckých středních škol, publicista","birth":"13. února 1890 Dzbel u Konice","died":"27. listopadu 1970 Olomouc"},{"state":0,"id":"id_s57","surname":"Hirsch","text":"Maturoval na SGO v roce 1938, byl totálně nasazen a po válce vystudoval medicínu. Věnoval se chirurgii, byl průkopníkem moderní anesteziologie. Od roku 1960 byl primářem anesteziologického a resuscitačního oddělení FNO. Tento obor rovněž přednášel medikům na LF UP a byl spoluautorem učebních textů.","name":"Alfréd","title":"lékař, vysokoškolský pedagog ","birth":"8. srpna 1919 Prostějov","died":"1. prosince 2006 Olomouc"},{"state":2,"id":"id_s58","surname":"Hlavinka","text":"Po maturitě na SGO (1873) a studiích bohosloví byl v letech 1877-1879 katechetou na Slovanském gymnáziu. Odtud odešel do duchovní správy do Brna, od roku 1890 byl farářem v Kučerově, 1921-1923 v Olomouci a posléze v Kroměříži. Publikoval v Obzoru, v časopise Náš domov. Užíval pseudonym Vojna, Kantilen. Upravoval též národní písně.","name":"Alois","title":"vlastenecký kněz, hudebník, profesor Slovanského gymnázia","birth":"4. července 1852 Věrovany","died":"26. února 1931 Kroměříž"},{"state":0,"id":"id_s59","surname":"Hoch","text":"Po maturitě na SGO v roce 1879 absolvoval v Praze práva. Svou advokátní kancelář měl v Prostějově, kde se čile účastnil českého národního a spolkového života. Byl prostějovským starostou Sokola, předsedou pěveckého spolku Orlice a sám vynikal jako tenor. Patřil do okruhu přátel Ondřeje Přikryla a Otokara Březiny. Přispíval do Humoristických listů a v roce 1903 vydal v Prombergerově nakladatelství v Olomouci knihu „Hanácké obrázky“.","name":"Jan","title":"advokát, prozaik, pěvec","birth":"21. prosince 1860 Hrubčice","died":"18. března 1925 Prostějov"},{"state":0,"id":"id_s60","surname":"Houdek","text":"Po maturitě na SGO v roce 1876 studoval práva v Praze. Pracoval jako koncipient v Brně, odkud odešel do vládní administrativy do Vídně. Po návratu do Brna byl víceprezidentem Moravského místodržitelství, a to až do 1. Prosince 1915, kdy odešel pro nemoc do důchodu. Zasloužil se mj. o založení olomouckého muzea, byl členem Ústřední komise pro umělecké a historické památky ve Vídni. Literárně činný byl již od dob studií na Slovanském gymnáziu, je autorem několika vlastivědných prací.","name":"Vítězslav","title":"právník, politik, spisovatel, překladatel, redaktor","birth":"27. července 1856 Náměšť na Hané","died":"1. června 1916 Náměšť na Hané"},{"state":0,"id":"id_s61","surname":"Hrdlička","text":"Po maturitě na SGO v roce 1902 a po studiích přírodních věd na univerzitě v Praze působil v letech 1906 - 1939 na olomoucké České reálce jako profesor přírodopisu, matematiky, fyziky a němčiny.  Dne 1. září 1939 byl zatčen gestapem a vězněn v koncentračních táborech. Po válce byl reaktivován. Patřil mezi oblíbené učitele, který se věnoval žákům i ve volném čase. Byl vynikajícím řečníkem. Stál v Olomouci u zrodu skautingu, podílel se na vzniku Církve československé husitské a později církve pravoslavné. Byl blízkým spolupracovníkem biskupa Gorazda. Vysoce jsou hodnoceny jeho překlady díla Stefana Zweiga. Pracoval pro Osvětové sbory na Moravě, byl aktivní i v olomouckém Vlasteneckém spolku muzejním. ","name":"Josef","title":"středoškolský pedagog, překladatel, významný skautský činovník","birth":"11. února 1883 Velký Týnec","died":"7. července 1956 Teplice nad Bečvou"},{"state":0,"id":"id_s62","surname":"Hromada","text":"Po maturitě na SGO v roce 1928 studoval medicínu na UK v Praze (1934). Od roku 1946 budoval a vedl na Univerzitě Palackého v Olomouci Ústav normální anatomie. Od roku 1947 vedl i Ústav histologie a embryologie. V roce 1951 byl jmenován přednostou Anatomického ústavu Vojenské lékařské akademie. Publikoval na 150 odborných studií a spisů. Za svoji rozsáhlou vědeckou práci byl oceněn zlatou medailí UP, zlatou medailí UK a Medailí J. A. Purkyně. Měl vřelý vztah k rodnému kraji. Jeho nejoblíbenějším místem dovolených byla Haná, která se stala i místem jeho posledního odpočinku (ÚOH).","name":"Jan","title":"lékař, anatom, univerzitní profesor","birth":"18. června 1909 Hruška u Prostějova","died":"8. dubna 1970 Hradec Králové"},{"state":0,"id":"id_s63","surname":"Hruban","text":"Po maturitě na SGO v roce 1882 vystudoval práva na vídeňské univerzitě. Po krátké právnické praxi u Zemského trestního soudu ve Vídni vstoupil v roce 1888 jako koncipient do advokátní kanceláře staročeského politika JUDr. Jana Žáčka. V roce 1895 si otevřel vlastní advokátní kancelář. Byl spoluzakladatelem Katolické národní strany na Moravě, jejímž předsedou byl zvolen v roce 1896. V roce 1901 byl zvolen do Říšské rady a o rok poději se stal členem Moravského zemského sněmu. V obou institucích byl předsedou klubu katolických poslanců. V roce 1907 byl zvolen místopředsedou Národního klubu českých poslanců v Říšské radě, spoluzakladatelem Slovanského centra a místopředsedou Slovanské jednoty. V letech 1908 - 1912 byl náměstkem moravského zemského hejtmana. Koncem října 1918 se v Ženevě zúčastnil jednání představitelů domácího a zahraničního odboje o budoucí podobě státu. Stal se ministrem v první československé vládě vedené Karlem Kramářem. Společně s Msgre. Janem Šrámkem se zasloužil o sjednocení různých křesťanských frakcí do Československé strany lidové (1919). V roce 1920 byl za tuto stranu zvolen poslancem, vykonával funkci místopředsedy Národního shromáždění a předsedal ústavně právnímu výboru. V roce 1925 se stal senátorem až do roku 1938. Současně byl po celou dobu místopředsedou výkonného výboru ČSL. Po mnichovské kapitulaci se stáhl z politického života. Zemřel krátce po válce 16. září 1945, je pochován na olomouckém hřbitově (k jeho smrti přispěla i skutečnost, že za odbojovou činnost byl v posledních dnech války popraven jeho starší syn JUDr. Vladimír Hruban, papežský komoří). ","name":"Mořic","title":"právník, politik","birth":"30. listopadu 1862 Brodek u Prostějova","died":"16. září 1945 Olomouc"},{"state":0,"id":"id_s64","surname":"Hrubý","text":"Po maturitě na SGO v roce 1907 studoval historii v Praze, kde promoval v roce 1912. Největší vliv na něho měl prof. Josef Pekař, u něhož byl asistentem v Historickém semináři. V letech 1913 - 1919 působil jako středoškolský profesor na gymnáziu. Po překonání vážného onemocnění začal v roce 1920 pracovat v Moravském zemském archivu v Brně, kde působil do roku 1937. Poslední desetiletí byl ředitelem archivu. V roce 1931 byl jmenován mimořádným profesorem Masarykovy univerzity a 1936 řádným profesorem, od roku 1937 profesorem všeobecných dějin západoevropských středního věku. Aktivně působil v moravských i celostátních vědeckých institucích, byl členem České akademie věd a umění, Královské české společnosti nauk, Národní rady badatelské, Archivní společnosti, Matice moravské a dalších. Téměř celé jeho dílo se vztahuje k historii 16. a 17. století a zejména k dějinám Moravy. Podnikl několik studijních zahraničních cest, navštívil archivy v Římě, Basileji, Paříži aj. Za nejlepší jeho badatelskou činnost bývají považovány práce o Ladislavu Velenovi z Žerotína. Počátkem třicátých let napsal knihu Severní Morava v dějinách, kde zkoumá národnostní vývoj v oblasti od 11. do 17. století. Kniha vyšla až posmrtně v roce 1947 a jsou v ní mj. zachyceny využité archiválie nejen z MZA v Brně, ale i z archivů v Uničově, Litovli a Šternberku.","name":"František","title":"historik, zemský archivář, univerzitní profesor","birth":"21. srpna 1887 Strukov","died":"10. února 1943 Brno. "},{"state":0,"id":"id_s65","surname":"Hrubošová","text":"Vyrůstala v inspirujícím uměleckém prostředí, její otec, mezinárodně uznávaný umělecký fotograf Miloslav Stibor, byl v 50. letech profesorem SGO. Po maturitě na Slovanském gymnáziu v roce 1979 vystudovala Pedagogickou fakultu UP (R - Vv) a od roku 1985 působí na výtvarném oboru Základní umělecké školy Miloslav Stibora. V současnosti je ředitelkou této školy. Věnuje se zejména textilní technice art-protis. Od roku 1995 je členkou Unie výtvarných umělců Olomoucka.","maiden":"Stiborová","name":"Zuzana","title":"výtvarnice a pedagožka","birth":"16. června 1960 Olomouc","died":""},{"state":2,"id":"id_s66","surname":"Hřivna","text":"Humanista, žák a osobní přítel prof. T. G. Masaryka, vlastenecky smýšlející profesor latiny a řečtiny, v letech 1920 - 1925 ředitel Slovanského gymnázia. Tento mimořádně skromný, pracovitý a vnitřní bolestí zamlklý muž požíval velké úcty nejen na veřejnosti a v profesorském sboru, ale zejména v kruzích legionářů. I když sám legionářem nebyl, zúčastňoval se všech jejich akcí. Měl totiž syna Božetěcha - legionáře proslulého svým nebývalým hrdinstvím v bojích na sibiřské magistrále od Uralu po Vladivostok. Vít Hřivna absolvoval Slovanské gymnázium v roce 1885 (chodil do společně do třídy s pozdějším arcibiskupem Leopoldem Prečanem). Po studiích Filosofické fakulty UK v Praze učil na Slovanském gymnáziu v letech 1892 - 1897 latině a řečtině. V letech 1898 - 1908 působil na gymnáziu ve Valašském Meziříčí. V roce 1908 se vrátil na Slovanské gymnázium Olomouc, na němž byl ve dvacátých letech ředitelem. ","name":"Vít","title":"ředitel Slovanského gymnázia","birth":"10. června 1867 Příkazy","died":"23. listopadu 1936"},{"state":0,"id":"id_s67","surname":"Hudec","text":"Po maturitě na SGO v roce 1895 studoval bohosloví. Vysvěcen na kněze byl v roce 1900. Od roku 1902 učil náboženství, roku 1908 byl jmenován profesorem bohosloví v Brně a od roku 1919 přednášel Nový zákon na olomouckém bohosloví. Podnikl studijní cestu do Palestiny a Malé Asie. Publikoval v časopisech Poutník jerusalemský, v revue Na hlubinu, ve Vyhlídalově Hlídce. Podílel se též na zpracování Českého bohovědného slovníku. Knižně vydal např. Obrazy z východu (1915), Za časů Kristových (1919) aj. Ve dvou funkčních obdobích byl děkanem Cyrilometodějské teologické fakulty. Působil rovněž jako předseda Akademie velehradské. ","name":"Tomáš","title":"papežský prelát","birth":"7. ledna 1877 Věrovany u Dubu na Moravou","died":"22. srpna 1951 Olomouc"},{"state":0,"id":"id_s68","surname":"Hudec","text":"Po maturitě na SGO v roce 1947 studoval hudební vědu a francouzštinu na FF UP. Absolvoval v roce 1951 a v roce 1953 získal doktorát obhajobou disertační práce „Česká hudba a tvorba Antonína Dvořáka“. Od roku 1955 působil na PdF UP, v roce 1989 přešel na brněnskou JAMU. Hojně publikoval v denním i v odborném tisku. Byl dirigentem studentského vysokoškolského pěveckého sboru UP.","name":"Vladimír","title":"hudební vědec, dirigent, univerzitní profesor, rektor JAMU","birth":"10. 12. 1929 Olomouc","died":"12. září 2003 Brno"},{"state":0,"id":"id_s69","surname":"Hudlický","text":"Maturoval na SGO v roce 1938. Po absolvování vysokoškolských studií chemie působil na ČVUT Praha. Četná publikační činnost z oboru organické chemie přispěla k jeho habilitaci jako jednoho z nejmladších docentů v oboru. Po okupaci Československa v roce 1968 emigroval do USA, kde nadále působil jako vysokoškolský pedagog a ve vědeckém výzkumu. ","name":"Miloš ","title":"chemik","birth":"12. května 1919 Přelouč","died":"31. srpna 2001"},{"state":1,"id":"id_s70","surname":"Cholava","text":"Po studiích filologie na vídeňské univerzitě byl v letech 1870 - 1886 profesorem latiny a řečtiny na Slovanském gymnáziu Olomouc. Angažoval se v českých společenských kruzích, mj. se zasloužil o zřízení České měšťanské školy a Národního domu v Olomouci.","name":"Štěpán","title":"gymnaziální profesor","birth":"19. září 1831 Lutopecny u Kroměříže","died":"7. února 1891 Olomouc"},{"state":0,"id":"id_s71","surname":"Janošík","text":"Po maturitě na SGO v roce 1877 studoval medicínu v Praze. V roce 1885 byl jmenován mimořádným profesorem a 1893 řádným profesorem histologie a embryologie na tamní lékařské fakultě. Zde v roce 1894 založil Anatomický ústav, v jehož čele stál až do roku 1926. Od roku 1902 byl řádným členem ČSAV, v letech 1898 - 1899 děkanem pražské lékařské fakulty a dne 25. června 1910 byl zvolen rektorem České Karlo-Ferdinandovy univerzity. Napsal řadu odborných publikací, které byly později přeloženy do angličtiny, ruštiny, italštiny, němčiny a francouzštiny. Pro mediky vydal i první českou učebnici Histologie a mikroskopická anatomie (1892), v letech 1897 - 1901 učebnici Anatomie člověka I., II. a v letech 1897 - 1904 sedmidílný Anatomický atlas. K jeho sedmdesátinám mu zaslal blahopřejný dopis president T.G. Masaryk (datováno v Lánech 24. června 1926).","name":"Jan","title":"univerzitní profesor, zakladatel české anatomické školy","birth":"26. června 1856 Vrbátky u Prostějova","died":"8. května 1927 Praha"},{"state":0,"id":"id_s72","surname":"Jiříček","text":"Po studiích na SGO absolvoval olomoucké pedagogické gymnázium (tzv. „Fučíkova škola“ v Olomouci na Hradě) a následně společenské vědy a speciální pedagogiku na FF UP. Učil na ZŠ v Pasece, v Lipině, na Zvláštní škole ve Slavoníně, na ZŠ pro dyslektické děti na Sv. Kopečku a v letech 1972 - 1991 tamtéž na ZŠ pro děti s vadami sluchu. V závěru své aktivní pedagogické dráhy byl inspektorem pro zvláštní školy v okresech Vyškov, Přerov, Šumperk, Prostějov a Olomouc (se sídlem na detašovaném pracovišti MŠMT v Olomouci). Má za sebou bohatou odbornou publikační činnost. V mládí nadšeně hrával divadlo v Jednotě divadelních ochotníků.","name":"Milan","title":"speciální pedagog, logoped a divadelní ochotník","birth":"21. října 1931 Olomouc","died":"8. ledna 1996"},{"state":0,"id":"id_s73","surname":"Jiřík","text":"Po maturitě na SGO v roce1879 studoval dva roky práva v Praze. Z existenčních důvodů musel studia zanechat a věnoval se učitelské praxi na školách v Pavlovicích u Přerova, v Třeběticích a v Přerově. Od roku 1895 působil na Obchodní škole v Brně a v letech 1904-1923 ředitelem Obchodní školy ve Vyškově. V roce 1900 podnikl studijní cestu do Paříže a Londýna. Byl autorem učebnic obchodního zeměpisu, účetnictví a němčiny. Překládal angloamerickou literaturu, především humoristické prózy. Přeložil rovněž Shakespearovy hry (vydány v r. 1907). Psal do denního a odborného tisku metodické nebo národohospodářské články. Přispíval též do časopisů Lumír (1892), Domácí hospodyně (1893), Moravská orlice (1900). Pravidelně přispíval do výročních zpráv obchodní školy ve Vyškově.","name":"Richard","title":"učitel a překladatel","birth":"12. září 1859 Grymov","died":"16. května 1927 Vyškov"},{"state":0,"id":"id_s74","surname":"Jochman","text":"Po maturitě na SGO v roce 1969 studoval na FF UP výtvarnou teorii a výchovu. Svůj talent prezentoval na samostatných výstavách v plenéru v Kroměříži (1978), na Sovinci (1985) a v olomouckých galeriích (1987, 1991). Zúčastnil se rovněž výstavy v Drážďanech v roce 1990. Od roku 1991 působí na Katedře výtvarné výchovy PdF UP.","name":"Petr","title":"výtvarník, historik umění, vysokoškolský pedagog","birth":"17. dubna 1951","died":""},{"state":0,"id":"id_s75","surname":"Kačírková","text":"Literárními kritiky je označována za „královnu české detektivky“. Po maturitě na SGO v roce 1955 vystudovala učitelství biologie a chemie na Přírodovědecké fakultě UP. Zpočátku učila na základních školách v okolí Olomouce, poté pracovala v Praze jako laborantka a po mateřské dovolené od roku 1965 jako úřednice. Od roku 1973 se profesionálně věnuje literatuře. Její knihy byly přeloženy do němčiny, ruštiny a slovenštiny. Publikuje v různých časopisech, např. Vlasta, Květy aj. Od roku 1971 spolupracuje s režisérkou Věrou Chytilovou, podílela se na scénáři k filmu Panelstory aneb Jak se rodí sídliště. Zahrála si v něm i jednu z hlavních rolí. Filmové role ztvárnila i ve filmech Hra o jablko a Faunovo velmi pozdní odpoledne.","maiden":"Navrátilová","name":"Eva","title":"spisovatelka, scénáristka a filmová herečka","birth":"26. ledna 1937 Olomouc","died":""},{"state":1,"id":"id_s76","surname":"Kadeřávek","text":"Gymnázium studoval ve svém rodišti a v Jihlavě, kde maturoval. Ve svých 19 letech vstoupil do premonstrátského řádu v Želivě. Na kněze byl vysvěcen v roce 1864. Na KFU v Praze studoval klasickou filologii (řečtinu a latinu), v roce 1871 byl promován doktorem filosofie. Následně působil jako středoškolský profesor ve svém rodišti, v letech 1872 - 1891 byl profesorem Slovanského gymnázia Olomouc, na němž učil latině, řečtině a filozofii. Současně přednášel i na olomoucké bohoslovecké fakultě. V roce 1891 byl povolán na KFU do Prahy, kde byl jmenován řádným profesorem křesťanské filozofie. Poslední léta svého života prožil v ústraní v Želivě.","name":"Eugen","title":"gymnaziální a univerzitní profesor ","birth":"16. července 1840 v Německý (Havlíčkův) Brod","died":"3. května 1922 Želiv"},{"state":0,"id":"id_s77","surname":"Kašpar","text":"Studoval nižší třídy Slovanského gymnázia a po kvartě přestoupil na německý učitelský ústav, který absolvoval v roce 1899. Již za středoškolských studií kreslil olomouckému lékaři a paleontologovi Mořici Remešovi zkameněliny a prof. Františku Polívkovi ilustroval Květenu zemí koruny české. Od té doby se datuje i celoživotní spolupráce Adolfa Kašpara s nakladatelem Romualdem Prombergerem, který ho doporučil ke studiím na AVU u prof. Hanuše Schwaigera (absolvoval ji v letech 1899 -1904). V roce 1903 Adolf Kašpar mimořádně zdařile ilustroval Babičku Boženy Němcové, čímž byla předurčena budoucnost jeho tvorby, která měla těžiště v knižní ilustraci děl A. Jiráska, Z. Wintra, K. V. Raise, I. Hermanna atd. Kašpar byl kmenovým ilustrátorem Prombergerova nakladatelství v Olomouci i Ottova nakladatelství v Praze. Od roku 1910 žil v Lošticích, odkud často zajížděl na Rusavu a do Bystřice pod Hostýnem. ","name":"Adolf","title":"akademický malíř, grafik a ilustrátor","birth":"27. prosince1877 Bludov u Šumperka","died":"29. června 1934 Železná Ruda na Šumavě"},{"state":0,"id":"id_s78","surname":"Kašpar","text":"Po maturitě na SGO v roce 1940 působil jako cizojazyčný korespondent. V letech 1947 - 1953 vystudoval lékařství na LF UP (současně byl mimořádným posluchačem historie a jazyků na FF UP). Po promoci si zvolil povolání důstojníka zdravotnictví. Z vážných zdravotních důvodů odešel z armády a působil v lázeňských městech: Karlovy Vary a Františkovy Lázně. Po návratu na Moravu byl lékařem v šumperské nemocnici a později závodním lékařem v Uničovských strojírnách, od roku 1963 působil na Prostějovsku. Byl mimořádně aktivním členem Sekce dějin lékařství VSMO. Vyvíjel bohatou publikační a přednáškovou činnost.","name":"Rudolf","title":"lékař, historik lékařství","birth":"23. srpna 1921  Šumperk","died":""},{"state":0,"id":"id_s79","surname":"Klobouk","text":"Po maturitě na SGO (1905) vystudoval ve Vídni veterinární lékařství (1913) a první roky pracoval v tehdy začínajícím a mimořádně perspektivním oboru imunologie (Ústav pro výzkum a výrobu očkovacích látek v Mödlingu u Vídně). Po vzniku ČSR spoluzakládal Vysokou školu veterinární v Brně, na níž byl v roce 1927 jmenován řádným profesorem. Ve vědeckých kruzích a následně v praxi získal věhlas studiem a úspěšným řešením problematiky slintavky, TBC skotu a infekční obrny prasat. Je autorem více než 70 vědeckých prací, 2 vysokoškolských učebnic, vedl 133 disertačních prací. V letech 1946 - 1949 byl na Vysoké školy veterinární rektorem. Od roku 1999 nese jeho jméno pavilon Kliniky velkých zvířat v areálu Veterinární a farmaceutické univerzity na Palackého třídě v Brně.","name":"Antonín","title":"vysokoškolský pedagog, veterinární lékař","birth":"18. září 1885 VelkýTýnec","died":"12. listopadu 1956 Brno "},{"state":0,"id":"id_s80","surname":"Klvaňa","text":"Prožil dětství v Lipníku nad Bečvou. Po maturitě na SGO v roce 1877 vystudoval FF UK v Praze a v letech 1882 - 1898 vyučoval na gymnáziu v Kroměříži (s výjimkou školního roku 1891-1892, kdy učil v Uherském Hradišti). Od 1. září 1898 až do své smrti byl ředitelem nově vzniknuvšího českého gymnázia v Kyjově, které dnes nese jeho jméno. Podnikal národopisné výlety do blízkého okolí i daleké cesty po Evropě (Itálie, Německo, Francie, Švýcarsko, Balkán, Řecko, Velká Británie, Belgie, Holandsko, Rumunsko, Bulharsko, Turecko). Byl všestranně vzdělaným člověkem, který plynně hovořil německy, francouzsky i anglicky, ovládal klasickou latinu i řečtinu. Jeho dílo má úzký vztah ke Slovácku, Valašsku, Hané a Záhoří. Publikoval přírodovědné články v odborných časopisech, psal etnografické články a monografie, přednášel o moravské lidové kultuře. Stýkal se s předními osobnostmi vědeckého a společenského života, do okruhu jeho přátel patřili Alois Jirásek, Adolf Heyduk, Jaroslav Vrchlický, Antonín Dvořák, Leoš Janáček, František Bartoš a Joža Úprka. Za vynikající pedagogickou práci obdržel od císaře Františka Josefa I. titul vládní rada.","name":"Josef","title":"etnograf, přírodovědec, pedagog","birth":"21. ledna 1857 Vídeň","died":"13. srpna 1919 Kyjov"},{"state":1,"id":"id_s81","surname":"Koblížek","text":"Po maturitě na gymnáziu v Olomouci studoval na univerzitě ve Vídni. Poté deset let působil na SGO jako profesor latiny a řečtiny. V roce 1878 byl povolán do Slaného, kde se stal ředitelem gymnázia. V roce 1892 se přestěhoval do Prahy a učil na gymnáziu v Křemencové ulici. Jeho literární činnost měla pedagogicko-didaktický směr. Spolu s profesorem Janem Havelkou redigoval od roku 1873 učitelský časopis Komenský, od roku 1876 čtrnáctideník Národ a škola a od 1877 zábavný časopis Koleda. V roce 1872 stál u zrodu Matice školské. Vydal německé cvičebnice a další učební pomůcky a materiály ke studiu. Přeložil z latiny Cicerona.","name":"Karel","title":"gymnaziální profesor, redaktor pedagogických periodik, překladatel","birth":"30. ledna 1838 Velká Bystřice","died":"15. května 1897 Praha"},{"state":0,"id":"id_s82","surname":"Komárek","text":"Absolvoval SGO v roce 1943, poté byl totálně nasazen. Vysokoškolská studia zahájil v poválečných letech na FF UK a dokončil je v roce 1949 na FF UP v Olomouci. Jeho profesní kariéra je spjata s Univerzitou Palackého, na níž se zabýval jazykovědnou bohemistikou, fonologií, morfologií, slavistikou a obecnou lingvistikou. Je autorem cca 160 studií a odborných statí. V letech 1987 - 1988 přednášel na univerzitách v Rakousku, Švédsku a Dánsku. Ačkoli byl navržen ke jmenování profesorem již v roce 1969, byl jím v důsledku nepřízně tehdejší moci pro své zásadové postoje jmenován až v roce 1990.","name":"Miroslav","title":"vysokoškolský pedagog, lingvista, bohemista","birth":"20. dubna 1924 v Lazníky","died":"15. srpna 2013 Olomouc"},{"state":0,"id":"id_s83","surname":"Konečný","text":"Po maturitě na SGO v roce 1948 vystudoval medicínu na LF UP. Jeho další osud je spojen s Vojenským lékařským a doškolovacím ústavem v Hradci Králové. Svými znalostmi, zkušenostmi a vynikající operační technikou se vypracoval na uznávaného chirurga v oblasti gastroenterologie a chirurgie žlučových cest. A od roku 1958 až do svého odchodu do důchodu v roce 1991 byl vedoucím katedry válečné chirurgie a od roku 1985 řídil i II. chirurgickou kliniku FN v Hradci Králové. V naší i zahraniční odborné literatuře publikoval kolem 80 původních prací, je autorem vysokoškolských učebnic. ","name":"Bohumil","title":"lékař, vysokoškolský pedagog","birth":"3. srpna 1929 Brodek u Konice","died":""},{"state":2,"id":"id_s84","surname":"Kořínek","text":"Na Slovanském gymnáziu maturoval v roce 1874. Po vysokoškolských studiích byl nejdříve suplentem a pak profesorem latiny, řečtiny a češtiny na brněnském gymnáziu. Odtud přešel řídit gymnázium v Třebíči a v roce 1908 převzal řízení Slovanského gymnázia. I když měl uzavřenou povahu, tak rozsáhlými znalostmi literární historie, svou rozsáhlou publikační a veřejnou činností posilující české národní sebevědomí si získal oblibu zejména u studentů vyšších ročníků. Ředitel Kořínek obnovil tradici studentských „Majáles“ na Sv. Kopečku, spojených s veselým programem se zpěvem a taneční zábavou. Organizoval přednášky o významných spisovatelích a jejich vlivu na národní uvědomění českého obyvatelstva.","name":"Karel","title":"ředitel Slovanského gymnázia, předseda spolku Žerotín","birth":"15. února 1856 Olomouc","died":"2. února 1920 Olomouc"},{"state":0,"id":"id_s85","surname":"Kosatík","text":"Po maturitě na SGO v roce 1951 a po studiích medicíny na LF UP pracoval v letech 1957-1960 na OÚNZ v Zábřehu na Moravě. V roce 1960 přešel do Fakultní nemocnice v Olomouci. V letech 1961-1991 působil jako šéf Ústavu soudního lékařství a medicínského práva LF UP. Bohatě publikoval, byl i autorem řady studijních textů pro mediky.","name":"Alois","title":"univerzitní profesor, lékař ","birth":"2. září 1932 Olomouc","died":"30. prosince 1999 Olomouc"},{"state":1,"id":"id_s86","surname":"Kosina","text":"Pod jeho vedením se dokázalo Slovanské gymnázium z nesmírně skromných podmínek vypracovat ve věhlasný vzdělávací ústav s akčním radiem téměř celé Moravy a Slezska. Kosina v krátké době vytvořil profesorský sbor z vynikajících osobností a svým příkladem podněcoval své kolegy i studenty k cílevědomé práci ve škole i ve veřejném životě. Jeho celoživotní láskou byla antická filosofie a kultura. Studoval i historii a měl obdivuhodně široké odborné a jazykové znalosti, které získal za středoškolských studií v mnohojazyčném Lvově. Své literární ambice realizoval v oblasti vědecké a společenské publicistiky. Na pražské univerzitě studoval kromě češtiny a dějepisu i latinu a řečtinu. Už ve svém prvním působišti na gymnáziu v Hradci Králové (1853 - 1867) kromě svědomité výuky překládal mj. Platona a Sokrata a napsal dokonce vlastní učebnici latiny. Osvojil si výborně klasickou rétoriku, nesnášel germanizmy a i od svých podřízených vyžadoval kultivovaný jazykový projev. V Olomouci se celou svou tvůrčí erudicí pustil do práce na Slovanském gymnáziu a mimořádně aktivně se zúčastňoval českého vlasteneckého života. Měl zásadu: „Běda národu, který není veden k poezii! K jeho humanitnímu duchovnímu odkazu se i svými vlastními literárními aktivitami hlásili jeho nástupci, jeho žáci i studenti v dalších generacích. Kosina své literární ambice realizoval v oblasti filosofie a jazykovědy. Zásadním způsobem se zasloužil o založení časopisu Komenský, který vyšel poprvé v Olomouci v roce 1873 (a který přes peripetie doby vychází dodnes). Jeho nejznámějším dílem jsou olomouckým českým intelektuálním životem inspirované Hovory olympské, zahrnující dobové filosofické úvahy a kritiky jazykovědné a literární. V jeho literární pozůstalosti je ukryta i bohatá korespondence, z níž nejrozsáhlejší a nejvýznamnější je korespondence s Františkem Bartošem a s Jaroslavem Vrchlickým.Kromě usilovné  práci na rozvoji Slovanského gymnázia byl Kosina i spiritus agens olomouckých českých vlasteneckých spolků (Matice školská, Spolek učitelů moravských, Vlastenecké muzeum, Sokol). ","name":"Jan Evangelista","title":"gymnaziální profesor, první ředitel Slovanského gymnázia","birth":"22. prosince 1827 Josefov ","died":"10. prosince 1899 Olomouc"},{"state":0,"id":"id_s87","surname":"Koudela","text":"Po maturitě na SGO v roce 1982 studoval na FF UP historii a v roce 1988 obhájil doktorát. Od roku 1986 působí jako odborný archivář Státního okresního archivu v Olomouci. Předmětem jeho zájmu je regionální historie Olomoucka. Veřejnosti je znám svou rozsáhlou publikační činností (např. Paměti obce Vilémova, Paměti obce Horní Loděnice, Paměti obce Cholina, Švédové v Olomouci, Šternberk slovem a obrazem, Nová Hradečná, Paměti obce Řídeč aj.)","name":"Miroslav","title":"historik, archivář","birth":"7. června 1964 Olomouc","died":""},{"state":0,"id":"id_s88","surname":"Koukal","text":"Po maturitě na SGO v roce 1959 vystudoval obor tělesná výchova - učitelství pro 1.-5. ročník. V roce 1968 začal učit v Karlovicích, po návratu do Olomouce pracoval v letech 1970-1976 v ODPM, v letech 1976-1980 byl ředitelem Domu pionýrů a mládeže ve Šternberku. Poté pracoval na programovém oddělení Parku kultury a oddechu a v letech 1991-1998 zde zastával funkci ředitele. Na kulturním životě v Olomouci se podílel i jako ředitel Městské správy kin.","name":"Jan","title":"učitel a kulturní pracovník","birth":"6. dubna 1942 Nové Město na Moravě","died":""},{"state":1,"id":"id_s89","surname":"Kovář","text":"Po studiích na Vídeňské univerzitě působil na gymnáziích v Brně, ve Valašském Meziříčí a v letech 1899 - 1917 na SGO, kde byl profesorem latiny, řečtiny a filozofie. Ovládal rovněž angličtinu, francouzštinu i němčinu, zabýval se i hebrejštinou. Patřil k oněm činorodým pedagogům, kteří se po celý svůj život věnovali také vědecké práci.","name":"František","title":"gymnaziální profesor, jazykovědec","birth":"30. ledna 1860 Byzhradec u Rychnova n. Kněžnou","died":"11. října 1917 Olomouc"},{"state":0,"id":"id_s90","surname":"Kozánek","text":"V letech 1867 - 1875 studoval na SGO a 1882 absolvoval v Praze práva. Za pražských studií se seznámil s Antonínem Dvořákem, který měl na něj velký vliv. Kozánek pak řadu let působil jako sbormistr kroměřížského pěveckého sdružení Moravan. V té době Antonín Dvořák několikrát Kroměříž navštívil. Od roku 1887 měl Karel Kozánek advokátní praxi v Kyjově. Po celý život se věnoval řízení pěveckých sborů a harmonizaci moravských lidových písní.","name":"Karel","title":"sbormistr, pianista, skladatel","birth":"5. března 1853 Kroměříž","died":"2. ledna 1941 Kyjov"},{"state":1,"id":"id_s91","surname":"Kratina","text":"Po gymnazijních studiích v Brně studoval v letech 1903 - 1908 na Karlo - Ferdinandově uni verzitě francouzštinu, němčinu, filosofii a psychologii, absolvoval i studijní pobyty na univerzitách v Mnichově a v Paříži. S výjimkou válečných let působil od roku 1908 na kroměřížském gymnáziu, v letech 1921 - 1934 byl profesorem francouzštiny a němčiny na Slovanském gymnáziu. Patřil k oněm výjimečným středoškolským učitelům, kteří se neustále vzdělávali. Výsledky svých vědeckých bádání publikoval časopisecky i knižně, stážoval na prvořadých psychologických pracovištích v zahraničí. Po habilitaci z psychologie v roce 1933 pokračoval ve své vědecké a pedagogické dráze na Masarykově univerzitě v Brně. Byl rovněž spoluautorem dosud nepřekonané a stále užitečné Pedagogické encyklopedie.","name":"Ferdinand","title":"středoškolský a vysokoškolský pedagog, filolog, filosof, psycholog","birth":"7. května 1885 Brno-Obřany","died":" 14. prosince 1944 Brno-Obřany"},{"state":0,"id":"id_s92","surname":"Kratochvíl","text":"Po maturitě na SGO v roce 1901 a pražských studiích lékařství byl sekundářem v porodnici Zemské nemocnice v Olomouci. Po krátkém pobytu na frontě působil většinu válečných let jako chirurg olomoucké vojenské nemocnice. Zbytek života prožil v Přerově, kde byl v letech 1918 - 1952 renomovaným gynekologem. Ve zvláštní úctě měl své rodiště Náměšť na Hané, kterému věnoval v roce 1925 sborník Na paměť sjezdu rodáků. V roce 1936 vydal nákladem vlastním publikaci Čtyřicet let župy Ústřední jednoty českých lékařů. Zapsal rovněž celou řadu pověstí. Jeho fejetony Na toulkách kolem Středozemního moře vycházely na pokračování v olomouckém Pozoru (šifra DRIK). Publikoval i odborně v Časopise lékařů českých.","name":"Josef","title":"lékař, fejetonista, sběratel pověstí","birth":"22. listopadu 1881 Náměšť na Hané","died":"16. prosince 1962 Přerov"},{"state":0,"id":"id_s93","surname":"Krč","text":"Po maturitě na SGO studoval od roku 1950 LF UP. Od roku 1960 působil na II. Interní klinice (od roku 1990 docent, 1991 universitní profesor) Fakultní nemocnice Olomouc. Od roku 1991 byl přednostou této kliniky. Souběžně přednášel v letech 1962-1990 internu studujícím medicíny na LF UP. Je autorem skript pro VI. Ročník studia lékařství. Od roku 1972 se aktivně podílel na výzkumu Mezinárodní společnosti pro chemo a imunoterapii IGCI ve Vídni. Napsal 160 vědeckých prací v oboru hematologie a onkologie (z toho 40 bylo publikováno v zahraničí).","name":"Ivo","title":"universitní profesor, lékař","birth":"24. dubna 1932 Olomouc","died":"15. srpna 2016 Olomouc"},{"state":0,"id":"id_s94","surname":"Kubis","text":"Po maturitě na SGO studoval nejdříve bohosloví, ale brzy odešel na FF pražské univerzity. Byl profesorem reálky v Moravské Ostravě. V letech 1906 - 1936 byl tajemníkem Národní jednoty pro východní Moravu se sídlem v Olomouci. Hojně publikoval v tisku (Čas, Pozor, Našinec, Nový život, Studentské listy…). V letech 1927 byl členem městského zastupitelstva v Olomouci. V týmu primátora JUDr. Richarda Fischera se spolupodílel na vytvoření plánu Velké Olomouce a podporoval prof. Antonína Šprince při založení české olomoucké městské knihovny.","name":"Adolf","title":"učitel, novinář, spisovatel","birth":"18. května 1876 Brušperk","died":"25. srpna 1958 Olomouc"},{"state":0,"id":"id_s95","surname":"Kučera","text":" Po maturitě na SGO v roce 1937 studoval medicínu na LF MU v Brně, na níž promoval v roce 1946. Poté působil na chirurgické klinice věhlasného profesora MUDr. Rapanta. Od roku 1948 se věnoval na LF UP urologii. Je zakladatelem olomoucké urologické školy a prvním přednostou urologické kliniky FNO. Byl rovněž hlavním odborníkem pro urologii na Ministerstvu zdravotnictví ČSR.","name":"Jan","title":"lékař, vysokoškolský pedagog","birth":"7. listopadu 1918 Olomouc","died":"22. listopadu 2004"},{"state":0,"id":"id_s96","surname":"Kühndel","text":"Maturoval na SGO v roce 1908. Po studiích na Učitelském ústavu v Příboře učil v Prostějově. Po promoci na Masarykově univerzitě v Brně se v roce 1930 stal správcem a posléze ředitelem Městského archívu a muzea v Prostějově, kde působil do roku 1950. Byl odborníkem na hospodářské dějiny a vývoj výtvarného umění na Moravě. Je autorem řady cenných monografií, např. o vývoji cechů, obchodu a pivovarnictví na Moravě a ve Slezsku; o význačných stavbách města Prostějova. Byl velkým propagátorem mánesovské a wolkrovské tradice v Prostějově. Napsal biografii významného filozofa a prostějovského rodáka Edmunda Husserla. Ve svém rodišti byl nápomocen vybudování Loštického muzea.","name":"Jan","title":"pedagog, archivář, muzejník","birth":"29. září 1889 v Loštice","died":"4. února 1970 Prostějov"},{"state":0,"id":"id_s97","surname":"Kvapil","text":"Po maturitě na SGO v roce 1905 studoval Přírodovědeckou fakultu Karlo-Ferdinandovy univerzity v Praze, kde roku 1911 dosáhl středoškolské aprobace pro matematiku a fyziku. Od roku 1921 působil na olomoucké České reálce (s výjimkou let okupace od 1. 4. 1941 - 1945) jako oblíbený profesor, vyučující tyto „obávané předměty“.","name":"Alois","title":"středoškolský profesor ","birth":"21. ledna 1886 Senice na Hané","died":"7. července 1947 Olomouc"},{"state":0,"id":"id_s98","surname":"Letfus","text":"Vyrůstal v rodině hudebního pedagoga Adolfa Letfuse. Po maturitě na SGO v roce 1919 odešel na konzervatoř do Prahy, kde studoval i hudební vědu na FF UK. V letech 1919 - 1921 byl žákem J. B. Foerstera. Od roku 1931 hrál v jazzovém duu s E. Schulhoffem i v Čs. rozhlase. Hodně koncertoval v Belgii a Holandsku. Po roce 1945 založil vlastní rytmickou skupinu, která doprovázela každodenní živé vysílání ranního tělocviku. Složil několik klavírních symfonických a komorních skladeb, mj. i symfonickou bázeň Divoženka podle libreta Františka Kožíka, jejíž rozhlasová premiéra byla 22. 4. 1942.","name":"Oldřich","title":"klavírista a hudební skladatel","birth":"28. srpna 1900 na Svatém Kopečku","died":"2. února 1959 Krompachy"},{"state":0,"id":"id_s99","surname":"Lipčík","text":"Maturoval na SGO v roce 1936. Po vysokoškolských studiích působil v letech 1946 - 1951 na neurologické klinice Fakultní nemocnice v Olomouci a svůj obor přednášel rovněž medikům na LF UP. Poté odešel na Slovensko. Je spoluzakladatelem špičkového neurologického pracoviště a katedry neurologie na Komenského univerzitě v Bratislavě.","name":"Antonín","title":"lékař, vysokoškolský pedagog","birth":"7. října 1917 Olomouc","died":"4. listopadu 1984 Bratislava"},{"state":0,"id":"id_s100","surname":"Lochman","text":"Absolvoval SGO v roce 1934. Po pražských studiích práv se věnoval advokátní praxi v Jablonci nad Nisou. Byl činný i literárně. Svůj nejznámější román „Třetí den rozhodl“ vydal v roce 1944.","name":"Antonín","title":"tajemník soudu, prozaik","birth":"27. října 1915 Olomouc","died":"20. dubna 1947 Jablonec nad Nisou"},{"state":1,"id":"id_s101","surname":"Losenický","text":"Byl od mládí velmi aktivní v Sokole. Po absolvování reálky ve svém rodišti vystudoval v letech 1927 - 1932 matematiku a tělesnou výchovu na UK v Praze. Od roku 1930 byl zástupcem mezinárodního letního tábora YMCA na Sázavě. Podílel se na založení basketbalového oddílu v Přerově (1936). Následně učil několik let na gymnáziu v Příboře, odkud byl po záboru pohraničí v roce 1939 přeložen na Slovanské gymnázium Olomouc, kde byl profesorem matematiky a tělesné výchovy a zejména coby oblíbený „Losenda“ organizátorem dobrovolných sportovních studentských aktivit. Působil i jako vysokoškolský lektor na UP.","name":"Zbyněk","title":"středoškolský profesor, sportovní činitel","birth":"23. ledna 1909 Rakovník","died":"10. října 1971 Olomouc"},{"state":0,"id":"id_s102","surname":"Loudová","text":"Maturovala na SGO v roce 1946. Po absolvování FF UP působila v Krnově, v letech 1953-1958 ve Státní vědecké knihovně v Olomouci a poté ve Výzkumném ústavu zelinářském. Působila na UP a vytvořila Bibliografii vědecké publikační činnosti učitelů UP v Olomouci v letech 1946-1956. Manželka heraldika Jiřího Loudy.","maiden":"Šustrová","name":"Jaroslava","title":"překladatelka a bibliografka","birth":"8. května 1927 Olomouc","died":""},{"state":0,"id":"id_s103","surname":"Lužný","text":"Po absolvování SGO v roce 1889 studoval v Olomouci bohosloví (vysvěcen1893). Působil v Opavě-Kateřinkách, kde spolupracoval s etnografem a národopisným spisovatelem Janem Vyhlídalem, a v letech 1920-1935 v Litultovicích. Literární zájmy ho v roce 1916 přivedly do Družiny literární a umělecké. Psal drobnou prózu, hanácké črty, překládal z francouzštiny a publikoval v Našinci.","name":"Augustin","title":"duchovní, prozaik, překladatel","birth":"2. srpna 1867 Unčovice","died":"21. prosince 1938 Litultovice"},{"state":0,"id":"id_s104","surname":"Macura","text":"Na Slovanském gymnáziu maturoval v roce 1943. Již při vysokoškolském studiu se specializoval na mikrobiologii. Působil v Praze v Mikrobiologickém ústavu ČSAV jako vedoucí oddělení půdní mikrobiologie. Je autorem zásadní učebnice tohoto oboru Půdní mikroorganismy a rostliny.","name":"Jiří","title":"mikrobiolog","birth":"3. října 1923 Olomouci","died":"1. listopadu 1977 Praha "},{"state":0,"id":"id_s105","surname":"Machát","text":"Náležel v první polovině 20. století k předním českým geografům. Po maturitě na SGO studoval v letech 1895 - 1900 na pražské Karlo-Ferdinandově univerzitě dějepis a zeměpis. Dobrovolně ale navštěvoval i přednášky z filozofie, českého jazyka a literatury, z estetiky, z německé literatury, pedagogiky i psychologie. Jako středoškolský pedagog vyučoval v Praze (1900 - 1901), na reálce v Náchodě (1901 - 1906), následně opět na několika gymnáziích v Praze a od roku 1917 až do své náhlé smrti v roce 1935 byl ředitelem Městského čs. dívčího reálného gymnázia Elišky Krásnohorské v Lazarské ulici v Praze 2. Současně byl od roku 1922 lektorem metodiky geografie na Univerzitě Karlově a členem komise pro stanovení úředních názvů míst Československé republiky.Zeměpisu a jeho vyučování zasvětil celý svůj tvůrčí vědecký život, hojně publikoval a odborné poznatky popularizoval. Do historie metodiky zeměpisu a školské kartografie se natrvalo vepsal jako úspěšný redaktor a spoluautor grandiózní dvoudílné publikace Ilustrovaný zeměpis všech dílů světa. Byl autorem návrhu moderních osnov pro československé střední školy (1925). Své názory na vyučování zeměpisu uplatňoval i jako autor učebnic pro české měšťanské a střední školy. Pro Ottův naučný slovník, který vycházel v sešitovém vydání, zpracoval plnou polovinu map z celkového počtu 44. Po skončení První světové války přepracoval český školní atlas. Následující série zeměpisných atlasů, vzniklá v Machátově spolupráci s předními československými vojenskými kartografy M. Semíkem a Františkem Leixnerem, patří k předním uznávaným světovým dílům. Vydal Malý atlas Československé republiky (1921), Atlas pro školy obecné (1923), Zeměpisný atlas pro školy obchodní a společně s Kamilou Spalovou Vlastivědný atlas pro školy národní. Pro Atlas republiky Československé zpracoval hypsometrickou a politickou mapu. Podílel se i na tvorbě a redakci Nástěnné mapy Československé republiky (1920) atd.","name":"František","title":"kartograf, středoškolský profesor","birth":"25. prosince 1876 Horka nad Moravou","died":"22. dubna 1935 Praha"},{"state":0,"id":"id_s106","surname":"Martinčík","text":"Studoval Slovanské gymnázium, avšak materiální problémy rodiny ho donutily přejít do tiskárny Kramář a Procházka, kde začal pracovat jako korektor. Hojně psal do novin a časopisů. Byl autorem odborných tiskařských publikací. Sbíral lidové pověsti, jimiž přispěl do sbírky uspořádané Josefem Koudelákem Pověsti z kraje básníka F. S. Procházky, sv. 1. ","name":"Richard","title":"typograf, bibliofil, sběratel lidových pověstí","birth":" 7. května 1875 Senička","died":"21. prosince 1959 Přerov"},{"state":2,"id":"id_s107","surname":"Minařík","text":"Po maturitě na SGO v roce 1876 studoval na univerzitě ve Vídni. Po celou svoji 45 let trvající aktivní pedagogickou dráhu učil matematice a fyzice (česky i německy). V letech 1881 -1889 na gymnáziu v Přerově, následně rok na Německém gymnáziu v Kroměříži a v letech 1891 - 1926 na „svém“ Slovanském gymnáziu Olomouc. Byl nadšeným popularizátorem astronomie, členem Société astronomique de Francé. V letech 1892 - 1908 byl revizorem olomouckého vlasteneckého spolku Žerotín.","name":"Karel","title":"gymnaziální profesor, popularizátor astronomie","birth":"20. září 1886 Přerov","died":"9. června 1935 Olomouc"},{"state":0,"id":"id_s108","surname":"Mohapl","text":"V roce 1951 odmaturoval na SGO. Poté studoval na FF UP obor filozofie a historie a v dalším roce připojil ještě studium psychologie. První zaměstnání nastoupil v roce 1956 v Psychiatrické léčebně ve Šternberku, kde působil jako klinický psycholog do roku 1962, kdy se vrátil na Katedru psychologie FF UP jako interní aspirant. Souběžně studoval na LF UP a připravoval se na dráhu učitele klinických oborů zaváděného studia odborné psychologie. Studium LF a kandidaturu věd ukončil v roce 1967. Od té doby působil na Katedře psychologie FFUP. V odborné a vědecké práci se soustředil na otázky psychologie, psychosomatiky a prolínání psychologie a medicíny. Je autorem téměř 50 vědeckých prací, monografií a vysokoškolských skript. Po roce 1989 členem a místopředsedou Akademického senátu UP a vedoucí Katedry psychologie FFUP. ","name":"Přemysl","title":"vysokoškolský pedagog, psycholog a psychiatr","birth":" 8. května 1932 Olomouc","died":"5. března 1997 Olomouc "},{"state":0,"id":"id_s109","surname":"Musil","text":"Odmaturoval na SGO v roce 1958. Vystudoval obor klinická psychologie na UK v Praze a na ILF specializaci psychoterapie a diagnostika. Působil jako klinický psycholog mj. ve VN Plzeň, PL Opava, NsP Bruntál a Nový Jičín. Vedl Krajskou psychologickou laboratoř a je soudním znalcem v oboru psychologie. Přednášel na UP Olomouc, TU Trnava a UTB Zlín. Po celou dobu své praxe hojně publikoval v odborném tisku, absolvoval stáže, příp. přednášel na univerzitách v SRN, Belgii, Itálii, Rakousku, v Nizozemí a Irsku. Je členem oborových rad univerzit v Trnavě a v Bratislavě. Na CIC v Římě ustanoven jako Professor Ordinárius v oboru sociální psychologie. Ve dvou funkčních obdobích byl předsedou VSMO. Ve svých aktivitách (přednášky, symposia, publikace) dával prostor osobnostem v minulém režimu umlčovaným a perzekvovaným, např. dr. Cyrilu Stejskalovi","name":"Jiří","title":"psycholog, univerzitní profesor","birth":"26. listopadu 1941 Olomouc","died":""},{"state":0,"id":"id_s110","surname":"Navrátil","text":"Po maturitě na SGO v roce 1911 vystudoval ekonomii a věnoval se práci redaktora. Působil v národohospodářské sekci Národní politiky, přispíval i do časopisu Pozor, Selské listy a do regionálního tisku v jižních Čechách. Psal pod pseudonymem Láďa Náklov.","name":"Ladislav","title":"redaktor, spisovatel, národohospodářský odborník","birth":"27. června 1892 Náklo","died":"14. prosince 1980 Jindřichův Hradec"},{"state":1,"id":"id_s111","surname":"Navrátil","text":"Po gymnazijních studiích v Kroměříži se věnoval studiu hudební vědy na KFU Praha. Na Slovanském gymnáziu působil v letech 1874 - 1884 a 1887 - 1906 (v mezidobí na gymnáziu Val. Meziříčí). Během téměř třiceti let působení v Olomouci se zasloužil o rozvoj sborového zpěvu, pořádal studentské akademie. Zasloužil se o založení Pěveckého sdružení Žerotín  a v letech 1884 - 1889 byl jeho sbormistrem. Založil i Ženský pěvecký sbor Žerotína. V roce 1906 přijal místo ředitele na Gymnáziu Františka Palackého ve Valašském Meziříčí, které zastával až do svého penzionování v roce 1913. Je rovněž autorem metodických materiálů pro výuku sborového zpěvu.","name":"Viktor","title":"hudební pedagog, gymnaziální profesor","birth":"24. února 1852 Chropyně","died":"5. listopadu 1927 Valašské Meziříčí"},{"state":1,"id":"id_s112","surname":"Nekula","text":"Po maturitě na SGO v roce 1956 studoval LF UP. Od roku 1972 působil na Ústavu pro výzkum vyšší nervové činnosti a posléze ve Fakultní nemocnici Olomouc jako radiolog. V roce 1990 se stal přednostou Kliniky radiologie LF UP. Ve své oboru hojně publikoval a radiologii přednášel i studentům medicíny UP.","name":"Josef","title":"lékař, radiolog, vysokoškolský pedagog","birth":"19. listopadu 1939 Olomouc","died":""},{"state":0,"id":"id_s113","surname":"Nelešovská","text":"Po maturitě na SGO v roce 1969 vystudovala učitelství na PdF UP (1973). Dlouhá léta vede katedru primární pedagogiky PdF UP. Vyučuje pedagogickou komunikaci, didaktiku, didaktické praktikum diplomový a pedagogický seminář. Odborně a vědecky je zaměřena na koncepci vzdělávání učitelů, uplatnění absolventů v oboru národnostní menšiny a hodnotovou orientaci. Spolupracuje s řadou pedagogických nakladatelství a s nakladatelstvím GRADA. Je autorkou monografií, řady vědeckých, odborných a popularizačních studií, učebních textů i metodických materiálů pro primární a mateřské školství.","name":"Alena","title":"vysokoškolská pedagožka","birth":"16. září 1950 Olomouc","died":""},{"state":0,"id":"id_s114","surname":"Neoral","text":"Maturoval na Slovanském gymnáziu roku 1946. V prosinci 1989 byl jednomyslně zvolen děkanem Lékařské fakulty UP (tuto funkci vykonával po dvě funkční období do roku 1994). Byl přednostou Ústavu soudního lékařství a medicínského práva, členem vědecké rady LF UP a PF UP, dlouholetým vědeckým sekretářem a předsedou České lékařské společnosti JEP, členem předsednictva Společnosti pro klinickou medicínu při AV ČR, od roku 1988 působil po tři volební období jako viceprezident International  Academy of Legal Medicine and Social Medicine, viceprezident World Association for Medical Law a člen sboru guvernérů WAML. Svým čestným členem ho zvolila Soudně lékařská společnost Polské republiky, Belgická vědecká společnost, Soudně lékařská společnost Maďarské republiky a Společnost soudního lékařství SRN a další zahraniční vědecké společnosti. Pracoval v redakčních radách časopisů Čs. patologie a soudní lékařství a časopisu Rechtsmedizin, byl předsedou olomoucké pobočky Masarykovy společnosti a starostou olomoucké Smrčkovy župy Sokolské. Jako člen vědecké rady UP a kolegia rektora UP prosazoval vznik právnické fakulty UP v Olomouci. Byl autorem téměř 150 vědeckých prací, monografií a učebnic. Byl vynikajícím učitelem, skromným a charakterním mužem, který vnímal své absolutorium Slovanského gymnázia jako velkou hodnotu svého života","name":"Lubomír","title":"univerzitní profesor, činovník Sokola","birth":"31. října 1927 Olomouc","died":"25. března 2000 Olomouc"},{"state":0,"id":"id_s115","surname":"Neubauer","text":"Po maturitě na SGO v roce 1919 vystudoval práva, která téměř po celý život přednášel na MU v Brně a na UK v Praze. Specializoval se na ústavní a správní právo, byl uznávaným odborníkem v právní filosofii.","name":"Zdeněk","title":"právník, filosof a vysokoškolský učitel","birth":"2. srpna 1901 v Plzeň","died":"20. února 1956 Praha"},{"state":0,"id":"id_s116","surname":"Novák","text":"Maturoval na SGO v roce 1952 a ještě v srpnu téhož roku byl jmenován varhaníkem a sbormistrem v hodolanském kostele Panny Marie. Posledních deset let řídil smíšený pěvecký sbor Dvořák v Olomouci.","name":"Eduard","title":"varhaník a sbormistr","birth":"28. února 1932 Olomouc","died":"1. listopadu 2002 Olomouc"},{"state":0,"id":"id_s117","surname":"Ondrúšek","text":"Po studiu primy až kvarty na Slovanském gymnáziu rozvíjel svůj talent na Akademii výtvarných umění v Praze. Společně s Luďkem Marodem, Alfonsem Muchou, Jožou Úprkou a dalšími založili umělecký spolek Škréta a vydávali umělecký časopis. Absolvoval studijní cesty do Vídně, Benátek, Paříže, Bretaně a Mnichova, kde byl vyhledávaným portrétistou. V roce 1920 se vrátil do svého rodného města. V tomto období vytvořil kolem 550 obrazů, mj. portréty spisovatele Františka Táborského, arcibiskupa Leopolda Prečana, presidenta T. G. Masaryka, francouzského historika a průkopníka česko-francouzských vztahů Williama F. M. Rittera, architekta Bohumíra Jaroňka, básníka a spisovatele Josefa Kaluse, olomouckého nakladatele Romualda Prombergera a hudebního skladatele Leoše Janáčka, s nímž se spřátelil. V posledních letech svého života se věnoval národopisným studiím z Valašska a ze Slovácka. Pozoruhodná je jeho kolekce rázovitých postav žijících v okolí Sv. Hostýna a litografie a tempery obyvatel Rusavy a Kloboucka.","name":"František","title":"akademický malíř","birth":"4. března 1861 Bystřice pod Hostýnem","died":"3. dubna 1932 Bystřice pod Hostýnem"},{"state":0,"id":"id_s118","surname":"Ošťádal","text":"Po maturitě na SGO v roce 1883 studoval v Praze práva. Po promoci se od roku 1895 usadil natrvalo v Olomouci. Od studentských let se horlivě zúčastňoval národního a politického života. Byl mimořádně aktivní v Sokole, v roce 1892 spoluzakládal Politický spolek pro severní Moravu, od roku 1903 byl starostou Národní jednoty a od roku 1909 předsedal Matici školské (od roku 1912 byl předsedou Ústřední záložny rolnické se sídlem v Olomouci. V letech 1907 - 1914 byl prvním předsedou České okresní školské rady v Olomouci. Významně se zasloužil o zřízené Matiční české reálky a Dívčího reformního reálného gymnázia v Olomouci. Po vzniku ČSR byl zvolen do správní komise města Olomouce a do České obchodní komory.","name":"Jan","title":"advokát, starosta Národní jednoty a Matice školské v Olomouci","birth":"23. října 1864 Věrovany","died":"4. ledna 1927 Olomouc"},{"state":0,"id":"id_s119","surname":"Ošťádal","text":"Vystudoval SGO v letech 1887 - 1895 a poté v Praze obory zeměpis a dějepis. Veškerý volný čas věnoval své velké zálibě - hudbě. V letech 1900 - 1903 působil na Slovanském gymnáziu Olomouc, pak 6 let na gymnáziu ve Strážnici a od roku 1909 byl profesorem olomoucké České reálky. Byl pravidelným přispěvatelem hudební rubriky časopisu Pozor. V Olomouci má mimořádné zásluhy o rozvoj hudebního života města.","name":"Libor","title":"středoškolský pedagog, skladatel","birth":"2. března 1875 Odrlice","died":"20. srpna 1912 Olomouc"},{"state":0,"id":"id_s120","surname":"Otruba","text":"Slovanské gymnázium, na němž Josef Otruba maturoval v roce 1909, výrazně ovlivnilo jeho životní dráhu. Setkal se zde s vynikajícími botaniky prof. Františkem Polívkou a dr. Josefem Podpěrou. Skromné poměry Otrubovy rodiny Josefa donutily hned po maturitě nastoupit dráhu poštovního úředníka na Hlavní poště v Olomouci. Veškerý svůj volný čas však věnoval botanickému výzkumu Moravy. Za první světové války byl odvelen na východní frontu, kde se věnoval studiu mochen Pinských bažin. Následně se vypracoval na nejlepšího znalce rodu Potentilla v meziválečném Československu. Jako mimořádný posluchač vystudoval v prvních poválečných letech Masarykovu univerzitu v Brně. Botanika zůstala jeho celoživotním koníčkem (ve své profesi se vypracoval až na odpovědné místo poštovního ředitele, které zastával až do svého penzionování v roce 1942). Permanentně botanizoval a výsledky svých výzkumů publikoval v Časopisu Vlasteneckého spolku muzejního v Olomouci, v Časopisu Moravského muzea v Brně, ve Vlastivědném sborníku střední a severní Moravy, Věstníku Klubu přírodovědců v Prostějově, v časopisu československých houbařů, v periodikách Příroda, Vesmír, Živa a v dalších odborných a regionálních sbornících. Soupis jeho vědeckých prací a článků, zveřejněný akademikem Josefem Podpěrou u příležitosti šedesátin Josefa Otruby, čítá 450 položek. Knižně vydal dva díly Úvodu ke květeně československého Slezska a v roce 1930 Květenu Štramberka. V letech 1921 - 1939 se věnoval osvětové a přednáškové činnosti pro učitele, osvětové sbory, přírodovědné kluby i pro profesní uskupení houbařů, lékárníků, lékařů a dalších zájemců. Od roku 1922 až do své smrti byl ředitelem olomoucké Botanické zahrady. Od roku 1934 byl redaktorem přírodovědného oddílu Časopisu Vlasteneckého spolku muzejního. Po smrti významného olomouckého botanika Jindřicha Lause (1941) působil na částečný úvazek jako kustod přírodovědného muzea v Olomouci a od svého penzionování v roce 1942 se této činnosti věnoval naplno. Byl rovněž konzervátorem ochrany přírody, kdy pečoval o četné rezervace s přirozenými porosty a vzácnou květenou na Olomoucku. V botanické zahradě se podílel na mezinárodní výměně semen s renomovanými botanickými zahradami. ","name":"Josef","title":"botanik","birth":"10. března 1889 Terezském údolí u Náměště na Hané","died":"28. listopadu 1952 Olomouc"},{"state":0,"id":"id_s121","surname":"Palkovský","text":"Po maturitě na SGO v roce 1878 a studiu práv v Praze začal advokátní praxi v Brně a následně v Hranicích na Moravě. V roce 1890 zahájil činnost první samostatné české advokátní kanceláře v Moravské Ostravě, kde hájil české národní zájmy politické, kulturní spolku Moravský klub (v letech 1903 - 1907 byl jeho předsedou). Spoluzakládal a byl prvním starostou Sokola v Moravské Ostravě (1891), jako předseda ostravské pobočky Ústřední matice školské se zasazoval o zřízení prvního českého gymnázia a dalších českých škol. Podporoval i české divadelní aktivity, byl zakladatelem spolku pro Národní dům a dlouholetým funkcionářem Matice ostravské (v letech 1901 - 1920 byl jejím starostou).","name":"Edmund","title":"právník, regionální politik","birth":"17. října 1858 Brušperk u Frýdku-Místku","died":"7. dubna 1930 Ostrava"},{"state":0,"id":"id_s122","surname":"Panoš","text":"Maturoval na SGO v roce 1940. Společně se svými spolužáky Vláďou Nechybou, Mojmírem Smejkalem, Karlem Balašem, Václavem Janečkem, Milanem Schmalzem, Arnoštem Zatloukalem, Rudou Gažarem, Sašou Dačenkem a dalšími založili na Slovanském gymnáziu první olomouckou swingovou kapelu, která byla mimořádně úspěšná. Perlami jejich repertoáru byly skladby Duke Ellingtona Solitute, Caravan, Moon Indigo a dal. Tehdy téměř nedostupný notový materiál jim „pašovala“ z Prahy sestra Mojmíra Smejkala, která byla v té době slavnou filmovou herečkou (mj. hrála princeznu ve filmu Krakatit), hrající pod uměleckým jménem Florence Marly.","name":"František","title":"klavírista, spoluzakladatel swingové skupiny „Cholera boys“","birth":"12. července 1921 Olomouc","died":"14. srpna 1959 Olomouc"},{"state":0,"id":"id_s123","surname":"Pazdera","text":"Po maturitě na SGO v roce 1959 vystudoval na Lékařské fakultě UP stomatologii. Jeho prvním působištěm byla poliklinika v Hranicích na Moravě, od roku 1969 Klinika ústní, čelistní a obličejové chirurgie LF UP, kterou od roku 1990 řídil. Pod jeho vedením si svými úspěchy a vědecko-výzkumnou činností klinika vybudovala věhlas doma i v zahraničí. MUDr. Pazdera se ve výzkumu se svým týmem mj. zabýval rekonstrukcí kostních defektů po operacích čelistních cyst a výchovou lékařů v oboru ústní, čelistní a obličejové chirurgie. V devadesátých letech působil v akademické funkci proděkana lékařské fakulty UP.","name":"Jindřich","title":"univerzitní profesor, stomatolog","birth":"5. ledna 1942 Příbram","died":""},{"state":0,"id":"id_s124","surname":"Pazdírek","text":"Studoval na Slovanském gymnáziu v letech 1897 - 1905. Následné se věnoval vojenské službě z povolání a v roce 1919 se v Brně ujal řízení rodinného nakladatelství. Vydával zejména tvorbu moravských hudebních skladatelů, spisy didaktické a pedagogické. Vydával i periodika Hudební rozhledy, Hudební besídka či Hudební národ. ","name":"Oldřich","title":"hudební nakladatel","birth":"18. prosince 1887 Horní Moštěnice-Olomouci","died":"3. srpna 1944 Brno"},{"state":1,"id":"id_s125","surname":"Pechoč","text":"Po studiích na Univerzitě Karlově a delším působení na gymnáziu ve slovenské Kremnici byl v letech 1935 - 1938 profesorem Slovanského gymnázia, v jehož přírodovědném kabinetě při experimentování tragicky skonal. Uměl zaujmout svým výkladem, podněcovat posluchače k myšlení. Byl přímý, čestný, měl odvahu být svobodný. Byl autorem na svou dobu velmi kvalitních středoškolských učebnic.","name":"Karel","title":"středoškolský profesor ","birth":"30. prosince 1899 Praha","died":"4. srpna 1938 Olomouc"},{"state":0,"id":"id_s126","surname":"Petzold","text":"Syn ředitele hudební školy a význačného sbormistra Antonína Petzolda (1858-1931), který jej od útlého dětství učil hudbě. Maturoval na SGO v roce 1930. Věnoval se učitelské profesi na menších školách Olomoucka a poté studoval v Brně, kde v roce 1939 vykonal státní zkoušky z hudební výchovy pro střední školy. Plně se mohl věnovat hudbě až po osvobození v roce 1945. Byl učitelem pedagogického oddělení hudební školy v Olomouci, od září 1946 po dobu deseti let působil v Moravské filharmonii jako vedoucí skupiny II. houslí. Jako violista hrál v Komorním sdružení Moravských filharmoniků, založeném v roce 1951 a též v Moravské filharmonii Olomouc. Napsal drobné klavírní skladby, smyčcový kvartet c der a skladby pro mužské a smíšené sbory. ","name":"Jan","title":"hudební pedagog, skladatel","birth":"11. května 1912 Olomouc","died":"16. srpna 1984 Olomouc"},{"state":0,"id":"id_s127","surname":"Pogoda","text":"Vystudoval Slovanské gymnázium, typografickou školu v Praze, dále klavír a dirigování u profesora Františka Preislera na olomoucké konzervatoři. Od roku 1965 byl členem Amatérského studia při olomouckém Divadle Oldřicha Stibora a spolu s Pavlem Dostálem výraznou autorskou a hereckou dvojicí (zde vystupoval např. s Janem Kanyzou či Hanou Maciuchovou). V letech 1966-1967 působil společně s Pavlem Dostálem v legendárním DEX-klubu (zde začali svoji kariéru Karel Kryl, Jaroslav Hutka či Hana Ulrychová). V době normalizace se živil jako diskžokej, s Emilem Viklickým psal jazzové pořady pro Divadlo hudby, hrál na klavír v kapele Falešní hráči s Karlem Plíhalem. Přátelil se s Miroslavem Horníčkem - zkomponoval hudbu k jeho hře Tvrďák a od konce 80. let se stal doprovodným pianistou a jevištním kolegou v představení Hovory H o V+W. S Pavlem Dostálem upravili Horníčkovu hru Dva na smetišti. Je spoluautorem deseti muzikálů, ze kterých jsou dodnes hrané např. Případ Grendwall, Výtečníci, Gaudeamus Igitur, Princ a chuďas, též autorem řady písní na texty Lubomíra Feldeka, Aloise Mikulky, Jiřího Žáčka. Od začátku své umělecké kariéry se věnuje pořadům pro mládež, uváděl např. koncerty Moravské filharmonie pro mládež. Spolupracoval s Českým rozhlasem Ostrava a Brno a v devadesátých letech se stal na krátkou dobu kmenovým hudebním redaktorem Českého rozhlasu Olomouc. Od roku 1997 až do roku 2013 vysílal v olomouckém rozhlase své Jazzoviny.","name":"Richard","title":"hudební skladatel a interpret, rozhlasový redaktor","birth":"16. srpna 1944 Olomouc","died":""},{"state":2,"id":"id_s128","surname":"Podivínský","text":"Po maturitě na SGO v roce 1897 a studiích na Filosofické fakultě Karlo-Ferdinandovy univerzity v Praze učil českému jazyku, latině a řečtině zpočátku v Zábřehu na Moravě, posléze v Uherském Hradišti a v letech 1913-1931 na Slovanském gymnáziu Olomouc, kde v letech 1925-1926 byl správcem ústavu. Souběžně vyučoval latinu i na České reálce v Olomouci. V roce 1931 byl jmenován ředitelem státního čsl. reálného gymnázia (dnes Gymnázia Jakuba Škody) v Přerově, které řídil až do svého penzionování v roce 1938. ","name":"Stanislav","title":"středoškolský profesor, významný filolog","birth":"8. května 1877 Biskupství","died":"16. dubna 1947 Olomouc"},{"state":1,"id":"id_s129","surname":"Podpěra","text":"Během svého působení na Slovanském gymnáziu v letech 1904 - 1908 publikoval v odborných časopisech 72 příspěvků. V roce 1908 mu byla nabídnuta možnost přejít do Brna, které bylo centrem tehdejšího vědeckého a kulturního snažení. Podpěra tam učil na II. České reálce. Intenzivně pracoval v Přírodovědeckém klubu, jehož činnost od roku 1911 zásadně ovlivňoval svojí aktivitou a organizačními schopnostmi jako předseda. Za 1. světové války byl v roce 1915 na ruské frontě u Przemyšlu zajat. Válečná strádání Podpěra proměnil v nesmírně plodné období svého života. V krátké době se naučil rusky. Pro místní odborníky představoval jediný kontakt s kulturním světem. Z vděčnosti mu umožnili prostudovat v přírodovědeckém oddělení muzea v Ufě a později i na univerzitě v Tomsku dokladový materiál z lokalit pro Středoevropana jinak nedostupných. V době zuřící občanské války jako čs. legionář studoval květenu Uralu, jihoruských a středoasijských stepí, botanizoval v sibiřských pohořích i v tajze. S Čs. legiemi se vrátil přes Vladivostok a Panamu v roce 1920 lodí domů. Vzápětí byl jmenován řádným profesorem botaniky Masarykovy university v Brně. Nadšeně organizoval výměnu rostlin s botanickými zahradami celého světa. Pro ústavní herbáře tak získal unikátní sbírku se 400 000 položkami! Zkompletoval rozsáhlou knihovnu s 15 000 svazky odborné literatury. Se svými spolupracovníky vybudoval v Brně z bramborového pole současnou univerzitní botanickou zahradu. Napsal na 300 vědeckých pojednání o geografickém rozšíření rostlin, vedl stovky botanických exkurzí, o výsledcích své vědecké práce přednášel na botanických kongresech v Rumunsku, Švédsku, Anglii, Francii, Holandsku, Bulharsku a v Rusku. Byl poctěn čestným členstvím v řadě botanických společností, mj. i v Societas pro fauna et flora Finnica v Helsinkách. Napsal dílo Květena Moravy ve vztazích systematických a geobotanických, monografii Conspectus muscorum europaeorum(vypracoval se na světově uznávaného odborníka v bryologii), široké veřejnosti věnoval populární Klíč k určování výtrusných rostlin. Ve dvou funkčních obdobích byl děkanem Přírodovědecké fakulty Masarykovy univerzity. V jejím čele stanul v roce 1937 jako rektor. Po válce byl zakládajícím členem Čs. akademie věd.","name":"Josef","title":"botanik, pedagog, rektor MU, akademik ČSAV","birth":"7. ledna 1878 Jílové u Prahy","died":"18. ledna 1954 Brno"},{"state":1,"id":"id_s130","surname":"Polešovský","text":"Působil na Slovanském gymnáziu v letech 1912 - 1917. Byl nadšeným botanikem; v publikační činnosti se svou knihou Rostliny masožravé (1916) řadí k renomovaným botanikům prof. Polívkovi a prof. Podpěrovi. Hojně publikoval i v časopisu VSMO. V olomouckém školství má své čestné místo i jako první ředitel Českého učitelského ústavu, který řídil až do roku 1935.","name":"Albín","title":"středoškolský pedagog, botanik, ředitel Českého učitelského ústavu","birth":"1. března 1879 Žeravice","died":"23. října 1941 Olomouc"},{"state":1,"id":"id_s131","surname":"Polívka","text":"Po maturitě na gymnáziu v Hradci Králové a vysokoškolských studiích na Univerzitě Karlově v Praze, působil v letech 1866 - 1902 na Slovanském gymnáziu Olomouc jako profesor přírodopisu, matematiky a fyziky. Od roku 1902 byl prvním ředitelem nově zřízené České reálky v Olomouci. Současně byl až do roku 1913 školním inspektorem pro české školy na Olomoucku. Již za studií v Praze vydal v roce 1883 Etymologický slovník latinského názvosloví přírodopisného. V roce 1885 vydal příručku Pod mikroskopem a ve výroční zprávě Slovanského gymnázia za rok 1890/91 publikoval příspěvek Cizopasné rostliny jevnosnubné. V následujících letech plodně spolupracoval s  vydavatelem Romualdem Promberberem. I při tehdejších skromných polygrafických možnostech vznikly velmi hodnotné, celostátně užívané učebnice Rostlinopis (1896) a Živočichopis (1897), které vyšly do roku 1947 v 16 reedicích. Vrcholem Polívkova tvůrčího úsilí je unikátní čtyřdílná Názorná květena zemí koruny české (1899 - 1903), dílo dodnes uznávané i v zahraničí, které obsahuje přes 300 původních vyobrazení. V roce 1912 vydal Klíč k úplné květeně zemí koruny české a Atlas k rostlinopisnému klíči. Mimořádně hodnotné jsou i jeho Užitkové a pamětihodné rostliny cizích zemí (1908). Kromě pedagogické a publikační činnosti byl znám jako vzorný vlastenec s velikou zásluhou o zřízení české reálky v Olomouci. Společně se svojí manželkou založil nadaci pro podporu nemajetných studentů.","name":"František","title":"botanik, středoškolský pedagog, zakládající ředitel olomoucké České reálky","birth":"1. srpna 1860 Bříza u Hradce Králové","died":"2. července 1923 Olomouc"},{"state":0,"id":"id_s132","surname":"Pospíšil","text":"Po maturitě na SGO v roce 1946 a studiích brněnské VŠT pracoval ve Stavoprojektu, v Pozemních stavbách a od roku 1971 v Druposu. Realizoval projekty v Uničově, v Horce nad Moravou, v Prostějově aj. Jeho celoživotním zájmem byl jazz. V roce 1955 založil v Olomouci Kroužek přátel jazzové hudby, jehož činnost po řadu desetiletí řídil. Je spoluorganizátorem jazzového festivalu v Přerově a za kulturní zážitky mu vděčí i Olomoučané (organizátor Jazzových dnů).","name":"Ladislav","title":"jazzman, hudební publicista a organizátor","birth":"20. června 1927 Košice","died":""},{"state":0,"id":"id_s133","surname":"Pospíšil","text":"Po absolvování SGO v roce 1918 a studiích práv v Praze se rozhodl pro vlastní právní praxi v Olomouci, kde se mimořádně angažoval v Sokole (byl vzdělavatelem a redaktorem sokolského Věstníku) a ve 30. letech se spolupodílel na formování Hanáckého aeroklubu Olomouc, v němž probíhala intenzívní letecká příprava a sportovní pilotní výcvik mladých mužů, z nichž řada (včetně studentů a absolventů Slovanského gymnázia z 30. let) bojovala na frontách druhé světové války (např. v největším leteckém konfliktu dějin - v Bitvě o Británii). Ve 30. letech byl předsedou správní rady fy Zora. Ihned od března 1939 organizoval protinacistický odboj. Na rodinném statku ve Vojnicích umožnil přežití několika pronásledovaným spoluobčanům. Sám pak byl vězněn v koncentračních táborech. Bohužel se nevyhnul vlastní perzekuci ani po válce. Za dramatických okolností uprchl s rodinou po komunistickém puči do Západního Německa a posléze do USA, kde mj. organizoval československou exilovou inteligenci. ","name":"Leopold st.","title":"právník, redaktor, předseda Hanáckého aeroklubu Olomouc","birth":"21. srpna 1898 Vídeň","died":"13. března 1982 Oregon (USA)) "},{"state":0,"id":"id_s134","surname":"Pospíšil","text":"Emeritní profesor Yaleovy univerzity, právník, antropolog. Narodil se a vyrůstal v Olomouci v rodině známého olomouckého advokáta, který v roce 1939 pomáhal organizovat odchod českých pilotů do Polska. V roce 1942 odmaturoval na Slovanském gymnáziu, po osvobození začal studovat práva na Karlově univerzitě v Praze. Během únorové vládní krize v roce 1948 se účastnil pochodu vysokoškoláků na podporu prezidenta Edvarda Beneše proti přijetí diktátu KSČ. Krátce předtím, než byli povražděni nebo uvězněni jeho přátelé (např. Josef Bryks), se mu podařilo utéct do zahraničí. Z Německa odjel v roce 1949 do USA, kde zpočátku pracoval jako farmář, kovboj, pekař, hrobník či kostelník.  Posléze studoval sociologii a filosofii na univerzitě v Oregonu a poté antropologii na Yale University v New Haven. Zde následně působil jako profesor. Stal se kurátorem antropologického oddělení Peabodyho muzea. Zabýval se kulturami Eskymáků Nunamuit na Aljašce, indiánů Hopi v Arizoně a Kapauků na Nové Guineji. Jeho dlouholeté výzkumy patří k zakladatelským pracím v oboru antropologie práva. V roce 1984 byl Leopold Pospíšil jmenován členem americké National Academy of Sciences. Ve dvou funkčních obdobích zastával post prezidenta kanadsko-americké Společnosti Čechů a Slováků pro vědy a umění, která sdružovala naši vlasteneckou inteligenci v emigraci (v této funkci mj. navrhoval Jaroslava Seiferta na udělení Nobelovy ceny). Působil i jako poradce amerických prezidentů J. F. Kennedyho, G. W. Bushe staršího a B. Clintona pro otázky lidských práv. Od roku 1989 pravidelně vrací se do České republiky a přednáší na Univerzitě Karlově v Praze a Univerzitě Palackého v Olomouci.","name":"Leopold ml.","title":"právník a právní antropolog, univerzitní profesor","birth":"26. dubna 1923 Olomouc","died":""},{"state":0,"id":"id_s135","surname":"Prachařová","text":"Maturovala na SGO v roce 1949. Ačkoli pracovala jako zdravotní laborantka, její zájem o vlastivědu Olomoucka a střední Moravy, v níž mimořádně vynikala, ji přivedl do Vlastivědné společnosti muzejní, v níž pracovala jako tajemnice v letech 1986 - 1998. Perfektně zvládala němčinu (dokonce několik dialektů), svůj organizační talent uplatňovala i při organizování přednášek, besed a exkurzí. ","name":"Evženie","title":"vlastivědná pracovnice","birth":"29. července 1929 Olomouc","died":"30. června 1998 Olomouc"},{"state":1,"id":"id_s136","surname":"Prasek","text":"Po gymnaziálních studiích v Opavě a studiích filologie ve Vídni a ve Vratislavi působil od roku 1868 na Slovanském gymnáziu, kde učil češtinu, latinu, řečtinu a němčinu. Krátce pak působil na gymnáziích v Chrudimi a v Táboře, avšak do Olomouce se vrátil. V letech 1871 - 1883 působil opět na Slovanském gymnáziu a v Olomouci se čile zúčastnil českého společenského života. Byl spoluzakladatelem Matice školské, iniciátorem založení Vlasteneckého spolku muzejního v roce 1883, je autorem názvu tehdy nově vzniklého pěveckého sdružení Žerotín. V letech 1883 - 1895 působil na českém matičním gymnáziu v Opavě, aby se opět vrátil na Slovanské gymnázium, na němž působil dalších 10 let až do svého penzionování v roce 1905. V Opavě byl mimořádně aktivní jako český buditel, vlastivědný pracovník a historik. V roce 1902 založil historický sborník Selský archiv. Na odpočinku žil u své dcery v Napajedlech. V Olomouci i v Opavě jsou k uctění jeho mimořádných zásluh pojmenovány ulice.","name":"Vincenc","title":"gymnaziální profesor, obrozenecký spisovatel","birth":"9. dubna 1843 Milostovice u Opavy","died":"31. prosince 1912 Napajedla"},{"state":0,"id":"id_s137","surname":"Prečan","text":"Ke svému postavení se vypracoval mimořádnou houževnatostí, inteligencí a pílí. Na svůj prostý selský původ byl tak hrdý, že tři zlaté pšeničné klasy v modrém poli si zvolil jako součást svého biskupského erbu. Hané zůstal věrný po celý život. Po skvěle absolvovaném studiu na Slovanském gymnáziu v letech 1877 - 1885 (dvojku měl jedině v kvintě - z náboženství) absolvoval Cyrilometodějskou bohosloveckou fakultu. Na kněze byl vysvěcen v roce 1889 a jeho první kaplanská působiště byla v Bartošovicích u Příbora a v Kelči.Od roku 1894 dvacet let přednášel na CMTF církevní právo (dosáhl akademické hodnosti docenta). Jeho odborná právnická zdatnost se projevila při přípravě nového církevního zákoníku (Codex iuris canonici). Prečanovo zpracování bylo Svatým stolcem do nového kodexu převzato beze změny a papež Benedikt XV. autora vyznamenal hodností papežského komořího. Také jako sekretář olomoucké arcibiskupské konzistoře vynikal pracovitostí a hýřil iniciativou. Správu arcidiecéze převzal 30. prosince 1923 v době zjevného napětí mezi katolickou církví a čs. státem, těsně po pozemkové reformě, v níž arcibiskupství ztratilo 92 % orné půdy, v době módní vlny „odpadlictví“ a na prahu hospodářské krize. Prečanovo diplomatické urovnání vztahů se státem se projevilo přátelskými návštěvami presidenta T. G. Masaryka a dr. E. Beneše v olomouckém arcibiskupském paláci. Své mimořádné organizační schopnosti osvědčil jako hlavní organizátor křesťanských unionistických sjezdů na Velehradě (1924, 1927 a 1936), v Lublani (1925) a v Praze (1932). V roce 1935 předsedal přípravnému výboru Prvního celostátního sjezdu čs. katolíků v Praze, který svou mohutností a pojetím udivil tehdejší svět. Největší úctu si však arcibiskup Prečan vydobyl jako moudrý národohospodář, finančník a investor, který v době krize prozíravě vytvářel každoročně tisíce pracovních příležitostí. Kromě rekonstrukce a budování nových církevních staveb budoval hospodářské objekty, sloužící obecnému prospěchu dodnes (např. obilní silo v Holešově, hydroelektrárnu na Čeladné, strojní pily na Ostravici a v Rajnochovicích, železniční vlečku a zotavovnu v Bílé, olomouckou tiskárnu Našinec, kroměřížský pivovar, školu v Pržně, kněžský lázeňský dům v Karlových Varech, rekonstruoval olomoucký kněžský seminář atd.) Osmdesátiny presidenta T. G. Masaryka oslavil darem půl miliónu korun na stavbu útulku pro důchodce. Dr. Prečan byl i znalcem a štědrým mecenášem umění. Vybudoval moderní chrám sv. Cyrila a Metoděje na olomouckém předměstí v Hejčíně, vysvěcený roku 1932, v jehož kryptě je pochován.","name":"Leopold","title":"arcibiskup olomoucký a metropolita moravský","birth":"8. března 1866 Velký Týnec","died":"2. března 1947 Sv. Kopeček u Olomouce "},{"state":0,"id":"id_s138","surname":"Proček","text":"Absolvoval Slovanské gymnázium v roce 1948 a po studiu medicíny se specializoval na ortopedii (od roku 1962 na LF UP).","name":"Jaroslav","title":"lékař, vysokoškolský pedagog","birth":"7. října 1929 Blansko","died":"29. října 1992 Olomouc"},{"state":0,"id":"id_s139","surname":"Procházka František","text":"Po maturitě na SGO v roce 1881 studoval nejdříve bohosloví, avšak v roce 1883 přešel na Filosofickou fakultu Karlo-Ferdinandovy univerzity v Praze, kde studoval latinu, řečtinu a češtinu. Po promoci v roce 1887 působil jako učitel na pražských školách. Vydal přes 30 básnických sbírek. Je například i autorem veršované pohádky z prostředí hanáckého venkova Ječmínek.","name":"Serafín","title":"učitel, spisovatel, překladatel a knihovník","birth":"15. ledna 1861 v Náměšť na Hané","died":"28. ledna 1939 Praha"},{"state":0,"id":"id_s140","surname":"Prucek","text":"Maturoval na Slovanském gymnáziu v roce 1945. Byl archivářem Olomouckého archivu, od roku 1968 vedl jeho samostatnou pobočku ve Šternberku (od roku 1971 měl ve své správě i depozitář v Uničově). Intenzivně se věnoval vlastivědné badatelské a publicistické činnosti, v níž pokračoval i po svém odchodu do důchodu v roce 1986. Publikoval ve vlastivědných sbornících, v odborném i v regionálním tisku (v letech 1974 - 1986 zejména do Kulturního zpravodaje Šternberka); dále do sborníků Historická Olomouc, Severní Morava, Výroční zprávy Památkového ústavu, v Ročenkách Státního okresního archivu v Olomouci. Jeho příspěvky v té době nalezneme v olomouckém kulturním měsíčníku Kdy - Kde - Co, ve Zprávách Vlastivědného ústavu v Olomouci, ve Vlastivědných listech a v deníku Lidová demokracie.","name":"Josef","title":"archivář, vlastivědný spisovatel a publicista","birth":"9. března 1926 Olomouc","died":"16. září 2011"},{"state":0,"id":"id_s141","surname":"Přikryl","text":"Po maturitě na SGO v roce 1881 a studiích medicíny se usadil v roce 1887 jako český lékař v Prostějově. Své síly věnoval národní, hospodářské a organizační práci pro město Prostějov. Zasadil se o vymanění prostějovské radnice z německé správy. Byl též zvolen starostou města Prostějova (1914 - 1919). Dal podnět k vybudování údolní přehrady u Stichovic (dnešní vodní nádrž Plumlov). Pečoval o osiřelé děti a zasloužil se o zlepšení zdravotní péče v Prostějově i na celé Moravě (Zdravotní zemský zákon 1909). Za jeho působení starosty byla dokončena stavba nové prostějovské radnice (1914). Byl třikrát poslancem Moravského sněmu (1902, 1906, 1913). Pro funkční období 1920 - 1925 byl zvolen senátorem Národního shromáždění ČSR. Je autorem memoárových prací a poezie i prózy psané hanáckým dialektem (např. Hanácky pěsničke, Chabašči, Bévávalo, Časy tvrči než ocel, Ešče z Hané, Haná a Romža a další).","name":"Ondřej","title":"politik, spisovatel, starosta Prostějova","birth":"16. listopadu 1862 Výšovice u Prostějova","died":"22. prosince 1936 Prostějov"},{"state":0,"id":"id_s142","surname":"Reif","text":"Po maturitě na SGO v roce 1956 studoval medicínu na LF UP. Po promoci v roce 1962 byl chirurgem nemocnice v Bruntále a od roku 1966 se specializoval na urologii ve FNO. Z tohoto oboru obhájil v roce 1988 kandidátskou práci; v roce 1990 se habilitoval. Kromě činnosti zástupce Urologické kliniky FNO se podílel na praktické výuce mediků, byl členem Komise pro státní zkoušky z chirurgie. Je autorem nebo spoluautorem 35 časopiseckých prací a monografií. Je korektorem periodika Urologie v praxi a rovněž aktivně pracuje v České lékařské společnosti JEP a v Evropské urologické společnosti.","name":"Richard","title":"lékař, vysokoškolský pedagog","birth":"6. září 1939 Olomouc","died":""},{"state":0,"id":"id_s143","surname":"Richter","text":"Po maturitě na SGO v roce 1903 absolvoval olomouckou teologickou fakultu (ordinován v roce 1907). Působil jako vikář farního kostela u sv. Mořice v Kroměříži, v letech 1937 - 1946 byl ředitelem arcibiskupského archívu a knihovny v Kroměříži. Má velké zásluhy na uchránění svěřených archiválií před válečnými škodami. Po válce působil pedagogicky na kroměřížských středních školách. Byl ve své době i uznávaným autorem odborných textů. ","name":"Alois","title":"archivář, spisovatel ","birth":"19. listopadu 1884 Mohelnice","died":" 18. srpna 1958 Tovačov"},{"state":0,"id":"id_s144","surname":"Richter","text":"Po maturitě na SGO v roce 1916 vystudoval v Praze biochemii. V poválečných letech působil na LF UP v Olomouci, kde zakládal katedru Lékařské biochemie. Po odchodu do Prahy byl přednostou II. Ústavu pro lékařskou chemii UK. Zabýval se výzkumem biologických pigmentů a klinickou biochemií. Dosáhl akademické hodnosti vysokoškolského profesora. Je autorem nebo spoluautorem více než 100 knih, učebnic a původních vědeckých prací.","name":"Antonín Felix","title":"biochemik, vysokoškolský pedagog","birth":"3. července 1895 Dolany u Olomouce","died":"8. září 1979 Praha"},{"state":0,"id":"id_s145","surname":"Rypka","text":"Pocházel z železničářské rodiny. Obecnou školu navštěvoval v Provodově a gymnazijní studia zahájil v Litomyšli. Koncem primy přestoupil na Slovanské gymnázium, na němž maturoval s vyznamenáním v roce 1891. Stal se poštovním úředníkem v Olomouci, a od roku 1908 působil na nádražním poštovním úřadu v Přerově. Události první světové války ho přivedly do řad Čs. legií. Od listopadu 1918 řídil poštovní úřad Olomouc 1. V roce 1921 byl jmenován ředitelem a v tomto postavení byl v roce 1931 penzionován. Josef Rypka byl vlastencem, aktivně působil v českých spolcích, např. v Matici školské, v Národní jednotě, v Nezávislé jednotě legionářské, ale i v Klubu přátel umění, v Botanické zahradě a od roku 1921 ve Vlastenecké společnosti muzejní. ","name":"Josef","title":"legionář, poštovní úředník","birth":"12. srpna 1872 v Ústí nad Labem","died":"28. července 1945 Olomouc"},{"state":0,"id":"id_s146","surname":"Sach","text":"Po maturitě na SGO v roce 1873 a vysokoškolských studiích učil řadu let na Zemské reálce v Prostějově obdivuhodné kombinaci předmětů: českému jazyku, němčině, matematice a fyzice. Vděčně na něj vzpomínají na Gymnáziu Ladislava Jaroše v Holešově, které navazuje na tradice tamní reálky. K 1. srpnu 1899 byl totiž prof. Sach jmenován zakládajícím ředitelem Vyšší reálky v Holešově, na níž působil až do svého odchodu do penze.","name":"Leopold","title":"středoškolský pedagog","birth":"19. listopadu 1851 Kožušany u Olomouce","died":"24. července 1921 Holešov"},{"state":0,"id":"id_s147","surname":"Sedláček","text":"Po maturitě na SGOv roce 1943 a vysokoškolských studiích působil v letech 1951 - 1957 na katedře lékařské fyziky LF UP a později na HES v Olomouci. Je spoluautorem několika vysokoškolských učebnic. Aktivně pracoval i v Sekci Slovanského gymnázia VSMO.","name":"Jaroslav","title":"lékař, vysokoškolský pedagog","birth":"26. března 1924 Olomouc","died":"23. prosince 1986 Olomouc"},{"state":0,"id":"id_s148","surname":"Sedláčková","text":"Maturovala na Slovanském gymnáziu v roce 1924 a po absolutoriu brněnského Učitelského ústavu působila na obecných a měšťanských školách v Olomouci (1929-1942) a poté do roku 1951 v Brně. Plných 25 let se věnovala práci s dětskými sbory (v Olomouci vedla osmdesátičlenný dětský sbor). Byla i metodičkou hudební výchovy a v letech 1947 - 1948 působila jako lektorka na katedře hudební výchovy Pedagogické fakulty. ","maiden":"Reindlová","name":"Jitka","title":"hudební pedagožka, sbormistryně","birth":"16. února 1905 Olomouc","died":"28. dubna 1951 Brno"},{"state":0,"id":"id_s149","surname":"Scheinar","text":"Absolvoval Slovanské gymnázium v roce 1948. Po studiích lékařství působil od roku 1954 na urologické klinice FNO (v letech 1990 - 1995 byl přednostou této kliniky). Od roku 1990 přednášel na Lékařské fakultě UP dětskou urologii. Jeho vědeckovýzkumná činnost, jejíž výsledky publikoval v 80 vědeckých monografiích a článcích, byla zaměřena zejména na karcinom prostaty.","name":"Jiří","title":"lékař, univerzitní profesor","birth":"29. října 1919 Ostrava","died":"Svinov"},{"state":0,"id":"id_s150","surname":"Schenk","text":"Maturoval na Slovanském gymnáziu ve válečném roce 1916. Po právnických studiích vykonával funkci odborného rady kancléře prezidenta republiky a v roce 1928 jej prezident T. G. Masaryk jmenoval svým osobním tajemníkem. Podílel se tak na všech prezidentových rozhodnutích. Tuto funkci vykonával až do smrti TGM v roce 1937. ","name":"Antonín","title":"osobní tajemník prezidenta T. G. Masaryka","birth":"23. prosince 1896 Sv. Kopeček u Olomouce","died":"20. května 1970 Praha"},{"state":0,"id":"id_s151","surname":"Skopalík","text":"Maturoval na Slovanském gymnáziu v roce 1941. Po válce vystudoval na UK v Praze práva a usadil se ve Velkém Týnci. V důsledku perzekuce tehdejšího režimu musel svou praxi podnikového právníka v Obchodních sladovnách Olomouc přerušit a svůj „kádrový profil“ si v letech 1951 - 1953 „vylepšovat“ jako dělník olomoucké teplárny. Ke své profesi se pak vrátil v podniku JUTA a posléze v Solných mlýnech v Holici. V roce 1961 byl zvolen do rady MNV a o dva roky později se stal předsedou Kulturního a společenského střediska ve Velkém Týnci, které bylo pod jeho vedením brzy nejlepší v okrese. V letech 1963 - 1968 byl ředitelem Komunálních služeb ve Velkém Týnci. Zasloužil se o záchranu chátrajícího objektu místního zámku. Své ovoce přinášela i Skopalíkova koncepce rozvoje obce. S nástupem „normalizace“ byl dr. Skopalík zbaven všech funkcí. Vrátil se do Olomouce a až do svého odchodu do důchodu působil jako právník Dopravních staveb Olomouc. Publikoval články v odborných časopisech a v regionálním tisku.","name":"Jan","title":"právník a odborný publicista","birth":"30. prosince 1921 Vsisko","died":""},{"state":0,"id":"id_s152","surname":"Skopalík","text":"Maturoval na Slovanském gymnáziu v roce 1939. Po válce studoval filologii a celý život se věnoval pedagogické profesi na středních školách na jižní Moravě. Od mládí se zajímal o lidovou slovesnost a lidové zvyky na Hané. O kultuře, folkloru a o zvycích z jižní Moravy publikoval zejména po roce 1989 v časopisu Moravský jih. V Týneckých listech publikoval vzpomínky na čas dětství a lidovou kulturu v rodném kraji. V roce 2000 psal tamtéž O čase adventním a vánočním. Hanácký kalendář 2007 otiskl jeho humorně laděný článek Gregofsky hode.","name":"Jindřich","title":"středoškolský pedagog\t","birth":"13. ledna 1920 Vsisko","died":"15. února 2000 Mikulov"},{"state":2,"id":"id_s153","surname":"Skyva","text":"Po maturitě na Slovanském gymnáziu v roce 1899 a vysokoškolských studiích přírodních věd byl v letech 1905 - 1908 profesorem přírodovědy, matematiky a fyziky na Slovanském gymnáziu. Přešel pak do Brna, kde se vypracoval na vedoucího botanického oddělení Zemského muzea. Ve své době byl renomovaným odborníkem, který byl autorem řady oblíbených atlasů hub.","name":"František","title":"botanik, mykolog, středoškolský profesor","birth":"12. února 1880 Luběnice","died":"1966"},{"state":0,"id":"id_s154","surname":"Smékal","text":"Již za studií na Slovanském gymnáziu založil se svými spolužáky na přelomu let 1937-1938 první olomoucký swingový orchestr, který hrával zejména na studentských akcích pod názvem „Cholera - Boys“. Pravidelně vystupovali i na akcích v Prostějově. (Obtížně dostupný notový materiál tehdejších hitů jim obstarávala Mojmírova sestra, která byla svého času slavnou filmovou herečkou, působící pod uměleckým jménem Florence Marly - hrála m.j. ve filmu Krakatit princeznu). Mojmír maturoval v roce 1939 a po právnických studiích se stal redaktorem hudebního vysílání Československého rozhlasu.","name":"Mojmír","title":"právník, skladatel, saxofonista a hudební redaktor","birth":"27. května 1920 Olomouc","died":"21. září 1995 Praha"},{"state":0,"id":"id_s155","surname":"Smyčka","text":"Po maturitě na SGO v roce 1891 nejdříve studoval bohosloví, ale po dvou letech přešel na KARLO-Ferdinandovu univerzitu do Prahy, kde studoval přírodní vědy. Během vysokoškolského studia asistoval v Museu království českého u prof. Friče. Po promoci působil jako středoškolský profesor v Prostějově, od roku 1907 byl okresním školním inspektorem v Zábřehu na Moravě a posléze se vrátil k pedagogické praxi na gymnáziu v Kroměříži. Byl významným badatelem čelechovického devonu a dlouholetým členem a činovníkem Přírodovědného klubu v Prostějově.","name":"František","title":"přírodovědec, středoškolský pedagog","birth":"19. července 1870 Drahanovice","died":"1. května 1918 Kroměříž "},{"state":0,"id":"id_s156","surname":"Smyčka","text":"Po maturitě na SGO v roce 1876 a studiích medicíny v Praze se vrátil do rodného kraje. Od roku 1885 působil jako lékař v Litovli. Měl velkou přirozenou autoritu. Po vzniku ČSR v roce 1918 byl zvolen druhým českým starostou Litovle. Tuto funkci vykonával do roku 1924, kdy ze zdravotních důvodů abdikoval. Za Rakouska-Uherska byl vůdčí osobností českého vlasteneckého života v Litovli. Založil litovelské muzeum, psal kroniku muzea, vedl městský archív a Pamětní knihu města. Oblastí jeho zájmu byla etnografie a vlastivěda.","name":"Jan","title":"lékař, regionální historik, starosta Litovle","birth":"21. května 1855 Cholina","died":"15. října 1927 Litovel"},{"state":0,"id":"id_s157","surname":"Smýkal","text":"Po maturitě na SGO v roce 1884 byl úředníkem, od roku 1895 se věnoval novinářství. Postupně pracoval v redakcích ostravských Našich otázek, měsíčníku Kraj a v letech 1899 až 1907 byl odpovědným redaktorem Listů těšínských. Významně přispěl k jejich zdokonalení a zpestření o vlastenecky zaměřenou poezii a prózu. Aktivitami v četných spolcích přispíval k česko-polskému porozumění, byl činovníkem divadelního ochotnického spolku a často přednášel v Matici osvěty lidové… V časopisech mimo Slezsko psával pod šifrou J.S.D. Po návratu na Hanou redigoval v Prostějově časopis Národní jednoty Hlasy z Hané a od roku 1919 pokrokový deník Pozor. Od roku 1933 žil na odpočinku střídavě v Olomouci a v Luhačovicích, kde v roce 1940 zemřel.","name":"Josef","title":"redaktor, vydavatel, kulturní a divadelní pracovník","birth":"10. září 1863 Drahlov","died":"2. června 1940 v Luhačovice"},{"state":0,"id":"id_s158","surname":"Spáčil","text":"Navštěvoval primu na piaristickém gymnáziu v Kroměříži a následně Slovanské gymnázium v Olomouci, na němž maturoval v roce 1878. Studia bohosloví nedokončil a věnoval se práci novináře a spisovatele. Od roku 1882 pracoval v redakci vídeňského časopisu Der Parlamenter, po jeho zániku byl v redakcích řady časopisů, např. pražské Politiky, v letech 1894 - 1901 v brněnském Hlasu a v závěru své kariéry v olomouckém Našinci. Jeho vlastní jméno je Jan Spáčil (na jeho počest je v Brně - Černovicích pojmenována ulice). Užíval pseudonym P.S.Eudonym. Oblíbená byla jeho přírodní lyrika, např. První jaro, psal i v nářečí, např. Motivy z Hané. Z francouzštiny překládal dílo Victora Huga, naopak do němčiny překládal dílo Karla Havlíčka Borovského a Jaroslava Vrchlického. Jeho nejznámější sbírkou je titul Výše a propasti. ","name":"Žeranovský Jan","title":"hanácký spisovatel a redaktor","birth":"26. ledna 1857 Žešov u Prostějova","died":"9. ledna 1905 Šternberk"},{"state":0,"id":"id_s159","surname":"Stejskal","text":"Na Slovanském gymnáziu maturoval v roce 1910. Na Filosofické fakultě UK byl posluchačem profesorů T. G. Masaryka, F. Krejčího, F. Drtiny a F. Čády. Získal způsobilost pro vyučování v oborech klasické filologie (latina, řečtina a francouzština). Pod vedením prof. dr. Františka Čády se zaměřil na studium a vědeckou práci v oborech pedagogika a psychologie. Zpočátku pedagogicky působil na pražských gymnáziích. Od roku 1913 se věnoval pedopsychologické diagnostice v Ústavu pro výzkum dítěte v Praze. Absolvoval studijní pobyty na universitách v Hamburku (u zakladatele „diferenciální psychologie“ prof. Williama Louise Sterna) a v Ženevě (u prof. Édouarda Claparéda). Po návratu hojně časopisecky publikoval, spoluzaložil Studentskou poradnu pro volbu povolání; jeho řečnické a argumentační umění jej postavilo do čela pedagogických sjezdů pro výzkum dítěte v Praze (1926 a 1934) a v Bratislavě (1930). Počátkem třicátých let byl jmenován členem komise expertů pro reformu střední školy pro MŠNO. Od roku 1936 řídil Zemský pedologický ústav v Praze. Vypracoval i projekt reformy Jugoslávského školství, za což byl 18. 4. 1935 v Bělehradě dekorován srbským carem Petrem II. Řádem sv. Sávy III. stupně. Společně s prof. Josefem Švejcarem a dr. Václavem Vojtou založil Ústav pro matku a dítě v Praze - Hodkovičkách. Za okupace učil na gymnáziu v Křemencové ulici. Byl aktivní v protinacistickém odboji.V roce 1949 byl předčasně penzionován a v červnu 1950 přepaden státní bezpečností a po více než rok trvající vazbě byl v září 1951 protiprávně odsouzen za vlastizradu. Postupně byl internován mj. ve věznicích Pankrác - Bory - Mírov - Brno - Ilava - Leopoldov. Ve vězení dostal tuberkulózu, při výsleších mu vyrazili zuby, později téměř oslepl. Z vězení byl propuštěn po více než deseti letech na základě všeobecné amnestie v roce 1960. S rodinou pak žil v Novém Městě pod Smrkem, kam byla deportována jeho manželka s dětmi (16letou dcerou a 14letým synem, kteří byli odvedeni policií přímo z vyučování) brzy po jeho uvěznění. Majetek z jejich pražské vily (včetně rozsáhlé knihovny), byl rozkraden. V době Pražského jara v roce 1968 se doc. Stejskal nakrátko vrátil na FF UK v Praze. Jeho podlomené zdraví mu však neumožnilo se z návratu na akademickou půdu těšit dlouho. ","name":"Cyril","title":"vysokoškolský pedagog, politický vězeň","birth":"31. prosince 1890 Štarnov","died":"10. září 1969 Nové Město pod Smrkem"},{"state":0,"id":"id_s160","surname":"Stejskal","text":"Po absolutoriu Slovanského gymnázia v roce 1914 studoval v Olomouci bohosloví. Po vzniku ČSR z katolické církve vystoupil. Byl jedním ze zakládajících členů Církve československé husitské (8. ledna 1920) a jedním z jejích průkopníků na Moravě. Byl farářem ve Velkém Týnci a ve Vacanovicích. Po návratu ze studií v Paříži v roce 1924 byl tajemníkem patriarchy a 6. dubna 1925 byl zvolen biskupem CČSH moravským, s působností i pro Slovensko a Podkarpatskou Rus. V teologii CČSH hájil princip svědomí a formuloval text Vyznání víry československé. Byl i redaktorem Náboženské revue. V době svého pařížského pobytu napsal studii Les Proces de Jean Huss, jíž zpřístupnil osobnost a učení Mistra Jana Husa západním teologickým kruhům.","name":"Josef Rostislav","title":"biskup Církve československé husitské","birth":"27. dubna 1894 Hostkovice","died":"18. září 1946 Olomouc"},{"state":0,"id":"id_s161","surname":"Studnář","text":"Pocházel z rodiny řídícího učitele a nadšeného vlastivědného pracovníka Josefa Studnáře. Gymnázium začal studovat v Brně, maturoval v roce 1900 na Slovanském gymnáziu Olomouc a následně studoval v Praze práva. Po promoci v roce 1906 nastoupil jako koncipient na okresním hejtmanství v Prostějově, kde po vzniku ČSR v roce 1918 stanul v čele Okresního úřadu. Od roku 1928 byl okresním hejtmanem v Moravské Ostravě a v tomto úřadu setrval až do jeho zániku v roce 1941, kdy odešel do penze (v roce 1938 byl povýšen na vládního radu). Byl milovníkem umění a významně podporoval řadu začínajících umělců. Sbíral obrazy, mince a starožitnosti. Z finančních důvodů byl nucen v 50. letech ze své soukromé sbírky odprodat několik obrazů, což bylo totalitní mocí zneužito, kvalifikováno jako spekulace s obrazy a porušení devizového hospodářství. Lidovým soudem v Zábřehu na Moravě byl odsouzen k 3,5 letům odnětí svobody (ve věznici v Il´avě) a k propadnutí veškerého majetku. Dožíval pak u své sestry v Praze a u synovce akad. Malíře Josefa Hrádka (jehož byl kdysi mecenášem) v Jizerských horách. Žádost o rehabilitaci mu byla s nastupující „normalizací“ v roce 1969 zamítnuta. Satisfakce Vrchního soudu v Praze přišla až 24 let po jeho smrti v roce 1993.","name":"František","title":"okresní hejtman","birth":"10. dubna 1880 v Otinoves u Prostějova","died":"22. srpna 1969 Praha"},{"state":0,"id":"id_s162","surname":"Stýskal","text":"Po maturitě na SGO v roce 1952 vystudoval na FF UP obory český jazyk a dějepis. Vyučoval na středních školách v Jeseníku a v Zábřehu na Moravě a po krátkém působení ve Státní vědecké knihovně působil od roku 1961 na katedře českého jazyka a literatury FF UP. Předmětem jeho badatelského zájmu byly dějiny evropského a českého divadla 20. století, dějiny umění a filmu. Spolupracoval na přípravě celostátní přehlídky vědeckých, populárně vědeckých a didaktických filmů a pořadů ACADEMIA Film Olomouc. Za knihu Bedřich Václavek a divadlo získal v roce 1971 prémii Českého literárního fondu. Publikoval pět desítek studií, věnovaných významným osobnostem olomouckého divadla. Po listopadu 1989 se stal zakladatelem a vedoucím nové Katedry teorie a dějin dramatického umění. V roce 1994 byl oceněn Zlatou medailí Univerzity Palackého a nositelem Ceny města Olomouce v oblasti divadlo.","name":"Jiří","title":"literární historik, teatrolog, vysokoškolský pedagog","birth":"30. srpna 1934 Olomouc","died":"6. února 2014 Olomouc"},{"state":0,"id":"id_s163","surname":"Sulovská","text":"Po maturitě na SGO v roce 1975 nastoupila na Lékařskou fakultu Univerzity Palackého v Olomouci, kde promovala v roce 1981. Profesní kariéru zahájila na Oddělení klinické hematologie ve Fakultní nemocnici Olomouc, kde zároveň v letech 1986 až 2001 působila jako zástupkyně přednosty pro léčebnou péči. Postupně se z tohoto oddělení podařilo vybudovat Hemato - onkologickou kliniku. V roce 2001 přešla na Transfuzní oddělení FN Olomouc, kde dosud působí jako vedoucí dárcovského úseku. Po celou dobu předává studentům všeobecného lékařství na LF UP své zkušenosti.","maiden":"Wiedermannová","name":"Ivana","title":"lékařka, vysokoškolská pedagožka","birth":"30. května 1956 Olomouc"},{"state":0,"id":"id_s164","surname":"Svěrák","text":"Po maturitě na SGO v roce 1945 studoval medicínu na LF UK v Praze. Po promoci v roce 1950 působil krátce v Olomouci. Zakotvil ale na oční klinice LF UK v Hradci Králové, kde se posléze stal přednostou oční kliniky. Dne 15. června 1990 byl jmenován vysokoškolským profesorem. Je autorem, příp. spoluautorem 230 vědeckých prací ze svého oboru. O prestiži, kterou měl ve svém oboru, svědčí jeho zvolení místopředsedou Oftalmologické společnosti. Byl rovněž členem mezinárodní organizace oftalmologů ISCEV.","name":"Jaromír","title":"lékař, vysokoškolský pedagog ","birth":"9. června 1926 Kelč","died":"13. května 2008 Hradec Králové"},{"state":0,"id":"id_s165","surname":"Svoboda","text":"Po maturitě na Slovanském gymnáziu v roce 1882 vystudoval v Praze obory český jazyk, latinu a řečtinu. Předmětům své aprobace vyučoval převážně na Gymnáziu Františka Palackého ve Valašském Meziříčí (1913 -1929).","name":"Karel","title":"gymnaziální profesor a ředitel","birth":"27. října 1862 Bystřice pod Hostýnem","died":"28. února 1937 Valašské Meziříčí"},{"state":0,"id":"id_s166","surname":"Svozil","text":"Po maturitě na SGO v roce 1891 a studiu bohosloví působil ve farnostech ve Slezsku a v Bystřici pod Hostýnem. Po konfliktu s arcibiskupstvím vystoupil v roce 1903 z církve, oženil se a svůj intelektuální potenciál uplatňoval jako novinář. Byl redaktorem Moravského kraje v Brně a v letech 1909 - 1918 šéfredaktorem Českého slova. Věnoval se rovněž překladatelství. V roce 1918 byl členem Revolučního národního shromáždění a za Národně-socialistickou stranu byl senátorem.","name":"Josef","title":"novinář, poslanec","birth":"18. dubna 1873","died":"28. března 1949 Praha"},{"state":0,"id":"id_s167","surname":"Ščudlík","text":"Absolvent Slovanského gymnázia z roku 1946. Hudebně se vzdělával u holického varhaníka J. Pavlovského a v hudební škole Žerotín, klavír a dirigování u Dalibora Doubka. V letech 1948 - 1962 byl kmenovým členem souboru Kašpárkova říše. Skládal scénickou hudbu a hrál na klavír. Byl sbormistrem Žerotína, v letech 1962 - 1972 řídil olomoucký pěvecký sbor Dvořák. Působil jako metodik krajského domu osvěty, od roku 1960 ředitelem Okresního domu osvěty a od 1. ledna 1970 řídil Park kultury a oddechu v Olomouci.","name":"Svatopluk","title":"varhaník, sbormistr a kulturní pracovník","birth":"10. prosince 1927 Frýdek-Místek","died":"15. prosince 1981 Olomouc"},{"state":0,"id":"id_s168","surname":"Ščudlíková","text":"Na Slovanském gymnáziu maturovala v roce 1945. Po celý život pracovala ve zdravotnictví. Se svým manželem Svatoplukem Ščudlíkem se významně podílela na kulturním životě města Olomouce.","name":"Dagmar","title":"členka ochotnického divadla Mrštík a Kašpárkova říše","birth":"16. dubna 1926 Frýdek-Místek","died":"27. června 1997 Olomouc"},{"state":0,"id":"id_s169","surname":"Šišma","text":"Po maturitě na SGO v roce 1902 studoval v Praze, kde posléze působil na reálce jako profesor. Během 1. světové války byl legionářem na italské frontě. Hojně překládal z Italštiny, přeložil například dílo Benedetta Croceho. Hojně publikoval v dobovém tisku.","name":"František","title":"středoškolský profesor, legionář, překladatel","birth":"31. srpna 1882 Cholina","died":"19. února 1962 Praha"},{"state":1,"id":"id_s170","surname":"Škoda","text":"Patřil k zakládající generaci profesorů Slovanského gymnázia, na němž učil v letech 1867 - 1870 latinu a řečtinu. Poté se stal prvním ředitelem gymnázia v Přerově, kde působil až do své smrti v roce 1885. Své bohaté znalosti jazyků zhodnotil jako překladatel divadelních her zejména z francouzštiny, ale i jako autor ve své době oblíbených her. Na počest prof. Jakuba Škody nese současné přerovské gymnázium jeho jméno.","name":"Jakub","title":"středoškolský profesor spisovatel a překladatel","birth":"30. dubna 1835 Počátky u Havlíčkova Brodu","died":"29. října 1885 Přerově "},{"state":2,"id":"id_s171","surname":"Špaček","text":"Po maturitě na SGO v roce 1883 a po studiích teologie byl v roce 1887 vysvěcen na kněze. Působil jako kaplan v Potštátě u Hranic a faráře u sv. Michala v Olomouci. Vrátil se na Slovanské gymnázium a pedagogicky na něm působil jako katecheta římsko-katolického náboženství do roku 1912. Současně byl i katechetou na olomoucké německé reálce. Byl autorem mnoha náboženských spisů. Vyvrcholením jeho profesní kariéry bylo působení v čele Cyrilometodějské bohoslovecké fakulty ve funkci děkana.","name":"Richard","title":"středoškolský a vysokoškolský pedagog","birth":"23. listopadu 1864 Laškov","died":"23. září 1925 Olomouc  "},{"state":0,"id":"id_s172","surname":"Šprinc","text":"Po maturitě na SGO v roce 1906 studoval na univerzitě v Praze a ve Vídni. Každé prázdniny se věnoval své veliké lásce - knihovnictví - jako knihovník Národní jednoty. Z amatérského entuziasmu se posléze vyvinul zájem profesní, který Šprinc zdokonalil specializačním studiem v knihovnickém centru v Lipsku. Zpočátku byl středoškolským profesorem na gymnáziu v Zábřehu na Moravě a na Obchodní akademii v Prostějově, kde rovněž založil okresní osvětový sbor. K 1. srpnu 1920 byl jmenován ředitelem první české Městské knihovny v Olomouci. Její knižní fond během svého působení rozhojnil z 3 419 svazků na 15 828 svazků. Na městských předměstích vytvořil sedm knihovních poboček. Založil samostatné oddělení pro mládež a veřejnou čítárnu. Svým přívětivým vystupováním a činorodým idealizmem získával nové a nové dobrovolné spolupracovníky. Sám přitom vyučoval ve státních knihovnických kurzech a pořádal knihovnické aktivy. Byl svolavatelem a organizátorem Prvního sjezdu knihovníků čs. veřejných knihoven, který se konal v Olomouci 17. června 1923. Pod jeho vedením se olomoucká Městská knihovna vyvinula v přední instituci kraje. V Olomouci inicioval postavení pomníku Bedřichu Smetanovi v městském parku. Byl nadšeným esperantistou. Od roku 1912 psal do olomouckého Pozoru divadelní kritiky, ve Stráži Moravy redigoval Hlídku národní výchovy a osvěty. O vážnosti, jíž požíval ve společnosti, svědčí i skutečnost, že byl zvoleným předsedou Spolku odborově organizovaných úředníků. ","name":"Antonín","title":"středoškolský profesor, zakládající ředitel olomoucké knihovny","birth":"9. února 1887 Nová Ulice","died":"23. října 1925 Praha"},{"state":0,"id":"id_s173","surname":"Šprincová","text":"Maturovala na Slovanském gymnáziu v roce 1943 a po vysokoškolských studiích u nás i ve Francii působila od roku 1950 na katedře geografie PřF UP. Ve svém oboru publikovala několik monografií i řadu článků v regionálním a odborném tisku. Významně se angažovala i v organizaci Aliance Francaise, rozvíjející kulturní a odbornou spolupráci s Francií. Svými vzpomínkami přispěla do almanachů SGO. Je zpracovatelkou pozůstalosti významných olomouckých osobností - svého tchána Antonína Šprince i manžela Zdeňka Šprince.","maiden":"Kavanová","name":"Stanislava","title":"geografka","birth":"24. srpna 1924 Olomouc","died":"2. září 2014 Olomouc"},{"state":0,"id":"id_s174","surname":"Šromota","text":"V roce 1873 maturoval na SGO. V r. 1903 zvolen prvním českým starostou města Hranice. Redaktor a zakladatel časopisů Hranicko-lipnické noviny, Hlasy z Pobečví. Od r. 1906 moravský zemský poslanec.","name":"František","title":"advokát, regionální politik, starosta Hranic na Moravě","birth":"28. listopadu 1853 Penčice","died":" 26. října 1912 Hranice na Moravě"},{"state":0,"id":"id_s175","surname":"Štajgr","text":"Přímo z lavic Slovanského gymnázia narukoval na frontu první světové války. Po návratu z ruského zajetí studoval od roku 1919 právnickou fakultu UK v Praze. Následně působil 14 let jako soudce v justiční službě na Slovensku. Od roku 1935 přednášel občanské právo procesní na právnické fakultě KU v Bratislavě, kde byl v roce 1937 jmenován mimořádným profesorem. Po vzniku Slovenského štátu musel Slovensko opustit a válku přečkal se rodinou ve svém rodišti. Po válce byl jmenován vysokoškolským profesorem civilního soudního řízení na Universitě Karlově v Praze. Po zřízení katedry občanského práva stál v jejím čele až do svého penzionování v roce 1969. V mezidobí zastával řadu akademických funkcí (mj. byl proděkanem i děkanem právnické fakulty UK). Napsal významné právnické knihy, např. Zásady civilního řízení soudního (1945), Konkursní právo (1947), Materiální pravda v občanském soudním řízení (1954), Československé mezinárodní civilní právo procesní (1967) atd.","name":"František ","title":"právník, univerzitní profesor","birth":"14. listopadu 1895 Bělkovice","died":"31. srpna 1972 Praha"},{"state":1,"id":"id_s176","surname":"Štefl","text":"Učil na Slovanském gymnáziu v letech 1880-1909 latině, řečtině, češtině a těsnopisu (tedy plných 29 let). Ve své době byl velkou pedagogickou autoritou. Po dobu dvou let byl též správcem knihovny a provedl katalogizaci všech svazků ústavu. V roce 1907-1908 byl jmenován správcem ústavu. Za dlouholeté pedagogické zásluhy byl jmenován školním radou.","name":"Václav","title":"gymnaziální profesor","birth":"7. září 1874 Výrov na Plzeňsku","died":"15. července 1917 Olomouc"},{"state":0,"id":"id_s177","surname":"Šula","text":"Po maturitě na SGO v roce 1940 studoval přírodní vědy na univerzitě v Brně, kde promoval v roce 1947. Po absolutoriu základní vojenské služby nastoupil na katedře botaniky Přírodovědecké fakulty UP, odkud v roce 1951 přešel do olomouckého Vlastivědného muzea („Studijní a lidovýchovný ústav kraje Olomouckého“), jehož součástí byla tehdy i olomoucká hvězdárna, vznikající zoologická zahrada, Ústav léčivých rostlin ve Velkých Losinách, Arboretum v Bílé Lhotě a pět jeskynních systémů. Dr. Šula se zasloužil o odborné uspořádání muzejních sbírek a o modernizaci muzea. Sám se věnoval botanickému výzkumu vápnomilné květeny v Mladči a externě přednášel na PřF UP. Byl rovněž spoluzakladatelem Vlastivědné společnosti muzejní. Celonárodní věhlas mu ale přineslo spoluautorství a účinkování v mimořádně oblíbeném pořadu ostravského televizního studia Lovy beze zbraní (režisér Fr. Mudra). Byl vynikajícím znalcem přírody Severní Moravy. Od dětství byl aktivním skautem a skautským aktivitám se naplno věnoval po roce 1989. Byl instruktorem Lesní školy v Drozdovské pile a ve Smrčině nad Sobotínkem. Jeho školeními prošly stovky skautských vedoucích. Milovníkům přírody a skautům odkázal 4 svazky svých Pohádek lesní moudrosti. V duchu skautské tradice vedl pečlivě dokumentaci života své třídy ze Slovanského gymnázia i všech pomaturitních setkání spolužáků. ","name":"Bohumil","title":"botanik, muzeolog, skaut, spisovatel","birth":"3. ledna 1920 Stavenice u Úsova","died":"2. listopadu 2001 Olomouc"},{"state":0,"id":"id_s178","surname":"Švec","text":"V roce 1941 maturoval na Slovanském gymnáziu. Byl jedním z prvních absolventů studia lékařství na LF UP v Olomouci (1952). Jako oční lékař působil v Prostějově a v Olomouci, dva roky působil jako expert v Tunisu. Od roku 1971 byl přednostou oční kliniky FNO, v roce 1980 byl jmenován rektorem UP.","name":"Václav","title":"lékař, univerzitní profesor","birth":"22. prosince 1922 Karviná","died":"26. července 1986 Olomouc"},{"state":0,"id":"id_s179","surname":"Švéda","text":"Na Slovanském gymnáziu maturoval v roce 1900. Od roku 1927 byl mimořádným profesorem anorganické chemie na UK v Praze. Zabýval se chemií vzácných zemin a analýzou plynů. Patří k zakladatelům mikroanalytických metod.","name":"Josef","title":"chemik, univerzitní profesor","birth":"12. září 1881 Ptení","died":"12. srpna 1929 Vlkava u Mladé Boleslavi"},{"state":0,"id":"id_s180","surname":"Táborský","text":"Pocházel z chudé rodiny obuvníka na Kamenci v Bystřici pod Hostýnem. Z tamní dvojtřídky nastoupil v roce 1870 na Slovanské gymnázium v Olomouci a po maturitě v roce 1878 studoval na FF KFU v Praze češtinu a němčinu. Po celý život učil na pražských středních školách (v letech 1911 - 1921 byl ředitelem Vyšší dívčí školy v Praze). Od svých gymnazijních studií psal poezii. Pod pseudonymem František Hostivít byl významným přispěvatelem almanachu moravské omladiny ZORA. Psal i prózu, překládal slovanské autory, byl redaktorem národopisné revue Naše Valašsko. Jeho rusofilství ho přivedlo dvakrát k návštěvě Ruska a k čilým kontaktům s tamními intelektuály. Byl aktivním členem Matice školské, angažoval se ve vlasteneckých spolcích Radhošť a Svatobor, byl spoluzakladatelem Matice moravské a prvním předsedou Spolku českých bibliofilů. Byl autorem řady monografií a odborné literatury. Jeho nesmrtelným dílem je etnograficky cenná kronika RUSAVA (ilustrovaná Františkem Kašparem). ","name":"František","title":"středoškolský pedagog, překladatel, bibliofil, národopisný spisovatel","birth":"16. ledna 1858 Bystřice pod Hostýnem","died":"20. června 1940 Praha"},{"state":0,"id":"id_s181","surname":"Telíšek","text":"Po maturitě na Slovanském gymnáziu (1951) studoval UP a následně učil na školách v Lipníku nad Bečvou, v Prostějově a v Uničově, kde vychoval i několik reprezentantů v atletice. Své první literární pokusy učinil už během gymnazijních studií. Na souborné výstavě, prezentující jeho malířskou tvorbu, vystavoval 80 olejomaleb. Vydal prózu „Svatokopecké příběhy - aneb na Svatém Kopečku nežijí jen svatí“ a básnickou sbírku „Metamorfózy“.","name":"František","title":"pedagog, básník, prozaik, výtvarník","birth":"5. prosince 1931 Svatý Kopeček u Olomouce","died":""},{"state":0,"id":"id_s182","surname":"Tomášek","text":"Po maturitě na SGO v roce a vojenské službě vstoupil v roce 1918 do arcibiskupského semináře v Olomouci. Na kněze byl vysvěcen arcibiskupem Antonínem Cyrilem Stojanem 5. července 1922. Až do roku 1934 působil jako katecheta v Olomouci-Pavlovicích a v Kelči, od roku 1934 na Cyrilometodějské bohoslovecké fakultě v Olomouci jako asistent, docent (1946) a profesor (1947) pro pedagogiku a katechetiku. V roce 1949 jej papež Pius XII. jmenoval titulárním biskupem butským a světícím biskupem v Olomouci. Tajně jej vysvětil olomoucký arcibiskup Josef Karel Matocha. V době nejostřejších proticírkevních represí komunistického režimu byl v letech 1951-54 internován v pracovním táboře v Želivě. Po propuštění působil do roku 1965 jako římskokatolický kněz v Moravské Huzové, avšak jeho význam byl mnohem větší; v letech 1963-65 se účastnil prací II. Vatikánského koncilu. V roce 1965, kdy kardinál J. Beran odešel z vlasti do Říma, byl F. Tomášek jmenován apoštolským administrátorem pražské arcidiecéze. Po létech zápasů a složitých jednáních se roku 1978 stal arcibiskupem pražským a primasem českým. Mezitím jej roku 1977 jmenoval papež kardinálem. Od konce 70. let byl arcibiskup Tomášek stále hlasitějším a důraznějším obhájcem náboženských práv a důstojného postavení církve ve státě, udržoval kontakty s organizátory tajné církevní i laické činnosti a v 80. letech vystupoval stále výrazněji také na obranu občanských práv a svobod. Stal se postupně jedním z nejvýznamnějších představitelů odporu proti komunistickému režimu. Zasloužil se o prohlášení blahoslavené Anežky České za svatou. V roce 1991 požádal dvaadevadesátiletý arcibiskup, aby byl zproštěn svého úřadu a papež Jan Pavel II. jeho přání vyhověl 27. března 1991.","name":"František","title":"pražský arcibiskup","birth":"30. června 1899 Studénka","died":"4. srpna 1992 Praha"},{"state":0,"id":"id_s183","surname":"Tomek","text":"Po maturitě na SGO v roce 1893 studoval práva v Praze a po promoci v roce 1897 se trvale věnoval advokacii v Olomouci. Mimořádně aktivně se podílel na českém kulturním životě tehdy převážně německého města Olomouce. Od roku 1901 byl členem pěveckého spolku Žerotín (v letech 1920 - 1935 byl jeho předsedou), současně byl od roku 1932 předsedou pěvecké župy Tovačovského, od roku 1907 ve výboru Divadelního družstva a jednoty české divadelní občanské besedy, byl velmi vlivným členem výboru české olomoucké Matice školské; věnoval se i hudební publicistice. Propagoval zejména Slováckou píseň a v roce 1927 vydal Národní písně Slovácka. Pravidelně publikoval i v Časopisu Vlastenecké společnosti muzejní.","name":"Ferdinand","title":"organizátor hudebního života, sběratel lidových písní","birth":"18. dubna 1874 Vídeň","died":"11. prosince 1935 Olomouc"},{"state":1,"id":"id_s184","surname":"Trapl","text":"Studoval na gymnáziu v Českých Budějovicích a poté na FF Karlo-Ferdinandovy univerzity v Praze, kde promoval v roce 1899. Byl středoškolským profesorem matematiky a fyziky v Čáslavi, v Brně, v Přerově a od 1. 9. 1903 až do své předčasné smrti 12 let na Slovanském gymnáziu Olomouc. Byl rovněž správcem profesorské knihovny, staral se o hmotnou podporu chudých studentů, přednáškami z matematiky a fyziky se podílel na zvyšování kvalifikace učitelů měšťanských škol, působil i v Krajinském odboru spolku čs. profesorů","name":"Petr","title":"profesor Slovanského gymnázia","birth":"29. června 1876 Stupná u Českého Krumlova","died":"25. června 1915 Olomouc"},{"state":0,"id":"id_s185","surname":"Turek","text":"Po maturitě na SGO v roce 1968 se vyučil typografem a pracoval v Moravských tiskařských závodech v Olomouci. V roce 1990 spoluzakládal nakladatelství FIN a od roku 1998 je majitelem a spiritus agens NAKLADATELSTVÍ OLOMOUC, které se specializuje na odbornou literaturu, učebnice, slovníky apod. Vydal mnoho desítek vyhledávaných knižních titulů pro nejrůznější vyučovací předměty a typy škol, čímž významně přispěl k zvýšení vzdělanosti nastupující generace. Vydal a sponzoroval i některé tituly krásné literatury a akce Slovanského gymnázia.","name":"Josef","title":"typograf, redaktor, editor, nakladatel","birth":"17. dubna 1950 Přáslavice"},{"state":1,"id":"id_s186","surname":"Tvrdoň","text":"Pocházel z chudé rolnické rodiny. Měl ještě tři mladší sestry. Když mu bylo 10 let, jeho otec odjel za prací do Argentiny, kde zemřel, a rodina zůstala bez prostředků. Hmotná nouze mu neumožnila studovat. Vyučil se zedníkem. Pomáhal matce živit rodinu, pracoval u stavební firmy ve dne jako zedník a v noci jako hlídač na stavbě. Na učitelský ústav v Olomouci se mohl přihlásit teprve tehdy, až jeho mladší sestry začaly pracovat. Po maturitě nesehnal místo, tak se zase vrátil k zedničině. Tragicky osudná se mu stala léta okupace, kdy byl v roce 1942 přidělen na oddělení pro mladistvé na Úřadu práce v Olomouci. Zde zodpovídal za organizaci pracovních sil pro totální nasazení v Říši. I když svého tehdejšího postavení využil k individuální pomoci mnoha lidem a zapojil se do protifašistického odboje, jehož účastníkům obstarával falešné doklady, byl postiženými účastníky vnímán velmi nenávistně, čehož bylo bez přihlédnutí k polehčujícím okolnostem zneužito při jeho odstranění z funkce ředitele (a ze školství vůbec) v roce 1958. Dr. Tvrdoň mohl studovat vysněnou vysokou školu až po válce. Studia češtiny, angličtiny a filosofie zahájil v Brně a po obnovení olomoucké univerzity je dokončil na UP v Olomouci. Po krátkém působení ve Velkých Losinách nastoupil od 1. října 1948 pedagogickou dráhu na Slovanském gymnáziu, kde byl roku 1954 jmenován ředitelem. Vlna rozhořčení absolventů (vyslaných za okupace na práce v Říši) účastnících se 90. výročí oslav založení Slovanského gymnázia dala podnět k jeho odstranění z funkce z politických důvodů. Dr. Tvrdoň se vrátil definitivně k zednické profesi, po léta jako prostý dělník, později jako mistr a stavbyvedoucí. Posléze byl pověřen vedením knihovny Pozemních staveb Olomouc, kde setrval až do odchodu na penzi. Celý život se věnoval svým velkým láskám, českému jazyku a literatuře a studiu cizích jazyků. Psal básně, povídky, divadelní hry i odborné stati (vzhledem k výše popsaným okolnostem buď do „šuplíku“, nebo je publikoval pod cizím jménem), plynně hovořil anglicky, dánsky, švédsky, německy, rusky a srbochorvatsky. Po šichtě odpracované na stavbě po večerech soukromě vyučoval angličtinu. K jeho zálibám patřila i hudba. Vojenskou službu vykonával u vojenské hudby 6. „Hanáckého“ pěšího pluku v Olomouci, kde hrál na tubu. V dalších kapelách také na basu a na housle.","name":"František","title":"lingvista, ředitel SGO, divadelní ochotník, muzikant","birth":"26. března 1913 Kunovice u Uh. Hradiště","died":"24. dubna 1981 Olomouc"},{"state":0,"id":"id_s187","surname":"Typovský","text":"Po maturitě na SGO v roce 1932 studoval medicínu. Jako lékař se specializoval na chirurgii. V letech 1946 - 1955 působil na LF UP. Nadále působil na katedře chirurgie LF UP externě, neboť přesídlil do svého rodiště.","name":"Kamil","title":"chirurg","birth":"13. dubna 1914 Ostrava-Přívoz","died":"13. října 1992 Ostrava"},{"state":0,"id":"id_s188","surname":"Uprka","text":"Studoval Slovanské gymnázium v letech 1878 - 1881 (bydlel v domě na Dolním náměstí 23). Během studia ilustroval studentské časopisy Lípa a Sršeň. Byl i talentovaným hudebníkem - flétnistou. Jeho výtvarný talent ho ale zavedl na AVU do Prahy a od roku 1884 na Malířskou akademii do Mnichova. Na Olomouc vždy rád vzpomínal a často se ke svým olomouckým přátelům vracel. Po ukončení studií se vrátil do svého rodného kraje - Slovácka, kde vytvořil rozsáhlé životní dílo, které je cenným dokumentem regionálního folkloru. Reprodukce jeho obrazů vycházely i v pohlednicových edicích českého olomouckého nakladatele Prombergera.","name":"Joža","title":"akademický malíř","birth":"25. října 1861 Kněždub","died":"12. ledna 1940 Hroznová Lhota"},{"state":0,"id":"id_s189","surname":"Václavek","text":"Po maturitě na SGO v roce 1950 vystudoval německou a českou filologii na Filozofické fakultě Univerzity Palackého v Olomouci (1955), kde nastoupil jako asistent a později působil jako odborný asistent v oboru dějiny německé literatury (1955-1965). Mezi léty 1969-1972 přednášel na Filozofické fakultě Masarykovy univerzity v Brně. Po Sametové revoluci se vrátil na Univerzitu Palackého, kde byl mezi léty 1989-1994 děkanem a od roku 1994 do 1998 vedoucím Katedry germanistiky a nederlandistiky. V roce 1990 byl jmenován profesorem. Předmětem jeho zájmu je především německá literatura v českých zemích v 19. -20. století; zabývá se také literární tvorbou autorů pronásledovaných nacistickým režimem.","name":"Ludvík Emil","title":"univerzitní profesor, germanista, literární historik","birth":"28. dubna 1931 Olomouc","died":""},{"state":0,"id":"id_s190","surname":"Valenta","text":"Po maturitě na SGO v roce 1949 studoval na FF UP. Studia zakončil v roce 1953 doktorátem a následně až do roku 1990 byl mimořádně oblíbeným profesorem gymnázia v Bruntále. Společenská změna po roce 1989 mu umožnila působení na FF UP. V roce 1992 se habilitoval v oboru Dějiny novověké filozofie.","name":"Lubomír","title":"filozof, středoškolský a vysokoškolský pedagog","birth":"24. června 1930 Olomouc"},{"state":2,"id":"id_s191","surname":"Vaněk","text":"Maturoval na Slovanském gymnáziu v roce 1898. Po studiích na Filosofické fakultě UK v Praze se na své gymnázium vrátil jako pedagog, v roce 1905 přešel na Gymnázium Jakuba Škody v Přerově. Od roku 1914 byl školním inspektorem. Ve své době se nesmazatelně vepsal do života přerovské společnosti jako sbormistr pěveckých sborů Přerub a Vlasta (1907-1914) a jako zakladatel a dirigent 1. amatérského symfonického orchestru v Přerově.","name":"Ferdinand","title":"sbormistr, středoškolský pedagog","birth":"28. listopadu 1879 Olomouc","died":"2. dubna 1915 Přerov"},{"state":0,"id":"id_s192","surname":"Vanýsek","text":"Po maturitě na SGO studoval na lékařské fakultě Karlo-Ferdinandovy univerzity v Praze. Po promoci působil od roku 1902 jako asistent profesora MUDr. Josefa Thomayera. Jazykové znalosti ze Slovanského gymnázia uplatnil při studijních stážích v Německu, Rakousku, ve Francii a v Anglii. V roce 1907 byl jmenován prvním českým primářem interního oddělení Zemské nemocnice U svaté Anny v Brně. Od roku 1919 byl profesorem Lékařské fakulty Masarykovy univerzity v Brně a současně přednostou I. interní kliniky, na níž působil do roku 1946. V letech 1926 - 1927 byl děkanem lékařské fakulty a v letech 1932 - 1933 byl rektorem Masarykovy univerzity. Kromě své lékařské a vědecké práce se aktivně podílel na organizování lékařského stavovského hnutí v brněnské Lékařské župě a v Zemské zdravotní radě. Zasloužil se o založení Spolku českých lékařů v Brně, jehož předsedou byl v letech 1926 - 1939. Po válce se podílel na znovuobnovení brněnské interní kliniky a lékařské fakulty MU. Po odchodu do penze byl od roku 1949 závodním lékařem ČSP v Brně a v letech 1955 - 1957 jako lázeňský lékař v Mariánských Lázních, kde náhle zemřel. Na jeho památku je od roku 1985 pořádán brněnským Spolkem českých lékařů Vanýskův den.","name":"Rudolf","title":"lékař, vysokoškolský pedagog","birth":"5. února 1876 Velký Týnec","died":"28. srpna 1957 Mariánské Lázně"},{"state":1,"id":"id_s193","surname":"Vepřek","text":"Učil němčině, latině a řečtině na středních školách v Brně a Uherském Hradišti. Od roku 1891 až do své smrti v roce 1912 byl profesorem Slovanského gymnázia. Byl mimořádně aktivní v tehdejších českých společenských kruzích, kde patřil k nejpopulárnějším olomouckým osobnostem.","name":"Alois","title":"středoškolský profesor, filolog","birth":"1. července 1856 Postřelmov","died":"4. ledna 1912 Olomouc"},{"state":1,"id":"id_s194","surname":"Vévoda","text":"Maturoval v roce 1883 na Arcibiskupském gymnáziu v Kroměříži. Po studiích bohosloví v Olomouci byl v roce 1887 vysvěcen na kněze. Pastoračně působil v Hanušovicích a v Rýmařově, od roku 1892 byl nadačním kaplanem na Nové Ulici v Olomouci. Od roku 1898 byl katechetou na gymnáziu v Zábřehu na Moravě a v letech 1904-1918 na Slovanském gymnáziu Olomouc. Na odpočinku žil jako konsistorní rada ve Vyškově, kde je též pochován (zemřel v brněnské nemocnici). Byl mimořádně literárně činný. Své básně podepisoval pseudonymy Josef Jasanovič, Bohdan Loucký, Adam Kuchlovský. V roce 1892 založil v Olomouci oblíbený obrázkový časopis Náš domov, jehož redakce v roce 1908 přesídlila do Brna. V letech 1914-1919 byl místopředsedou Družiny literární a umělecké.","name":"Josef","title":"profesor Slovanského gymnázia","birth":"1. listopadu 1864 Rychtářov","died":"17. dubna 1927 Brno"},{"state":0,"id":"id_s195","surname":"Viklický","text":"Absolvent Slovanského gymnázia v roce 1966. Od mládí měl fenomenální hudební talent. Muzikou utvářel i neopakovatelnou atmosféru své třídy. Přesto nejdříve vystudoval numerickou matematiku na Přírodovědecké fakultě UP a v tomto oboru dosáhl doktorátu přírodních věd. Inspirován prostředím své rodiny, která má uměleckou tradici výtvarnou i hudební, se ve svém žánru vypracoval na jednoho z nejlepších světových jazzových interpretů. V 70. letech hrál v orchestru SHQ Karla Velebného a v Super Quartet. V letech 1977-1978 studoval jazz na Berklee College v USA. V současnosti vystupuje především s Emil Viklicky \"Grand Moravia\" Trio, Petr Dvorsky - bass, Cyril Zelenak, Tomas Hobzek - drums. Pro oslavy 125. výročí založení gymnázia zkomponoval slavnostní znělku. ","name":"Emil","title":"jazzový pianista, hudební skladatel","birth":"","died":""},{"state":0,"id":"id_s196","surname":"Vitásek","text":"Po maturitě na SGO v roce 1909 studoval na Karlo-Ferdinandově univerzitě v Praze geografii. Následně učil na gymnáziu v Kolíně a od roku 1919 na Obchodní akademii v Praze. V roce 1924 se habilitoval docentem na Přírodovědecké fakultě MU v Brně, kde se roku 1927 stal mimořádným a roku 1931 řádným profesorem zeměpisu. Vybudoval zde moderní univerzitní geografické pracoviště, ale také Geografický ústav ČSAV a v poválečných letech i katedru geografie Přírodovědecké fakulty UP v Olomouci. Mezi svými žáky vychoval stovky následovníků v oboru. Vědecká činnost prof. Vitáska zasahovala zejména do geomorfologie, klimatologie a regionální geografie. Významně rozpracoval problematiku glaciálního zalednění (mj. v roce 1924 napsal knihu Naše hory ve věku ledovcovém), povrchové a podzemní krasové jevy (zejména výzkum Dämenovských jeskyní) a zabýval se velmi aktuálním výzkumem zarovnaných povrchů. Zcela průkopnické ve světovém měřítku jsou jím formulované principy geomorfologického mapování. Současně se zabýval i klimatologií Vysokých Tater, Moravy a Slezska. Hlavní význam vědeckého a pedagogického díla prof. Vitáska spočívá v autorství řady vysokoškolských učebnic, které vychovaly celé generace našich geografů. V prvních poválečných letech byl děkanem Přírodovědecké fakulty Masarykovy univerzity v Brně. V roce 1952 byl zvolen členem korespondentem ČSAV. ","name":"František","title":"geograf, univerzitní profesor ","birth":"7. ledna 1890 Velká Bystřice","died":"19. srpna 1973 Brno"},{"state":0,"id":"id_s197","surname":"Vodička","text":"Maturoval na SGO v roce 1929. Autor životopisů svatých, překládal z angličtiny, spolupracoval s denním tiskem a časopisy katolického směru. Užíval pseudonymu: Christopher P. Waters, Roman Allen, Spectator. Byl redaktorem nakladatelství Velehrad v Olomouci a nakladatelství Universum v Praze.","name":"Timotheus","title":"literární historik, filozof, sociolog, překladatel","birth":"16. září 1910 v Olomouc","died":"12. května 1967 Olomouc"},{"state":1,"id":"id_s198","surname":"Vojtěch","text":"V letech 1903 - 1908 vyučoval matematiku a fyziku na Slovanském gymnáziu. V roce 1909 se habilitoval na České technice v Brně, kde byl v roce 1920 jmenován profesorem a přešel na ČVUT do Prahy. Je autorem a spoluautorem vysoce hodnocených a hojně využívaných středoškolských učebnic matematiky a geometrie, na nichž spolupracoval s olomouckým vydavatelem R. Prombergerem.","name":"Jan","title":"matematik, středoškolský a univerzitní profesor","birth":"5. srpna 1879 Kyjov","died":"19. ledna 1953 Praha"},{"state":0,"id":"id_s199","surname":"Vojtěchovský","text":"Odmaturoval na SGO v roce 1895. Za studií byl fundatistou u hudebního skladatele Josefa Nešvery. Z Olomouce přešel na český učitelský ústav do Brna, kde byl žákem Leoše Janáčka. Od roku 1900 působil na učitelském ústavu v Příboře, kde vyučoval všem hudebním předmětům a vedl kvalitní studentský pěvecký sbor i smyčcový orchestr. Sám byl též výborný barytonista. ","name":"František","title":"dirigent, hudební pedagog","birth":"9. září 1873 Vojtěchov","died":"26. října 1937 Brno"},{"state":1,"id":"id_s200","surname":"Vrzal","text":"Kromě teologického vzdělání měl i vzdělání pedagogické (aprobován pro vyučování českému jazyku, latině a řečtině). V letech 1886 - 1889 učil na gymnáziu Jakuba Škody v Přerově a v letech 1889 - 1907 byl v pořadí třetím ředitelem Slovanského gymnázia Olomouc.","name":"Maxmilián","title":"kněz, ředitel Slovanského gymnázia","birth":"29. dubna 1839 Brtnice u Jihlavy","died":"1. prosince 1913 Praha"},{"state":0,"id":"id_s201","surname":"Vyhlídal","text":"Studoval Slovanské gymnázium v Olomouci, avšak maturoval na gymnáziu v Rychnově nad Kněžnou v roce 1880. Po maturitě se do Olomouce vrátil a studoval na bohoslovecké fakultě. V duchovní službě působil od roku 1886 - jako kaplan a farář ve Velké nad Veličkou, Dobromilicích na Hané, Jaktaři u Opavy, Hulíně, Lobodicích, Švábenicích a nakonec byl ustanoven děkanem ve Vyškově. Ve všech svých působištích se usilovně věnoval národopisné a vlastivědné činnosti. Své poznatky publikoval zpočátku časopisecky a později knižně. Jeho knížky lidové beletrie, soubory povídek, pohádek, národopisných črt a studií představují více než dvacet svazků, často psaných v dialektu (k nejznámějším patří: Příhody z Vysoudilova, Z hanáckých dědin a měst, Pod hanáckou oblohou, Malůvky z Hané a Sbírka her, říkadel a hádanek Hanácké děti). První pojednání o krojích publikoval už v roce 1887 do Časopisu VSMO. V období let 1890 -1898, kdy působil ve Slezsku, psal do Věstníku Matice opavské, ve Slezské kronice publikoval v roce 1893 Slezské pohádky a pověsti a o rok později národopisnou studii Slezská svatba. ","name":"Jan","title":"vlastenecký kněz, spisovatel a národopisný sběratel","birth":"27. dubna 1861 Hluchov na Konicku","died":"18. června 1937 Vyškov"},{"state":0,"id":"id_s202","surname":"Vymětal","text":"Po maturitě na SGO v roce 1921 studoval LF UK Praha. V roce 1931 dosáhl specializace pro obor neurologie a psychiatrie. Od roku 1932 byl přednostou oddělení Vojenské nemocnice v Olomouci na Klášterním Hradisku. V letech 1948-1950 studoval na Vojenské lékařské akademii S. M. Kirova v Leningradě. Od roku 1953 byl členem vědecké rady Ministerstva zdravotnictví.","name":"Osvald","title":"lékař, vysokoškolský pedagog","birth":"22. dubna 1903 Olomouc","died":"8. srpna 1967 Olomouc"},{"state":0,"id":"id_s203","surname":"Wiedermann","text":"Po absolvování SGO v roce 1902 vystudoval obory dějepis a zeměpis na Karlo-Ferdinandově univerzitě v Praze. V letech 1919 - 1936 byl profesorem gymnázia v Zábřehu na Moravě a posléze byl jmenován prvním ředitelem českého gymnázia ve Šternberku (do roku 1938), odkud odešel učit na olomouckou Českou reálku. V době První republiky se významně angažoval v Národní Jednotě.","name":"František","title":"gymnaziální profesor ","birth":"15. ledna 1882  Šumvald","died":"Olomouci 19. prosince 1956 Olomouci"},{"state":0,"id":"id_s204","surname":"Wiedermann","text":"Po maturitě na SGO v roce 1941 a studiích medicíny působil od roku 1950 na katedře chorob vnitřních LF UP. Ve svém oboru byl světově uznávanou kapacitou.","name":"Miloš","title":"lékař, průkopník nukleární medicíny","birth":"11. listopadu 1922 Ráječek u Zábřeha","died":"2005 Olomouc"},{"state":0,"id":"id_s205","surname":"Zábranský","text":"Po maturitě na SGO v roce 1879 a studiích práv v Praze působil od roku 1884 u Krajského soudu v Olomouci. Po třech letech zakotvil v Uherském Hradišti. Dosáhl hodnosti rady zemského soudu. V roce 1912 byl předčasně penzionován pro důrazně české a satirické vystupování a pro výsměch soudní byrokracii ve své literární tvorbě. Ve své době byl oblíbeným autorem humoristických povídek a románů. Psával pro časopis Švanda dudák, do Lidových novin, do časopisů Niva a Osvěta. Používal i další pseudonymy: Florián Čahoun, Kašpar Šťovík, Baltazar Pelyněk. Knižně debutoval autobiografickým románem Z nového labyrintu světa (1907). Jeho humorné a satirické prózy vyšly ve sbírce Na potulkách se Švandou (1919), Tři z Hané (společně s O. Bystřinou a Janem Spáčilem-Žeranovským) a Lásko, milá lásko (1920). Jeho nejhodnotnějším dílem je trilogie Břehule, Polednice, Hastrman (1919). V řeči svých lidových postav důsledně užíval hanácké nářečí.","original_name":"František Červínek","name":"Alois","title":"právník, spisovatel","birth":"8. února 1858 Jáchymov u Nákla","died":"9. září 1921 Uherské Hradiště"},{"state":0,"id":"id_s206","surname":"Zajíček","text":"Maturoval na Slovanském gymnáziu ve válečném roce 1915. Byl odvelen na frontu 1. světové války, takže studium medicíny ukončil až v roce 1923. Byl aktivním účastníkem převratu v roce 1918 v Olomouci. Pracoval v Zemské nemocnici v Olomouci a od roku 1926 měl samostatnou praxi v Náměšti na Hané. Za aktivní účast v protifašistickém odboji byl vězněn v koncentračním táboře. Od roku 1945 byl praktickým lékařem v Olomouci.","name":"Břetislav","title":"lékař a tělovýchovný pracovník","birth":"23. března 1896 Přáslavice","died":"25. prosince 1973 Olomouc"},{"state":0,"id":"id_s207","surname":"Zatloukal","text":"Absolvoval SGO v roce 1935. Od roku 1947 působil na FF UP, kde se specializoval na obor dějiny francouzské literatury. Byl členem Francouzské akademie věd a mj. autorem unikátního díla „Studie o francouzském románu“. Za své celoživotní dílo, věnované šíření francouzského jazyka a kultury byl jmenován Rytířem řádu akademických palem (nejvyšší francouzské vyznamenání udělované intelektuálům).","name":"Antonín","title":"romanista, univerzitní profesor","birth":"7. října 1916 Paršovice","died":"19. listopadu 1998 Olomouc"},{"state":0,"id":"id_s208","surname":"Zeman","text":"Maturoval na Slovanském gymnáziu v roce 1958. Od roku 1962 působil na Katedře matematické analýzy a numerické matematiky Přírodovědecké fakulty UP. V akademických funkcích byl např. i proděkanem PřF UP.","name":"Jiří","title":"matematik","birth":"23. června 1941 Olomouc","died":""}]}